#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.On_Image_AdventureBoardIcon_MouseButtonDown_1
	 */
	struct UAdventurerRankCommonInfo_C_On_Image_AdventureBoardIcon_MouseButtonDown_1_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.GetGameContentID
	 */
	struct UAdventurerRankCommonInfo_C_GetGameContentID_Params
	{
	public:
		class FName                                                OutGameContentId;                                        // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.InitText
	 */
	struct UAdventurerRankCommonInfo_C_InitText_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.InAnimation
	 */
	struct UAdventurerRankCommonInfo_C_InAnimation_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.Construct
	 */
	struct UAdventurerRankCommonInfo_C_Construct_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.Destruct
	 */
	struct UAdventurerRankCommonInfo_C_Destruct_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_140_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_140_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.OnCloseButtonClicked_Event
	 */
	struct UAdventurerRankCommonInfo_C_OnCloseButtonClicked_Event_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.WidgetAnimationEvt_DetailedAnim_K2Node_WidgetAnimationEvent_1
	 */
	struct UAdventurerRankCommonInfo_C_WidgetAnimationEvt_DetailedAnim_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.Init
	 */
	struct UAdventurerRankCommonInfo_C_Init_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_140_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_140_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_BtnCmn08_SeeContents_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_BtnCmn08_SeeContents_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_SBButtonCmn08_C_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.BndEvt__AdventurerRankCommonInfo_CmnBtn01_K2Node_ComponentBoundEvent_9_EventOnClicked__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_BndEvt__AdventurerRankCommonInfo_CmnBtn01_K2Node_ComponentBoundEvent_9_EventOnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.ExecuteUbergraph_AdventurerRankCommonInfo
	 */
	struct UAdventurerRankCommonInfo_C_ExecuteUbergraph_AdventurerRankCommonInfo_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.OnDetailsMode__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_OnDetailsMode__DelegateSignature_Params
	{
	public:
		bool                                                       IsDetailed;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.OnClose__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_OnClose__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.OnAdventureBoardBtn__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_OnAdventureBoardBtn__DelegateSignature_Params
	{	};

	/**
	 * Function AdventurerRankCommonInfo.AdventurerRankCommonInfo_C.OnGuideMessageVisibility__DelegateSignature
	 */
	struct UAdventurerRankCommonInfo_C_OnGuideMessageVisibility__DelegateSignature_Params
	{
	public:
		bool                                                       InVisibility;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
