#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function AwardIconItem.AwardIconItem_C.Get_AwardIconBtn_SetData_ToolTipWidget_1
	 */
	struct UAwardIconItem_C_Get_AwardIconBtn_SetData_ToolTipWidget_1_Params
	{
	public:
		class UWBP_CommonToolTipDetail_Fixed_C*                    ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.OnLoaded_DF1405EB4B765EAB9E4E3880C6A49640
	 */
	struct UAwardIconItem_C_OnLoaded_DF1405EB4B765EAB9E4E3880C6A49640_Params
	{
	public:
		class UObject*                                             Loaded;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.SetIsBtnEnable
	 */
	struct UAwardIconItem_C_SetIsBtnEnable_Params
	{
	public:
		bool                                                       bInIsEnabled;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.SetData
	 */
	struct UAwardIconItem_C_SetData_Params
	{
	public:
		int32_t                                                    InId;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_Button_148_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_Button_148_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.Construct
	 */
	struct UAwardIconItem_C_Construct_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_AwardIconBtn_Hide_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_AwardIconBtn_Hide_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_AwardIconBtn_SetData_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.BndEvt__AwardIconItem_AwardIconBtn_Hide_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	 */
	struct UAwardIconItem_C_BndEvt__AwardIconItem_AwardIconBtn_Hide_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.IconLoadRequest
	 */
	struct UAwardIconItem_C_IconLoadRequest_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.IconLoadStart
	 */
	struct UAwardIconItem_C_IconLoadStart_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.IconLoadRequestCheckStart
	 */
	struct UAwardIconItem_C_IconLoadRequestCheckStart_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.Destruct
	 */
	struct UAwardIconItem_C_Destruct_Params
	{	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.ExecuteUbergraph_AwardIconItem
	 */
	struct UAwardIconItem_C_ExecuteUbergraph_AwardIconItem_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function AwardIconItem.AwardIconItem_C.ClickedBtnAwardList__DelegateSignature
	 */
	struct UAwardIconItem_C_ClickedBtnAwardList__DelegateSignature_Params
	{
	public:
		int32_t                                                    outAwardId;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
