#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.GroundHit_Square
	 */
	struct ABP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Square_Params
	{
	public:
		float                                                      Range;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      SpawnCount;                                              // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.GroundHit_Circle
	 */
	struct ABP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle_Params
	{
	public:
		float                                                      Range;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      SpawnCount;                                              // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.ReceiveBeginPlay
	 */
	struct ABP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.ReceiveTick
	 */
	struct ABP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square
	 */
	struct ABP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.NewEventDispatcher_0__DelegateSignature
	 */
	struct ABP_EF_BPSet_SpawnGround_Circle_Square_C_NewEventDispatcher_0__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
