#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.CheckAbility
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_CheckAbility_Params
	{
	public:
		struct FOwnItemInfo                                        OwnItem;                                                 // 0x0000(0x0150)  (BlueprintVisible, BlueprintReadOnly, Parm)
		bool                                                       FalseIsNone;                                             // 0x0150(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_H7J9[0x7];                                   // 0x0151(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.Check Slot
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_CheckSlot_Params
	{
	public:
		struct FOwnItemInfo                                        OwnItem;                                                 // 0x0000(0x0150)  (BlueprintVisible, BlueprintReadOnly, Parm)
		bool                                                       FalseIsNone;                                             // 0x0150(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.SetupByUniqueId
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_SetupByUniqueId_Params
	{
	public:
		class FString                                              UniqueId;                                                // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.Setup
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_Setup_Params
	{
	public:
		struct FOwnItemInfo                                        OwnItemInfo;                                             // 0x0000(0x0150)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.PreConstruct
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.Construct
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_Construct_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.BndEvt__NewWidgetBlueprint222_CmnClose01_K2Node_ComponentBoundEvent_0_OnClosed__DelegateSignature
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_BndEvt__NewWidgetBlueprint222_CmnClose01_K2Node_ComponentBoundEvent_0_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.Destruct
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_Destruct_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.BndEvt__CommonWeaponAbilityEfficacyDescPopup_SBButtonFullScreen_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_BndEvt__CommonWeaponAbilityEfficacyDescPopup_SBButtonFullScreen_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.OnPressCancelKey
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_OnPressCancelKey_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.ChangeMode
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_ChangeMode_Params
	{
	public:
		bool                                                       AbilityMode;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.BndEvt__CommonWeaponAbilityEfficacyDescPopup_CmnBtn23_T_K2Node_ComponentBoundEvent_4_EventOnClicked__DelegateSignature
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_BndEvt__CommonWeaponAbilityEfficacyDescPopup_CmnBtn23_T_K2Node_ComponentBoundEvent_4_EventOnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.BndEvt__CommonWeaponAbilityEfficacyDescPopup_CmnBtn23_A_K2Node_ComponentBoundEvent_5_EventOnClicked__DelegateSignature
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_BndEvt__CommonWeaponAbilityEfficacyDescPopup_CmnBtn23_A_K2Node_ComponentBoundEvent_5_EventOnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.ExecuteUbergraph_CommonWeaponAbilityEfficacyDescPopup
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonWeaponAbilityEfficacyDescPopup_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommonWeaponAbilityEfficacyDescPopup.CommonWeaponAbilityEfficacyDescPopup_C.OnClose__DelegateSignature
	 */
	struct UCommonWeaponAbilityEfficacyDescPopup_C_OnClose__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
