#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetAdventurerRankAndTotalPowerVisibility
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetAdventurerRankAndTotalPowerVisibility_Params
	{
	public:
		bool                                                       bInIsVisible;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.OnLoaded_32E5319F4F1A48F55A11A1BB2ABB84D7
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_OnLoaded_32E5319F4F1A48F55A11A1BB2ABB84D7_Params
	{
	public:
		class UObject*                                             Loaded;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_2_OnClickEvent__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_2_OnClickEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetCharacterCardData
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetCharacterCardData_Params
	{
	public:
		struct FSBPlayerCharacterCardData                          InPlayerCharacterCardData;                               // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
		bool                                                       bIsUGC;                                                  // 0x00B0(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_5_OnHover__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_5_OnHover__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_6_OnUnhver__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_6_OnUnhver__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_SBButton_C_0_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetFaceBG
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetFaceBG_Params
	{
	public:
		float                                                      InScale;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector2D                                           InPosition;                                              // 0x0004(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_WEEQ[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              URL;                                                     // 0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.ResetFaceBG
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_ResetFaceBG_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetAdventureRank
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetAdventureRank_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetTotalPower
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetTotalPower_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetClassData
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetClassData_Params
	{
	public:
		ESBClassType                                               InCurrentClassType;                                      // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_TDU5[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    InClassLevel;                                            // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<int32_t>                                            InAwardIdList;                                           // 0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetAdventureData
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetAdventureData_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetTotalPowerText
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetTotalPowerText_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetClassType
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetClassType_Params
	{
	public:
		ESBClassType                                               InClassType;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_LPUA[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<int32_t>                                            InAwardIdList;                                           // 0x0008(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetAdventureRankText
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetAdventureRankText_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.ErrorDataSet
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_ErrorDataSet_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetFrame
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetFrame_Params
	{
	public:
		int32_t                                                    InCharacterCardFrameId;                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_0_ClickedBtnAwardIconItemList__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_BndEvt__CommunicateSettingMenu_FaceBgData_CommunicateSettingMenu_ClassData_K2Node_ComponentBoundEvent_0_ClickedBtnAwardIconItemList__DelegateSignature_Params
	{
	public:
		int32_t                                                    AwardId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.PreConstruct
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.EditFrame_AwardIconDisable
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_EditFrame_AwardIconDisable_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.SetAwardId
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_SetAwardId_Params
	{
	public:
		TArray<int32_t>                                            InAwardIdList;                                           // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.Construct
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_Construct_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.ExecuteUbergraph_CommunicateSettingMenu_FaceBgData
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_ExecuteUbergraph_CommunicateSettingMenu_FaceBgData_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.OnUnhover__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_OnUnhover__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.OnHover__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_OnHover__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.OnClickEvent__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_OnClickEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CommunicateSettingMenu_FaceBgData.CommunicateSettingMenu_FaceBgData_C.ClickedBtnAwardItemIconList__DelegateSignature
	 */
	struct UCommunicateSettingMenu_FaceBgData_C_ClickedBtnAwardItemIconList__DelegateSignature_Params
	{
	public:
		int32_t                                                    AwardId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
