#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.EventReceived_CF64C8B04D1460C574E183BA1F5D33C8
	 */
	struct UGA_Action_Attack_C_EventReceived_CF64C8B04D1460C574E183BA1F5D33C8_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.OnCancelled_5CFEF54C48E99683B2F15DB38298EA15
	 */
	struct UGA_Action_Attack_C_OnCancelled_5CFEF54C48E99683B2F15DB38298EA15_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.OnRefused_5CFEF54C48E99683B2F15DB38298EA15
	 */
	struct UGA_Action_Attack_C_OnRefused_5CFEF54C48E99683B2F15DB38298EA15_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.OnCompleted_5CFEF54C48E99683B2F15DB38298EA15
	 */
	struct UGA_Action_Attack_C_OnCompleted_5CFEF54C48E99683B2F15DB38298EA15_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.OnCancelled_A44F33CB4EB8E05E9A81EBB8A3499722
	 */
	struct UGA_Action_Attack_C_OnCancelled_A44F33CB4EB8E05E9A81EBB8A3499722_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.OnRefused_A44F33CB4EB8E05E9A81EBB8A3499722
	 */
	struct UGA_Action_Attack_C_OnRefused_A44F33CB4EB8E05E9A81EBB8A3499722_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.OnCompleted_A44F33CB4EB8E05E9A81EBB8A3499722
	 */
	struct UGA_Action_Attack_C_OnCompleted_A44F33CB4EB8E05E9A81EBB8A3499722_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.EventReceived_6EF7D6834E0D17349213C7B878C9E94B
	 */
	struct UGA_Action_Attack_C_EventReceived_6EF7D6834E0D17349213C7B878C9E94B_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.EventReceived_D04A5F7146685BC738583AA5F1379270
	 */
	struct UGA_Action_Attack_C_EventReceived_D04A5F7146685BC738583AA5F1379270_Params
	{
	public:
		struct FGameplayEventData                                  Payload;                                                 // 0x0000(0x00B0)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.K2_ActivateAbility
	 */
	struct UGA_Action_Attack_C_K2_ActivateAbility_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.K2_OnEndAbility
	 */
	struct UGA_Action_Attack_C_K2_OnEndAbility_Params
	{
	public:
		bool                                                       bWasCancelled;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.SubCommand
	 */
	struct UGA_Action_Attack_C_SubCommand_Params
	{	};

	/**
	 * Function GA_Action_Attack.GA_Action_Attack_C.ExecuteUbergraph_GA_Action_Attack
	 */
	struct UGA_Action_Attack_C_ExecuteUbergraph_GA_Action_Attack_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_R1AO[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
