#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.Finished_7D022C654082BF7654B3B38FE16E6757
	 */
	struct UHistory_DeleteAnnounce_C_Finished_7D022C654082BF7654B3B38FE16E6757_Params
	{	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.Construct
	 */
	struct UHistory_DeleteAnnounce_C_Construct_Params
	{	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.BndEvt__History_DeleteAnnounce_Btn_FullScreen_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHistory_DeleteAnnounce_C_BndEvt__History_DeleteAnnounce_Btn_FullScreen_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.BndEvt__History_DeleteAnnounce_Btn_Close_K2Node_ComponentBoundEvent_1_OnClosed__DelegateSignature
	 */
	struct UHistory_DeleteAnnounce_C_BndEvt__History_DeleteAnnounce_Btn_Close_K2Node_ComponentBoundEvent_1_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.SetInfo
	 */
	struct UHistory_DeleteAnnounce_C_SetInfo_Params
	{
	public:
		ESBHistoryType                                             Type;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_QMQ8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Paid;                                                    // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    Free;                                                    // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_XJJX[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FDateTime                                           Time;                                                    // 0x0010(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.OnEsc
	 */
	struct UHistory_DeleteAnnounce_C_OnEsc_Params
	{	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.ExecuteUbergraph_History_DeleteAnnounce
	 */
	struct UHistory_DeleteAnnounce_C_ExecuteUbergraph_History_DeleteAnnounce_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function History_DeleteAnnounce.History_DeleteAnnounce_C.OnClosed__DelegateSignature
	 */
	struct UHistory_DeleteAnnounce_C_OnClosed__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
