#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.GetToolTipWidget
	 */
	struct UIcon_TacticalAbilityLearning_C_GetToolTipWidget_Params
	{
	public:
		class UWidget*                                             ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetEnableButton
	 */
	struct UIcon_TacticalAbilityLearning_C_SetEnableButton_Params
	{
	public:
		bool                                                       IsEnable;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetVisibleButton
	 */
	struct UIcon_TacticalAbilityLearning_C_SetVisibleButton_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetAmountVisible
	 */
	struct UIcon_TacticalAbilityLearning_C_SetAmountVisible_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetAmountValue
	 */
	struct UIcon_TacticalAbilityLearning_C_SetAmountValue_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_TOEN[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetNewMark
	 */
	struct UIcon_TacticalAbilityLearning_C_SetNewMark_Params
	{
	public:
		bool                                                       IsNew;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetElement
	 */
	struct UIcon_TacticalAbilityLearning_C_SetElement_Params
	{	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetIconBG
	 */
	struct UIcon_TacticalAbilityLearning_C_SetIconBG_Params
	{	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.SetIcon
	 */
	struct UIcon_TacticalAbilityLearning_C_SetIcon_Params
	{	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.Setup
	 */
	struct UIcon_TacticalAbilityLearning_C_Setup_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.PreConstruct
	 */
	struct UIcon_TacticalAbilityLearning_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.BndEvt__Icon_TacticalAbilityLearning_SBButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UIcon_TacticalAbilityLearning_C_BndEvt__Icon_TacticalAbilityLearning_SBButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.ExecuteUbergraph_Icon_TacticalAbilityLearning
	 */
	struct UIcon_TacticalAbilityLearning_C_ExecuteUbergraph_Icon_TacticalAbilityLearning_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Icon_TacticalAbilityLearning.Icon_TacticalAbilityLearning_C.OnClicked__DelegateSignature
	 */
	struct UIcon_TacticalAbilityLearning_C_OnClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
