#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.GenerateList
	 */
	struct UImagineAbilityView_C_GenerateList_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.Construct
	 */
	struct UImagineAbilityView_C_Construct_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_Btn_Select_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_Btn_Select_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.Close
	 */
	struct UImagineAbilityView_C_Close_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_Btn_Select_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_Btn_Select_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_Btn_Select_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_Btn_Select_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_AbilityList_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_AbilityList_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature_Params
	{
	public:
		class UObject*                                             item;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bIsHovered;                                              // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_CmnClose02_K2Node_ComponentBoundEvent_7_OnClosed__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_CmnClose02_K2Node_ComponentBoundEvent_7_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_Btn_Close2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_Btn_Close2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.BndEvt__ImagineAbilityView_AbilityList_K2Node_ComponentBoundEvent_3_SimpleListItemEventDynamic__DelegateSignature
	 */
	struct UImagineAbilityView_C_BndEvt__ImagineAbilityView_AbilityList_K2Node_ComponentBoundEvent_3_SimpleListItemEventDynamic__DelegateSignature_Params
	{
	public:
		class UObject*                                             item;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.ExecuteUbergraph_ImagineAbilityView
	 */
	struct UImagineAbilityView_C_ExecuteUbergraph_ImagineAbilityView_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ZGK7[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.OnClose__DelegateSignature
	 */
	struct UImagineAbilityView_C_OnClose__DelegateSignature_Params
	{	};

	/**
	 * Function ImagineAbilityView.ImagineAbilityView_C.OnSelect__DelegateSignature
	 */
	struct UImagineAbilityView_C_OnSelect__DelegateSignature_Params
	{
	public:
		struct FOwnItemInfo                                        Target;                                                  // 0x0000(0x0150)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
