#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * WidgetBlueprintGeneratedClass ImagineStackBBaseView.ImagineStackBBaseView_C
	 * Size -> 0x03DD (FullSize[0x0655] - InheritedSize[0x0278])
	 */
	class UImagineStackBBaseView_C : public USBStackBMainViewBase
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x0278(0x0008) ZeroConstructor, Transient, DuplicateTransient
		class UWidgetAnimation*                                    InAnim;                                                  // 0x0280(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash
		class UCmnBtn08Effect_C*                                   Btn_Execute;                                             // 0x0288(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class USBButton_C*                                         Btn_ShowHint;                                            // 0x0290(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UCmnBack01_C*                                        CmnBack01_2;                                             // 0x0298(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UCmnBonusLarge_C*                                    CmnBonus;                                                // 0x02A0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UCanvasPanel*                                        Cvs_Dialogs;                                             // 0x02A8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UCanvasPanel*                                        Cvs_Execute;                                             // 0x02B0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              Image;                                                   // 0x02B8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              Image_204;                                               // 0x02C0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              Image_268;                                               // 0x02C8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              Image_418;                                               // 0x02D0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImagineStackBResult_C*                              ImagineStackBResult;                                     // 0x02D8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              Img_HeaderTitle_Battle;                                  // 0x02E0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              Img_HeaderTitle_Enhance;                                 // 0x02E8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UCmnAnim_LiquidMemoryActive_C*                       LiquidMemory;                                            // 0x02F0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UMyWalletWidget_C*                                   MyWalletWidget;                                          // 0x02F8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBFailedAnimation_C*                            StackBFailedAnimation;                                   // 0x0300(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBNetworkLoadView_C*                            StackBNetworkLoadView;                                   // 0x0308(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBSuccessAnimation_C*                           StackBSuccessAnimation;                                  // 0x0310(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBStepButton_C*                                 StepBtn1;                                                // 0x0318(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBStepButton_C*                                 StepBtn2;                                                // 0x0320(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBStepButton_C*                                 StepBtn3;                                                // 0x0328(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UStackBStepButton_C*                                 StepBtn4;                                                // 0x0330(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWidgetSwitcher*                                     WidgetSwitcher_HeaderTitle;                              // 0x0338(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWidgetSwitcher*                                     WS_Animation;                                            // 0x0340(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		struct FOwnItemInfo                                        TargetImagine;                                           // 0x0348(0x0150) Edit, BlueprintVisible, DisableEditOnInstance
		class USelectMaterial_C*                                   MaterialSelect;                                          // 0x0498(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<struct FOwnItemInfo>                                SelectMatrials;                                          // 0x04A0(0x0010) Edit, BlueprintVisible, DisableEditOnInstance
		struct FSBStackBUseTicket                                  MaterialTickets;                                         // 0x04B0(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor
		bool                                                       UseMaterialTicket;                                       // 0x04B8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_T6AO[0x7];                                   // 0x04B9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UImagineInheritSelect_C*                             InheritSelect;                                           // 0x04C0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FScriptMulticastDelegate                             OnClose;                                                 // 0x04C8(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable
		struct FOwnItemInfo                                        SpecialImagine;                                          // 0x04D8(0x0150) Edit, BlueprintVisible, DisableEditOnInstance
		class UTicketSelectImagine_C*                              TicketSelect;                                            // 0x0628(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    TokenID;                                                 // 0x0630(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		EnumStackBStep                                             Step;                                                    // 0x0634(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_9KFS[0x3];                                   // 0x0635(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UBP_Dialog_C*                                        YnDialog;                                                // 0x0638(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class FString                                              ResultDialogText;                                        // 0x0640(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash
		bool                                                       ResultStackBMax;                                         // 0x0650(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		ESBImagineCategoryType                                     ImagineType;                                             // 0x0651(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash
		bool                                                       BlockClose;                                              // 0x0652(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsResultSuccess;                                         // 0x0653(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bExecuting;                                              // 0x0654(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor

	public:
		void ResetStepSendData();
		void InitializeHeader();
		void UpdateRewardView();
		void UpdateLiquidMemoryView();
		void GenerateTicketData(TArray<struct FSBStackBUseTicket>* Tickets);
		void GetMaterialUIDs(TArray<class FString>* Uids);
		void UpdateExecuteView();
		void InitializeStep();
		void InitializeButtons();
		void ReselectImagine();
		void BndEvt__ImagineStackBBaseView_StepBtn2_K2Node_ComponentBoundEvent_1_OnSelect__DelegateSignature();
		void onSelectedMaterials(TArray<struct FOwnItemInfo>* Uids, bool UseTicket, const struct FSBStackBUseTicket& StackBTicket);
		void ReselectMaterial();
		void BndEvt__ImagineStackBBaseView_StepBtn3_K2Node_ComponentBoundEvent_2_OnSelect__DelegateSignature();
		void OnSelectedPerk(const struct FOwnItemInfo& SelectedPerk);
		void OnReInit();
		void BndEvt__ImagineStackBBaseView_StepBtn4_K2Node_ComponentBoundEvent_3_OnSelect__DelegateSignature();
		void OnTicketSelected(int32_t Ticket);
		void ReselectTicket();
		void OpenStep2();
		void OpenStep3();
		void OpenStep4();
		void OnSelectTargetImagine(const struct FOwnItemInfo& ItemInfo);
		void BndEvt__ImagineStackBBaseView_Btn_Execute_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
		void BndEvt__ImagineStackBBaseView_StepBtn1_K2Node_ComponentBoundEvent_0_OnSelect__DelegateSignature();
		void OnCloseImagineSelectDialog();
		void EventOnBeginSelectImagine();
		void EventOnEndSelectImagine();
		void EventOnBeginSelectMaterial();
		void EventOnEndSelectMaterial();
		void OnCloseSelectMaterialDialog();
		void EventOnBeginSelectImagineInherit();
		void EventOnEndSelectImagineInherit();
		void OnCloseSelectImagineInheritDialog();
		void EventOnBeginSelectTicket();
		void EventOnEndSelectTicket();
		void OnCloseSelectTicketDialog();
		void EventOnBeginExecute();
		void EventOnEndExecute();
		void Construct();
		void Init();
		void Term();
		void BindImagineStacked();
		void UnbindStackBCompleted();
		void OnCompleteImagineStackB(int32_t RetCode, const struct FOwnItemInfo& Imagine, bool bSuccess);
		void BndEvt__ImagineStackBBaseView_StackBFailedAnimation_K2Node_ComponentBoundEvent_0_OnAnimPlayed__DelegateSignature();
		void BndEvt__ImagineStackBBaseView_StackBSuccessAnimation_K2Node_ComponentBoundEvent_1_OnAnimPlayed__DelegateSignature();
		void OnDialogClosed(EDialogResult Result);
		void BndEvt__ImagineStackBBaseView_CmnBack01_1_K2Node_ComponentBoundEvent_2_EventClicked__DelegateSignature();
		void RequestClose();
		void Destruct();
		void OnCloseEndDialog(EDialogResult Result);
		void BndEvt__ImagineStackBBaseView_Btn_ShowHint_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
		void ExecuteUbergraph_ImagineStackBBaseView(int32_t EntryPoint);
		void OnClose__DelegateSignature();
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
