#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Ornament
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Ornament_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_AdventurerCardDecolations
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_AdventurerCardDecolations_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Award
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Award_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_LiquidMemory
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_LiquidMemory_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_AdventureBoard
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_AdventureBoard_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_BPPoint
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_BPPoint_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.IsDuplicate
	 */
	struct UMailAttachmentAcceptBody_C_IsDuplicate_Params
	{
	public:
		bool                                                       Duplicate;                                               // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Token
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Token_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Ability
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Ability_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_RankPoint
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_RankPoint_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Achievement
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Achievement_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Stamp
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Stamp_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Emote
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Emote_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Recipe
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Recipe_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.GetOverflowType
	 */
	struct UMailAttachmentAcceptBody_C_GetOverflowType_Params
	{
	public:
		int32_t                                                    Type;                                                    // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Orb
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Orb_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.SetAccept
	 */
	struct UMailAttachmentAcceptBody_C_SetAccept_Params
	{
	public:
		int32_t                                                    Count;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_FADP[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.SetStorageSize
	 */
	struct UMailAttachmentAcceptBody_C_SetStorageSize_Params
	{
	public:
		int32_t                                                    SizeNum;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    CountNum;                                                // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.SetCountOnly
	 */
	struct UMailAttachmentAcceptBody_C_SetCountOnly_Params
	{
	public:
		bool                                                       CountOnly;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Weapon
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Weapon_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.AttachmentWork_Item
	 */
	struct UMailAttachmentAcceptBody_C_AttachmentWork_Item_Params
	{	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.IsOverflow
	 */
	struct UMailAttachmentAcceptBody_C_IsOverflow_Params
	{
	public:
		bool                                                       Overflow;                                                // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.Set Attachment
	 */
	struct UMailAttachmentAcceptBody_C_SetAttachment_Params
	{
	public:
		struct FSBMailAttachment                                   AttachmentData;                                          // 0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function MailAttachmentAcceptBody.MailAttachmentAcceptBody_C.ExecuteUbergraph_MailAttachmentAcceptBody
	 */
	struct UMailAttachmentAcceptBody_C_ExecuteUbergraph_MailAttachmentAcceptBody_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
