#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.SetTitle
	 */
	struct UMailListAttachmentAcceptedResult_C_SetTitle_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.CalcSellData
	 */
	struct UMailListAttachmentAcceptedResult_C_CalcSellData_Params
	{
	public:
		struct FOwnItemInfo                                        OwnItemInfo;                                             // 0x0000(0x0150)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.SetData_Work
	 */
	struct UMailListAttachmentAcceptedResult_C_SetData_Work_Params
	{
	public:
		struct FSBMailRewardData                                   Data;                                                    // 0x0000(0x0180)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.SetSallItemData
	 */
	struct UMailListAttachmentAcceptedResult_C_SetSallItemData_Params
	{
	public:
		struct FSBMailRewardData                                   RewardData;                                              // 0x0000(0x0180)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.SetItemGenerated
	 */
	struct UMailListAttachmentAcceptedResult_C_SetItemGenerated_Params
	{
	public:
		struct FOwnItemInfo                                        OwnItemInfo;                                             // 0x0000(0x0150)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.Achievement_SetData
	 */
	struct UMailListAttachmentAcceptedResult_C_Achievement_SetData_Params
	{
	public:
		struct FSBAchievementRewardData                            Data;                                                    // 0x0000(0x0070)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.PreConstruct
	 */
	struct UMailListAttachmentAcceptedResult_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.Construct
	 */
	struct UMailListAttachmentAcceptedResult_C_Construct_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__Btn_BackClose_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__Btn_BackClose_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.Close
	 */
	struct UMailListAttachmentAcceptedResult_C_Close_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.Set Data
	 */
	struct UMailListAttachmentAcceptedResult_C_SetData_Params
	{
	public:
		struct FSBMailRewardData                                   Data;                                                    // 0x0000(0x0180)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__MailListAttachmentAcceptedResult_CmnClose03_K2Node_ComponentBoundEvent_4_OnClosed__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__MailListAttachmentAcceptedResult_CmnClose03_K2Node_ComponentBoundEvent_4_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__MailListAttachmentAcceptedResult_Btn_ContinueUse_1_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__MailListAttachmentAcceptedResult_Btn_ContinueUse_1_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__MailListAttachmentAcceptedResult_Btn_OK_1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__MailListAttachmentAcceptedResult_Btn_OK_1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__MailListAttachmentAcceptedResult_Btn_OK_1_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__MailListAttachmentAcceptedResult_Btn_OK_1_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__MailListAttachmentAcceptedResult_Btn_ContinueUse_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__MailListAttachmentAcceptedResult_Btn_ContinueUse_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.BndEvt__MailListAttachmentAcceptedResult_Btn_OK_1_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_BndEvt__MailListAttachmentAcceptedResult_Btn_OK_1_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1
	 */
	struct UMailListAttachmentAcceptedResult_C_WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.ESCClose
	 */
	struct UMailListAttachmentAcceptedResult_C_ESCClose_Params
	{	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.ExecuteUbergraph_MailListAttachmentAcceptedResult
	 */
	struct UMailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.OnClose__DelegateSignature
	 */
	struct UMailListAttachmentAcceptedResult_C_OnClose__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
