#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Map_MapBtn.Map_MapBtn_C.SetHoveredSoundId
	 */
	struct UMap_MapBtn_C_SetHoveredSoundId_Params
	{
	public:
		ESystemSE                                                  InSoundId;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.SetPressedSoundId
	 */
	struct UMap_MapBtn_C_SetPressedSoundId_Params
	{
	public:
		ESystemSE                                                  InSoundId;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.BndEvt__Btn01_K2Node_ComponentBoundEvent_51_OnButtonClickedEvent__DelegateSignature
	 */
	struct UMap_MapBtn_C_BndEvt__Btn01_K2Node_ComponentBoundEvent_51_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.BndEvt__Map_MapBtn_Btn01_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature
	 */
	struct UMap_MapBtn_C_BndEvt__Map_MapBtn_Btn01_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.BndEvt__Map_MapBtn_Btn01_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
	 */
	struct UMap_MapBtn_C_BndEvt__Map_MapBtn_Btn01_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.UpdateText
	 */
	struct UMap_MapBtn_C_UpdateText_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.Construct
	 */
	struct UMap_MapBtn_C_Construct_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.CustomEvent_2
	 */
	struct UMap_MapBtn_C_CustomEvent_2_Params
	{
	public:
		ESBPadKeySkinType                                          SkinType;                                                // 0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.Destruct
	 */
	struct UMap_MapBtn_C_Destruct_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.CustomEvent_3
	 */
	struct UMap_MapBtn_C_CustomEvent_3_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.SetClickInputAction
	 */
	struct UMap_MapBtn_C_SetClickInputAction_Params
	{
	public:
		class FName                                                ActionName;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.CustomEvent_1
	 */
	struct UMap_MapBtn_C_CustomEvent_1_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.StopClickInputAction
	 */
	struct UMap_MapBtn_C_StopClickInputAction_Params
	{	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.ExecuteUbergraph_Map_MapBtn
	 */
	struct UMap_MapBtn_C_ExecuteUbergraph_Map_MapBtn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Map_MapBtn.Map_MapBtn_C.OnButtonClicked__DelegateSignature
	 */
	struct UMap_MapBtn_C_OnButtonClicked__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
