#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize4
	 */
	struct UMapEditWindowSize_C_SetCheckWindowSize4_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize3
	 */
	struct UMapEditWindowSize_C_SetCheckWindowSize3_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize2
	 */
	struct UMapEditWindowSize_C_SetCheckWindowSize2_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize1
	 */
	struct UMapEditWindowSize_C_SetCheckWindowSize1_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize
	 */
	struct UMapEditWindowSize_C_SetCheckWindowSize_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.SetTitle
	 */
	struct UMapEditWindowSize_C_SetTitle_Params
	{
	public:
		int32_t                                                    InTextId;                                                // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UMapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UMapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UMapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UMapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.PreConstruct
	 */
	struct UMapEditWindowSize_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.ExecuteUbergraph_MapEditWindowSize
	 */
	struct UMapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MapEditWindowSize.MapEditWindowSize_C.OnWindowSizeChanged__DelegateSignature
	 */
	struct UMapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature_Params
	{
	public:
		int32_t                                                    Number;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
