#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.Correct EquipedUIDs
	 */
	struct UMyCharaMenu_EffectList_C_CorrectEquipedUIDs_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.AnimMyCharaOut
	 */
	struct UMyCharaMenu_EffectList_C_AnimMyCharaOut_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.AddEffectItemToList
	 */
	struct UMyCharaMenu_EffectList_C_AddEffectItemToList_Params
	{
	public:
		class FText                                                InEffectNameText;                                        // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.SetupEffectParameters
	 */
	struct UMyCharaMenu_EffectList_C_SetupEffectParameters_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.Close
	 */
	struct UMyCharaMenu_EffectList_C_Close_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.EscDetailedStatus
	 */
	struct UMyCharaMenu_EffectList_C_EscDetailedStatus_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.ClsoeDetailedStatus
	 */
	struct UMyCharaMenu_EffectList_C_ClsoeDetailedStatus_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__MyCharaMenu_BasicStatus_DetailedStatusButtonFullScreen_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__MyCharaMenu_BasicStatus_DetailedStatusButtonFullScreen_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.Construct
	 */
	struct UMyCharaMenu_EffectList_C_Construct_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.Init
	 */
	struct UMyCharaMenu_EffectList_C_Init_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.Destruct
	 */
	struct UMyCharaMenu_EffectList_C_Destruct_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_3_OnDetailedStatusClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_3_OnDetailedStatusClicked__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1
	 */
	struct UMyCharaMenu_EffectList_C_WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.WidgetAnimationEvt_AnimIn_K2Node_WidgetAnimationEvent_2
	 */
	struct UMyCharaMenu_EffectList_C_WidgetAnimationEvt_AnimIn_K2Node_WidgetAnimationEvent_2_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_2_OnSaveAchievement__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_2_OnSaveAchievement__DelegateSignature_Params
	{
	public:
		bool                                                       InResult;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_1_OnLoadAchievement__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_1_OnLoadAchievement__DelegateSignature_Params
	{
	public:
		bool                                                       InResult;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__BtnActive_K2Node_ComponentBoundEvent_5_EventClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__BtnActive_K2Node_ComponentBoundEvent_5_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__BtnAbility_K2Node_ComponentBoundEvent_6_EventClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__BtnAbility_K2Node_ComponentBoundEvent_6_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__BtnDrink_K2Node_ComponentBoundEvent_7_EventClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__BtnDrink_K2Node_ComponentBoundEvent_7_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__BtnTickets_K2Node_ComponentBoundEvent_8_EventClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__BtnTickets_K2Node_ComponentBoundEvent_8_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_0_OnClicked_AchievementChangeButton__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__LeftSideParameters_K2Node_ComponentBoundEvent_0_OnClicked_AchievementChangeButton__DelegateSignature_Params
	{
	public:
		class UMyCharaMenu_AchievementList_C*                      InAchievementListRef;                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.BndEvt__MyCharaMenu_EffectList_BtnPioneerAbility_K2Node_ComponentBoundEvent_0_EventClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_BndEvt__MyCharaMenu_EffectList_BtnPioneerAbility_K2Node_ComponentBoundEvent_0_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.ExecuteUbergraph_MyCharaMenu_EffectList
	 */
	struct UMyCharaMenu_EffectList_C_ExecuteUbergraph_MyCharaMenu_EffectList_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_5DPA[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.OnSelectAchievementSaved__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_OnSelectAchievementSaved__DelegateSignature_Params
	{
	public:
		bool                                                       InResult;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.OnAcquiredAchievementLoaded__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_OnAcquiredAchievementLoaded__DelegateSignature_Params
	{
	public:
		bool                                                       InResult;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.OnAchievementChangeButtonClicked__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_OnAchievementChangeButtonClicked__DelegateSignature_Params
	{
	public:
		class UMyCharaMenu_AchievementList_C*                      InAchievementList;                                       // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.OnSubMenuChanged__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_OnSubMenuChanged__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.OnAnimFinishedMyCharaOut__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_OnAnimFinishedMyCharaOut__DelegateSignature_Params
	{	};

	/**
	 * Function MyCharaMenu_EffectList.MyCharaMenu_EffectList_C.OnChangeEquipWeaponProc__DelegateSignature
	 */
	struct UMyCharaMenu_EffectList_C_OnChangeEquipWeaponProc__DelegateSignature_Params
	{
	public:
		bool                                                       ProcStart;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
