#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MyCharaMenu_ClassInfoDiffForLeftSideParameters.MyCharaMenu_ClassInfoDiffForLeftSideParameters_C.SetClassInfo
	 */
	struct UMyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo_Params
	{
	public:
		ESBClassType                                               InClassType;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_G0ZF[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    InClassLevel;                                            // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function MyCharaMenu_ClassInfoDiffForLeftSideParameters.MyCharaMenu_ClassInfoDiffForLeftSideParameters_C.PreConstruct
	 */
	struct UMyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function MyCharaMenu_ClassInfoDiffForLeftSideParameters.MyCharaMenu_ClassInfoDiffForLeftSideParameters_C.ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters
	 */
	struct UMyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
