#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnim
	 */
	struct UNewStepList_C_IsPlayAnim_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnim
	 */
	struct UNewStepList_C_PlayAnim_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnSetupKeyGuide
	 */
	struct UNewStepList_C_OnSetupKeyGuide_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnSetupTitle
	 */
	struct UNewStepList_C_OnSetupTitle_Params
	{
	public:
		class FName                                                TitleTextId;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                TitleBackTextID;                                         // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.Unbind
	 */
	struct UNewStepList_C_Unbind_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.Bind
	 */
	struct UNewStepList_C_Bind_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimationOut3
	 */
	struct UNewStepList_C_IsPlayAnimationOut3_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimationOut2
	 */
	struct UNewStepList_C_IsPlayAnimationOut2_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimationOut1
	 */
	struct UNewStepList_C_IsPlayAnimationOut1_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimOut
	 */
	struct UNewStepList_C_IsPlayAnimOut_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimationIn3
	 */
	struct UNewStepList_C_IsPlayAnimationIn3_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimationIn2
	 */
	struct UNewStepList_C_IsPlayAnimationIn2_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimationIn1
	 */
	struct UNewStepList_C_IsPlayAnimationIn1_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.IsPlayAnimIn
	 */
	struct UNewStepList_C_IsPlayAnimIn_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnimationOut3
	 */
	struct UNewStepList_C_PlayAnimationOut3_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnimationOut2
	 */
	struct UNewStepList_C_PlayAnimationOut2_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnimationOut1
	 */
	struct UNewStepList_C_PlayAnimationOut1_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnimationIn3
	 */
	struct UNewStepList_C_PlayAnimationIn3_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnimationIn2
	 */
	struct UNewStepList_C_PlayAnimationIn2_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.PlayAnimationIn1
	 */
	struct UNewStepList_C_PlayAnimationIn1_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.BndEvt__NewStepList_TextKey_K2Node_ComponentBoundEvent_0_OnUpdateOperationMode__DelegateSignature
	 */
	struct UNewStepList_C_BndEvt__NewStepList_TextKey_K2Node_ComponentBoundEvent_0_OnUpdateOperationMode__DelegateSignature_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.BndEvt__NewStepList_TextKey_K2Node_ComponentBoundEvent_1_OnChangePadSkinType__DelegateSignature
	 */
	struct UNewStepList_C_BndEvt__NewStepList_TextKey_K2Node_ComponentBoundEvent_1_OnChangePadSkinType__DelegateSignature_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.BndEvt__NewStepList_TextKey_K2Node_ComponentBoundEvent_2_OnUpdateKeyConfig__DelegateSignature
	 */
	struct UNewStepList_C_BndEvt__NewStepList_TextKey_K2Node_ComponentBoundEvent_2_OnUpdateKeyConfig__DelegateSignature_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.BindAdventureBoardComponent
	 */
	struct UNewStepList_C_BindAdventureBoardComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindAdventureBoardComponent
	 */
	struct UNewStepList_C_UnbindAdventureBoardComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnChangeFavoriteAdventureBoard
	 */
	struct UNewStepList_C_OnChangeFavoriteAdventureBoard_Params
	{
	public:
		TArray<struct FSBAdventureBoardParam>                      InBoardParamList;                                        // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InRetCode;                                               // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnUpdateAdventureBoard
	 */
	struct UNewStepList_C_OnUpdateAdventureBoard_Params
	{
	public:
		int32_t                                                    RetCode;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnLoadAdventureBoard
	 */
	struct UNewStepList_C_OnLoadAdventureBoard_Params
	{
	public:
		int32_t                                                    RetCode;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnAchievementedAdventureBoardPanel
	 */
	struct UNewStepList_C_OnAchievementedAdventureBoardPanel_Params
	{
	public:
		TArray<struct FSBAdventureBoardPanelParam>                 PanelList;                                               // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InPanelId;                                               // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    RetCode;                                                 // 0x0014(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnComplateAdventureBoard
	 */
	struct UNewStepList_C_OnComplateAdventureBoard_Params
	{
	public:
		TArray<struct FSBAdventureBoardParam>                      InBoardParamList;                                        // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FSBMailRewardData                                   InRewardDataList;                                        // 0x0010(0x0180)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InRetCode;                                               // 0x0190(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnChangeActiveAdventureBoard
	 */
	struct UNewStepList_C_OnChangeActiveAdventureBoard_Params
	{
	public:
		TArray<struct FSBAdventureBoardParam>                      InBoardParamList;                                        // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InRetCode;                                               // 0x0010(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnGetRewardAdventureBoardPanel
	 */
	struct UNewStepList_C_OnGetRewardAdventureBoardPanel_Params
	{
	public:
		TArray<struct FSBAdventureBoardParam>                      InBoardParamList;                                        // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FSBMailRewardData                                   InRewardDataList;                                        // 0x0010(0x0180)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InRetCode;                                               // 0x0190(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnGetRewardAdventureBoardAllPanel
	 */
	struct UNewStepList_C_OnGetRewardAdventureBoardAllPanel_Params
	{
	public:
		TArray<struct FSBAdventureBoardParam>                      InBoardParamList;                                        // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FSBMailRewardData                                   InRewardDataList;                                        // 0x0010(0x0180)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InRetCode;                                               // 0x0190(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnChangeHUDDrawAdventureBoard
	 */
	struct UNewStepList_C_OnChangeHUDDrawAdventureBoard_Params
	{
	public:
		struct FSBAdventureBoardParam                              InBoardParam;                                            // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    InRetCode;                                               // 0x0018(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindWishlist
	 */
	struct UNewStepList_C_BindWishlist_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindWishlist
	 */
	struct UNewStepList_C_UnbindWishlist_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnUpdateWishlist
	 */
	struct UNewStepList_C_OnUpdateWishlist_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.AddReceiver
	 */
	struct UNewStepList_C_AddReceiver_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.RemoveReceiver
	 */
	struct UNewStepList_C_RemoveReceiver_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnAcceptQuest
	 */
	struct UNewStepList_C_OnAcceptQuest_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnUpdateQuestProgress
	 */
	struct UNewStepList_C_OnUpdateQuestProgress_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnCompleteQuest
	 */
	struct UNewStepList_C_OnCompleteQuest_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnCancelQuest
	 */
	struct UNewStepList_C_OnCancelQuest_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.QuestListDebug
	 */
	struct UNewStepList_C_QuestListDebug_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnUpdateRouteGuideSetting
	 */
	struct UNewStepList_C_OnUpdateRouteGuideSetting_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnLoadRouteGuideQuestId
	 */
	struct UNewStepList_C_OnLoadRouteGuideQuestId_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.CustomEvent_1
	 */
	struct UNewStepList_C_CustomEvent_1_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.CustomEvent_2
	 */
	struct UNewStepList_C_CustomEvent_2_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnStartNFTArea
	 */
	struct UNewStepList_C_OnStartNFTArea_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnEndNFTArea
	 */
	struct UNewStepList_C_OnEndNFTArea_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindPlayer
	 */
	struct UNewStepList_C_BindPlayer_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindPlayer
	 */
	struct UNewStepList_C_UnbindPlayer_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.BindGetMyCharaInfo
	 */
	struct UNewStepList_C_BindGetMyCharaInfo_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindGetMyCharaInfo
	 */
	struct UNewStepList_C_UnbindGetMyCharaInfo_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnGetMyCharaInfo
	 */
	struct UNewStepList_C_OnGetMyCharaInfo_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindQuestComponent
	 */
	struct UNewStepList_C_BindQuestComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindQuestComponent
	 */
	struct UNewStepList_C_UnbindQuestComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnAcceptedQuestList
	 */
	struct UNewStepList_C_OnAcceptedQuestList_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.BindCommonComponent
	 */
	struct UNewStepList_C_BindCommonComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindCommonComponent
	 */
	struct UNewStepList_C_UnbindCommonComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnSaveQuestCheckList
	 */
	struct UNewStepList_C_OnSaveQuestCheckList_Params
	{
	public:
		bool                                                       bWasSuccessful;                                          // 0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindWarehouseAbilityComponent
	 */
	struct UNewStepList_C_BindWarehouseAbilityComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindWarehouseAbilityComponent
	 */
	struct UNewStepList_C_UnbindWarehouseAbilityComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnWarehouseAbilityUpdate
	 */
	struct UNewStepList_C_OnWarehouseAbilityUpdate_Params
	{
	public:
		TArray<struct FSBWarehouseAbilityNotifyUIInfo>             UIInfo;                                                  // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindInterruptQuestComponent
	 */
	struct UNewStepList_C_BindInterruptQuestComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindInterruptQuestComponent
	 */
	struct UNewStepList_C_UnbindInterruptQuestComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnJoinInterruptQuest
	 */
	struct UNewStepList_C_OnJoinInterruptQuest_Params
	{
	public:
		class USBPlayerInterruptQuestComponent*                    InComponent;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bInFirst;                                                // 0x0008(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnSuccessInterruptQuest
	 */
	struct UNewStepList_C_OnSuccessInterruptQuest_Params
	{
	public:
		class FName                                                InQuestId;                                               // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       InSuccess;                                               // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnFailedInterruptQuest
	 */
	struct UNewStepList_C_OnFailedInterruptQuest_Params
	{
	public:
		class FName                                                InQuestId;                                               // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnUpdateProgressInterruptQuest
	 */
	struct UNewStepList_C_OnUpdateProgressInterruptQuest_Params
	{
	public:
		class USBPlayerInterruptQuestComponent*                    InComponent;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnRepInterruptQuest
	 */
	struct UNewStepList_C_OnRepInterruptQuest_Params
	{
	public:
		struct FSBInterruptQuestPlayInfo                           InPlayInfo;                                              // 0x0000(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnLeaveInterruptQuest
	 */
	struct UNewStepList_C_OnLeaveInterruptQuest_Params
	{
	public:
		class FName                                                InQuestId;                                               // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindAdventurerComponent
	 */
	struct UNewStepList_C_BindAdventurerComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindAdventurerComponent
	 */
	struct UNewStepList_C_UnbindAdventurerComponent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnAdventurerRankChange
	 */
	struct UNewStepList_C_OnAdventurerRankChange_Params
	{
	public:
		int32_t                                                    InRetCode;                                               // 0x0000(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindGameState
	 */
	struct UNewStepList_C_BindGameState_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindGameState
	 */
	struct UNewStepList_C_UnbindGameState_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnClearConditionChange
	 */
	struct UNewStepList_C_OnClearConditionChange_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnClearConditionUpdateProgress
	 */
	struct UNewStepList_C_OnClearConditionUpdateProgress_Params
	{
	public:
		struct FDungeonClearConditionProgressItemInfo              InProgressItem;                                          // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
		int32_t                                                    InStepNum;                                               // 0x0008(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    InProgressIndex;                                         // 0x000C(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnClearConditionChangeStep
	 */
	struct UNewStepList_C_OnClearConditionChangeStep_Params
	{
	public:
		int32_t                                                    InCurStep;                                               // 0x0000(0x0004)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnClearConditionComplete
	 */
	struct UNewStepList_C_OnClearConditionComplete_Params
	{
	public:
		class FName                                                InDungeonName;                                           // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindUpdateItems
	 */
	struct UNewStepList_C_BindUpdateItems_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindUpdateItems
	 */
	struct UNewStepList_C_UnbindUpdateItems_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnUpdateItems
	 */
	struct UNewStepList_C_OnUpdateItems_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.CustomEvent_3
	 */
	struct UNewStepList_C_CustomEvent_3_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.CustomEvent_4
	 */
	struct UNewStepList_C_CustomEvent_4_Params
	{
	public:
		class UObject*                                             Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             Param;                                                   // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.OnAnimationFinished
	 */
	struct UNewStepList_C_OnAnimationFinished_Params
	{
	public:
		class UWidgetAnimation*                                    Animation;                                               // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function NewStepList.NewStepList_C.BindUIVisible
	 */
	struct UNewStepList_C_BindUIVisible_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.UnbindUIVisible
	 */
	struct UNewStepList_C_UnbindUIVisible_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.OnUIVisibleSettingChange
	 */
	struct UNewStepList_C_OnUIVisibleSettingChange_Params
	{
	public:
		ESBUIType                                                  InUIType;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bInVisibility;                                           // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bInInstantly;                                            // 0x0002(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function NewStepList.NewStepList_C.RequestSetupList
	 */
	struct UNewStepList_C_RequestSetupList_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.CustomEvent
	 */
	struct UNewStepList_C_CustomEvent_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.Construct
	 */
	struct UNewStepList_C_Construct_Params
	{	};

	/**
	 * Function NewStepList.NewStepList_C.ExecuteUbergraph_NewStepList
	 */
	struct UNewStepList_C_ExecuteUbergraph_NewStepList_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
