#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.GetSelectBtn
	 */
	struct UPurchaseTypeSwitchingTab_C_GetSelectBtn_Params
	{
	public:
		int32_t                                                    OutSelectBtnId;                                          // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.SetBtnSelected
	 */
	struct UPurchaseTypeSwitchingTab_C_SetBtnSelected_Params
	{
	public:
		int32_t                                                    SelectedBtnID;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.SetBtnVisivility
	 */
	struct UPurchaseTypeSwitchingTab_C_SetBtnVisivility_Params
	{
	public:
		ESlateVisibility                                           IsVisibility;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.CommonBtnClicked
	 */
	struct UPurchaseTypeSwitchingTab_C_CommonBtnClicked_Params
	{
	public:
		int32_t                                                    BtnId;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.BndEvt__PurchaseTypeSwitchingTab_RoseOrb_Gasha_K2Node_ComponentBoundEvent_2_OnBtnClicked__DelegateSignature
	 */
	struct UPurchaseTypeSwitchingTab_C_BndEvt__PurchaseTypeSwitchingTab_RoseOrb_Gasha_K2Node_ComponentBoundEvent_2_OnBtnClicked__DelegateSignature_Params
	{
	public:
		int32_t                                                    BtnId;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.BndEvt__PurchaseTypeSwitchingTab_Ticket_Gasha_K2Node_ComponentBoundEvent_3_OnBtnClicked__DelegateSignature
	 */
	struct UPurchaseTypeSwitchingTab_C_BndEvt__PurchaseTypeSwitchingTab_Ticket_Gasha_K2Node_ComponentBoundEvent_3_OnBtnClicked__DelegateSignature_Params
	{
	public:
		int32_t                                                    BtnId;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.Construct
	 */
	struct UPurchaseTypeSwitchingTab_C_Construct_Params
	{	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.ExecuteUbergraph_PurchaseTypeSwitchingTab
	 */
	struct UPurchaseTypeSwitchingTab_C_ExecuteUbergraph_PurchaseTypeSwitchingTab_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function PurchaseTypeSwitchingTab.PurchaseTypeSwitchingTab_C.OnClicked__DelegateSignature
	 */
	struct UPurchaseTypeSwitchingTab_C_OnClicked__DelegateSignature_Params
	{
	public:
		int32_t                                                    BtnId;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
