#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.GetTitleText
	 */
	struct UResultDialog_DropTreasureTicketReward_C_GetTitleText_Params
	{
	public:
		int32_t                                                    N;                                                       // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_GBXF[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FText                                                Text;                                                    // 0x0008(0x0018)  (Parm, OutParm)
	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.GetGameStateDungeon
	 */
	struct UResultDialog_DropTreasureTicketReward_C_GetGameStateDungeon_Params
	{
	public:
		class ASBGameState_Dungeon*                                GameStateDungeon;                                        // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.ResetFlags
	 */
	struct UResultDialog_DropTreasureTicketReward_C_ResetFlags_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.RemoveCallbacks
	 */
	struct UResultDialog_DropTreasureTicketReward_C_RemoveCallbacks_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Close
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Close_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Open
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Open_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Setup
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Setup_Params
	{
	public:
		struct FSBTokenTreasureBoxRewardInfo                       Info;                                                    // 0x0000(0x0040)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		int32_t                                                    N;                                                       // 0x0040(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_29JG[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Finished_378E73C64E3E6A3755C9FAA19C9F5B27
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Finished_378E73C64E3E6A3755C9FAA19C9F5B27_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Finished_74947E2E43F60DBC3B23B2A0CDBAC599
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Finished_74947E2E43F60DBC3B23B2A0CDBAC599_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Construct
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Construct_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.OnPressCancel
	 */
	struct UResultDialog_DropTreasureTicketReward_C_OnPressCancel_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Destruct
	 */
	struct UResultDialog_DropTreasureTicketReward_C_Destruct_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.BndEvt__ResultDialog_DropTreasureTicketReward_Btn_FullScreen_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_BndEvt__ResultDialog_DropTreasureTicketReward_Btn_FullScreen_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.BndEvt__ResultDialog_DropTreasureTicketReward_Btn_Close_K2Node_ComponentBoundEvent_3_OnClosed__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_BndEvt__ResultDialog_DropTreasureTicketReward_Btn_Close_K2Node_ComponentBoundEvent_3_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Event Open
	 */
	struct UResultDialog_DropTreasureTicketReward_C_EventOpen_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.Event Close
	 */
	struct UResultDialog_DropTreasureTicketReward_C_EventClose_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.OnInitialized
	 */
	struct UResultDialog_DropTreasureTicketReward_C_OnInitialized_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.BndEvt__ResultDialog_DropTreasureTicketReward_Btn_OK_K2Node_ComponentBoundEvent_0_EventOnClicked__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_BndEvt__ResultDialog_DropTreasureTicketReward_Btn_OK_K2Node_ComponentBoundEvent_0_EventOnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.ExecuteUbergraph_ResultDialog_DropTreasureTicketReward
	 */
	struct UResultDialog_DropTreasureTicketReward_C_ExecuteUbergraph_ResultDialog_DropTreasureTicketReward_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.OnClosed__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.OnOpened__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_OnOpened__DelegateSignature_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.CloseDelegate__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_CloseDelegate__DelegateSignature_Params
	{	};

	/**
	 * Function ResultDialog_DropTreasureTicketReward.ResultDialog_DropTreasureTicketReward_C.OpenDelegate__DelegateSignature
	 */
	struct UResultDialog_DropTreasureTicketReward_C_OpenDelegate__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
