#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.GetBattleScore
	 */
	struct UShopMenuDetailsImagineInner_C_GetBattleScore_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.SetLotteryGroupsId
	 */
	struct UShopMenuDetailsImagineInner_C_SetLotteryGroupsId_Params
	{
	public:
		int32_t                                                    LotteryGroupsId;                                         // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.Construct
	 */
	struct UShopMenuDetailsImagineInner_C_Construct_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.ShowDetails
	 */
	struct UShopMenuDetailsImagineInner_C_ShowDetails_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.CloseDetails
	 */
	struct UShopMenuDetailsImagineInner_C_CloseDetails_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1
	 */
	struct UShopMenuDetailsImagineInner_C_WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.SetData
	 */
	struct UShopMenuDetailsImagineInner_C_SetData_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    Amount;                                                  // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    AmountMin;                                               // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_LQWE[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              UniqueId;                                                // 0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		bool                                                       bShowProduct;                                            // 0x0020(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_YHGB[0x3];                                   // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    RecipeId;                                                // 0x0024(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.BndEvt__ShopMenuDetailsImagineBattle_SBButton_AbilityInfo_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UShopMenuDetailsImagineInner_C_BndEvt__ShopMenuDetailsImagineBattle_SBButton_AbilityInfo_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.Destruct
	 */
	struct UShopMenuDetailsImagineInner_C_Destruct_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.BndEvt__ShopMenuDetailsImagineInner_SBButtonReturnToRecipe_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UShopMenuDetailsImagineInner_C_BndEvt__ShopMenuDetailsImagineInner_SBButtonReturnToRecipe_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.BndEvt__ShopMenuDetailsImagineInner_SBButtonShowRate_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	 */
	struct UShopMenuDetailsImagineInner_C_BndEvt__ShopMenuDetailsImagineInner_SBButtonShowRate_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.ExecuteUbergraph_ShopMenuDetailsImagineInner
	 */
	struct UShopMenuDetailsImagineInner_C_ExecuteUbergraph_ShopMenuDetailsImagineInner_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.OnClickShowOriginal__DelegateSignature
	 */
	struct UShopMenuDetailsImagineInner_C_OnClickShowOriginal__DelegateSignature_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.OnBtnImgViewClicked__DelegateSignature
	 */
	struct UShopMenuDetailsImagineInner_C_OnBtnImgViewClicked__DelegateSignature_Params
	{	};

	/**
	 * Function ShopMenuDetailsImagineInner.ShopMenuDetailsImagineInner_C.OnEndCloseDetailAnimation__DelegateSignature
	 */
	struct UShopMenuDetailsImagineInner_C_OnEndCloseDetailAnimation__DelegateSignature_Params
	{
	public:
		class UUserWidget*                                         InWidget;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
