#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.PlayAnimOut
	 */
	struct UShortcutRing_Ring_C_PlayAnimOut_Params
	{	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.PlayAnimIn
	 */
	struct UShortcutRing_Ring_C_PlayAnimIn_Params
	{	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_1_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_1_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_2_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_2_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_3_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_3_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_4_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_4_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_5_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_5_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_6_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_6_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_7_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_7_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_K2Node_ComponentBoundEvent_8_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_K2Node_ComponentBoundEvent_8_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_1_K2Node_ComponentBoundEvent_9_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_1_K2Node_ComponentBoundEvent_9_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_2_K2Node_ComponentBoundEvent_10_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_2_K2Node_ComponentBoundEvent_10_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_3_K2Node_ComponentBoundEvent_11_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_3_K2Node_ComponentBoundEvent_11_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_4_K2Node_ComponentBoundEvent_12_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_4_K2Node_ComponentBoundEvent_12_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_5_K2Node_ComponentBoundEvent_13_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_5_K2Node_ComponentBoundEvent_13_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_6_K2Node_ComponentBoundEvent_14_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_6_K2Node_ComponentBoundEvent_14_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.BndEvt__ShortcutringIcon_7_K2Node_ComponentBoundEvent_15_OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_BndEvt__ShortcutringIcon_7_K2Node_ComponentBoundEvent_15_OnClickRight__DelegateSignature_Params
	{
	public:
		class UShortcutringIcon_C*                                 Icon;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.WidgetAnimationEvt_InOut_K2Node_WidgetAnimationEvent_1
	 */
	struct UShortcutRing_Ring_C_WidgetAnimationEvt_InOut_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.PreConstruct
	 */
	struct UShortcutRing_Ring_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.ExecuteUbergraph_ShortcutRing_Ring
	 */
	struct UShortcutRing_Ring_C_ExecuteUbergraph_ShortcutRing_Ring_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.OnClickRight__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_OnClickRight__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.OnClick__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ShortcutRing_Ring.ShortcutRing_Ring_C.OnInOutFinished__DelegateSignature
	 */
	struct UShortcutRing_Ring_C_OnInOutFinished__DelegateSignature_Params
	{
	public:
		float                                                      AnimationCurrentTime;                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
