#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class SkyBlue.ASAnimNotifyState_MountStartJumpValueSwitch
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UASAnimNotifyState_MountStartJumpValueSwitch : public UAnimNotifyState
	{
	public:
		unsigned char                                              UnknownData_CGHL[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.AssetReferenceExportFL
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAssetReferenceExportFL : public UBlueprintFunctionLibrary
	{
	public:
		void ReadAssetName(const class FString& Filename, TArray<class FString>* FileData);
		void ExportReference(const class FString& Filename, TArray<class FName> AssetName, bool IsHard);
		void CreateExportFile(const class FString& Filename);
		void AddReference(const class FString& Filename, const class FString& AssetName, TArray<class FName> Reference, TArray<class FName> Dependency);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBClassHudInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class USBClassHudInterface : public UInterface
	{
	public:
		bool UnregistClassHud(const class FString& Name);
		void RegistClassHud(class UUserWidget* Widget, const class FString& Name);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBTickFromParentInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class USBTickFromParentInterface : public UInterface
	{
	public:
		void ParentsCallTick(float InDeltaTime);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBWidgetChildrenInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class USBWidgetChildrenInterface : public UInterface
	{
	public:
		void RequestShow();
		void RequestSetOwnerCharacter(class ASBCharacter* OwnerCharacter);
		void RequestSetIconColorName(const class FString& ColorName);
		void RequestSetAnimationSpeed(float AnimationSpeed);
		void RequestHide();
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBDHCBattleInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class USBDHCBattleInterface : public UInterface
	{
	public:
		float GetScore(class APlayerState* InPlayerState);
		bool GetIsSoloPlay();
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.ListUpDeleteEnemyAssetsCmdFunctionCommandlet
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class UListUpDeleteEnemyAssetsCmdFunctionCommandlet : public UCommandlet
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbility
	 * Size -> 0x0058 (FullSize[0x0080] - InheritedSize[0x0028])
	 */
	class USBAbility : public UObject
	{
	public:
		unsigned char                                              UnknownData_CW7K[0x18];                                  // 0x0028(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              Owner;                                                   // 0x0040(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class AActor*                                              Causer;                                                  // 0x0048(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GDNL[0x20];                                  // 0x0050(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USBAbilityExpiration*                                Expiration;                                              // 0x0070(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2W6C[0x8];                                   // 0x0078(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDummy
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityDummy : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusBase
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusBase : public USBAbility
	{
	public:
		ESBAbilityValueUpAndDown                                   Type;                                                    // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Q94A[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusTimeBase
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusTimeBase : public USBAbility
	{
	public:
		ESBAbilityValueShortAndExten                               Type;                                                    // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_V3OD[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityCondition
	 * Size -> 0x0010 (FullSize[0x0038] - InheritedSize[0x0028])
	 */
	class USBAbilityCondition : public UObject
	{
	public:
		class AActor*                                              Owner;                                                   // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bNotEqual : 1;                                           // 0x0030(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_0BB4[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionAnyTime
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionAnyTime : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionActiveBattleMode
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionActiveBattleMode : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionInWater
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionInWater : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionInBattleMap
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionInBattleMap : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionInMap
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionInMap : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionInGameContentID
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionInGameContentID : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionActiveAbilityID
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionActiveAbilityID : public USBAbilityCondition
	{
	public:
		struct FSBAbilityID                                        AbilityID;                                               // 0x0038(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionMapInfo
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionMapInfo : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionBattleRange
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionBattleRange : public USBAbilityCondition
	{
	public:
		ESBPlayerClassBattleRange                                  BattleRange;                                             // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_UFOI[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionActiveAbilityFlag
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionActiveAbilityFlag : public USBAbilityCondition
	{
	public:
		ESBAbilityFlags                                            CheckAbilityFlag;                                        // 0x0038(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_W9KY[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionOperator
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionOperator : public USBAbilityCondition
	{
	public:
		ESBAbilityConditionOperator                                OperatorType;                                            // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_D8TC[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionCharacterLevel
	 * Size -> 0x0000 (FullSize[0x0040] - InheritedSize[0x0040])
	 */
	class USBAbilityConditionCharacterLevel : public USBAbilityConditionOperator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionPlayerClass
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionPlayerClass : public USBAbilityCondition
	{
	public:
		ESBClassType                                               ClassType;                                               // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_C18G[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionPlayerClassTotalPower
	 * Size -> 0x0000 (FullSize[0x0040] - InheritedSize[0x0040])
	 */
	class USBAbilityConditionPlayerClassTotalPower : public USBAbilityConditionOperator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionPlayerSpiritRank
	 * Size -> 0x0000 (FullSize[0x0040] - InheritedSize[0x0040])
	 */
	class USBAbilityConditionPlayerSpiritRank : public USBAbilityConditionOperator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionRemainHitPointRate
	 * Size -> 0x0000 (FullSize[0x0040] - InheritedSize[0x0040])
	 */
	class USBAbilityConditionRemainHitPointRate : public USBAbilityConditionOperator
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionSheathe
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionSheathe : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionInParty
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionInParty : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionSkillAttack
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionSkillAttack : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionPlayerResurrecting
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionPlayerResurrecting : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionDynamicTrigger
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionDynamicTrigger : public USBAbilityCondition
	{
	public:
		ESBAbilityDynamicTriggerType                               Type;                                                    // 0x0038(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_8S5I[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionBerserkerComboGaugeAmount
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionBerserkerComboGaugeAmount : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionFindByEnemy
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionFindByEnemy : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionEnemyHasAttackOrder
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionEnemyHasAttackOrder : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionTimeZoneNoon
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionTimeZoneNoon : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionTimeZoneNight
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionTimeZoneNight : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionWeaponElement
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionWeaponElement : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionWeaponEnhance
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionWeaponEnhance : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionWeaponProficiency
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionWeaponProficiency : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityConditionWeaponTotalPower
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class USBAbilityConditionWeaponTotalPower : public USBAbilityCondition
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDotBase
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityDotBase : public USBAbility
	{
	public:
		unsigned char                                              UnknownData_JBCA[0x8];                                   // 0x0080(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDot
	 * Size -> 0x0010 (FullSize[0x0098] - InheritedSize[0x0088])
	 */
	class USBAbilityDot : public USBAbilityDotBase
	{
	public:
		int32_t                                                    AttackID;                                                // 0x0088(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ESBAbilityDotAmountType                                    AmountType;                                              // 0x008C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_52IM[0xB];                                   // 0x008D(0x000B) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDotHPDamage
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class USBAbilityDotHPDamage : public USBAbilityDot
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDotHPHeal
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class USBAbilityDotHPHeal : public USBAbilityDot
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDotMPHeal
	 * Size -> 0x0000 (FullSize[0x0098] - InheritedSize[0x0098])
	 */
	class USBAbilityDotMPHeal : public USBAbilityDot
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityProjectileOnTimes
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityProjectileOnTimes : public USBAbilityDotBase
	{
	public:
		unsigned char                                              UnknownData_2PN7[0x8];                                   // 0x0088(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityAllyAttackAttackScale
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityAllyAttackAttackScale : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityAllyAttackElement
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityAllyAttackElement : public USBAbility
	{
	public:
		ESBAttribute                                               AttributeType;                                           // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_UZ60[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityCurableByInteraction
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityCurableByInteraction : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityElementAccumulation
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityElementAccumulation : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGiveElementAccumulation
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityGiveElementAccumulation : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityElementAccumulationTacticalSkillID
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityElementAccumulationTacticalSkillID : public USBAbilityStatusBase
	{
	public:
		ESBAttribute                                               AttributeType;                                           // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_SQGJ[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityElementReset
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityElementReset : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityElementStatusReinforce
	 * Size -> 0x0018 (FullSize[0x0098] - InheritedSize[0x0080])
	 */
	class USBAbilityElementStatusReinforce : public USBAbility
	{
	public:
		ESBAttribute                                               AttributeType;                                           // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OJAJ[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSBAbilityElementStatusReinforceLevelModifySetting> StatusAilmentLevelModifySettingList;                     // 0x0088(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusAilmentHP
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusAilmentHP : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExtendNegativeStatus
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityExtendNegativeStatus : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityOnlyEnemyStatus
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityOnlyEnemyStatus : public USBAbility
	{
	public:
		ESBAbilityOnlyEnemyStatus                                  StatusType;                                              // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_S4IP[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusFlashStun
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusFlashStun : public USBAbilityOnlyEnemyStatus
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEvent
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEvent : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventWhenReceiveDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventWhenReceiveDamage : public USBAbilityEvent
	{
	public:
		void OnEventAction(float Damage, const struct FSBDamageEvent& DamageEvent, class AActor* DamageCauser, class AActor* DamageDst);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventRecoverAttackerWhenReceiveDamage
	 * Size -> 0x0018 (FullSize[0x0098] - InheritedSize[0x0080])
	 */
	class USBAbilityEventRecoverAttackerWhenReceiveDamage : public USBAbilityEventWhenReceiveDamage
	{
	public:
		int32_t                                                    AttackID;                                                // 0x0080(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2H9R[0x4];                                   // 0x0084(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSBAttackID>                                 ExcludeAttackIDs;                                        // 0x0088(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventWhenServerGiveDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventWhenServerGiveDamage : public USBAbilityEvent
	{
	public:
		void OnEventAction(struct FSBServerDamageEvent* DamageEvent, class AActor* DamageCauser, class AActor* DamageDst);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventAddBattleStatusWhenServerGiveDamage
	 * Size -> 0x0010 (FullSize[0x0090] - InheritedSize[0x0080])
	 */
	class USBAbilityEventAddBattleStatusWhenServerGiveDamage : public USBAbilityEventWhenServerGiveDamage
	{
	public:
		struct FDataTableRowHandle                                 SendBattleStatus;                                        // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventAddSelfBattleStatusWhenServerGiveDamage
	 * Size -> 0x0010 (FullSize[0x0090] - InheritedSize[0x0080])
	 */
	class USBAbilityEventAddSelfBattleStatusWhenServerGiveDamage : public USBAbilityEventWhenServerGiveDamage
	{
	public:
		struct FDataTableRowHandle                                 SendBattleStatus;                                        // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventWhenServerGiveDamageWhenBack
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventWhenServerGiveDamageWhenBack : public USBAbilityEvent
	{
	public:
		void OnEventAction(struct FSBServerDamageEvent* DamageEvent, class AActor* DamageCauser, class AActor* DamageDst);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventAddBattleStatusWhenServerGiveDamageWhenBack
	 * Size -> 0x0010 (FullSize[0x0090] - InheritedSize[0x0080])
	 */
	class USBAbilityEventAddBattleStatusWhenServerGiveDamageWhenBack : public USBAbilityEventWhenServerGiveDamageWhenBack
	{
	public:
		struct FDataTableRowHandle                                 SendBattleStatus;                                        // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventWhenTakeDamageAttackHit
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventWhenTakeDamageAttackHit : public USBAbilityEvent
	{
	public:
		void OnEventAction(float Damage, const struct FSBDamageEvent& DamageEvent, class AActor* DamageCauser, class AActor* DamageDst);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventHealStaminaWhenTakeDamageAttackHit
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventHealStaminaWhenTakeDamageAttackHit : public USBAbilityEventWhenTakeDamageAttackHit
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventDrainWhenTakeDamageAttackHit
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityEventDrainWhenTakeDamageAttackHit : public USBAbilityEventWhenTakeDamageAttackHit
	{
	public:
		int32_t                                                    AttackID;                                                // 0x0080(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GX26[0x4];                                   // 0x0084(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventWhenTakeDamageBeforeCalcDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventWhenTakeDamageBeforeCalcDamage : public USBAbilityEvent
	{
	public:
		void OnEventAction(struct FSBServerDamageEvent* DamageEvent, class AActor* DamageCauser, class AActor* DamageDst, bool bInvincible);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventInvalidAttackWhenReceiveDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventInvalidAttackWhenReceiveDamage : public USBAbilityEventWhenTakeDamageBeforeCalcDamage
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventWhenTakeDamageBeforeCalcDamageAttacker
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventWhenTakeDamageBeforeCalcDamageAttacker : public USBAbilityEvent
	{
	public:
		void OnEventAction(struct FSBServerDamageEvent* DamageEvent, class AActor* DamageCauser, class AActor* DamageDst, bool bInvincible);
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventForceCriticalWhenGiveDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventForceCriticalWhenGiveDamage : public USBAbilityEventWhenTakeDamageBeforeCalcDamageAttacker
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityEventDarkWhenGiveDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityEventDarkWhenGiveDamage : public USBAbilityEventWhenTakeDamageBeforeCalcDamageAttacker
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExpiration
	 * Size -> 0x0038 (FullSize[0x0060] - InheritedSize[0x0028])
	 */
	class USBAbilityExpiration : public UObject
	{
	public:
		class AActor*                                              Owner;                                                   // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_AEU3[0x30];                                  // 0x0030(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExpirationUserAction
	 * Size -> 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
	 */
	class USBAbilityExpirationUserAction : public USBAbilityExpiration
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExpirationTimeLimit
	 * Size -> 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
	 */
	class USBAbilityExpirationTimeLimit : public USBAbilityExpiration
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExpirationCount
	 * Size -> 0x0008 (FullSize[0x0068] - InheritedSize[0x0060])
	 */
	class USBAbilityExpirationCount : public USBAbilityExpiration
	{
	public:
		unsigned char                                              UnknownData_8470[0x8];                                   // 0x0060(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExpirationDotTimeCount
	 * Size -> 0x0008 (FullSize[0x0070] - InheritedSize[0x0068])
	 */
	class USBAbilityExpirationDotTimeCount : public USBAbilityExpirationCount
	{
	public:
		unsigned char                                              UnknownData_3RCK[0x8];                                   // 0x0068(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityExpirationCountWithTime
	 * Size -> 0x0000 (FullSize[0x0068] - InheritedSize[0x0068])
	 */
	class USBAbilityExpirationCountWithTime : public USBAbilityExpirationCount
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityHealHPRecovery
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityHealHPRecovery : public USBAbilityStatusBase
	{
	public:
		ESBHealRecoveryType                                        HealType;                                                // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_5LM8[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityRecoveryHP
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityRecoveryHP : public USBAbility
	{
	public:
		int32_t                                                    AttackID;                                                // 0x0080(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ESBAbilityRecoveryAmountType                               Type;                                                    // 0x0084(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_JFR3[0x3];                                   // 0x0085(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityRecoveryHPBelowHPRate
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityRecoveryHPBelowHPRate : public USBAbilityRecoveryHP
	{
	public:
		unsigned char                                              UnknownData_R9B1[0x8];                                   // 0x0088(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStaminaRecovery
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityStaminaRecovery : public USBAbility
	{
	public:
		ESBAbilityRecoveryAmountType                               Type;                                                    // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_4QE1[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusRecovery
	 * Size -> 0x0020 (FullSize[0x00A0] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusRecovery : public USBAbility
	{
	public:
		TArray<ESBBattleEffectiveGroup>                            Groups;                                                  // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		TArray<struct FSBAbilityID>                                AbilityIDs;                                              // 0x0090(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityResurrection
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityResurrection : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityLimit
	 * Size -> 0x00A0 (FullSize[0x00C8] - InheritedSize[0x0028])
	 */
	class USBAbilityLimit : public UObject
	{
	public:
		TMap<ESBAbilityLimitParamType, struct FSBAbilityLimitParam> Params;                                                  // 0x0028(0x0050) Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		TMap<ESBAbilityLimitSumParamType, struct FSBAbilityLimitParam> SumParams;                                               // 0x0078(0x0050) Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityOnlyPlayerStatus
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityOnlyPlayerStatus : public USBAbility
	{
	public:
		ESBAbilityOnlyPlayerStatus                                 StatusType;                                              // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_RIQU[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGuardShieldDamageRate
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityGuardShieldDamageRate : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGuardSpecialGaugeRate
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityGuardSpecialGaugeRate : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGuardReduceSkillRecastTime
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityGuardReduceSkillRecastTime : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGuardReduceSpecialSkillRecastTime
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityGuardReduceSpecialSkillRecastTime : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySpecialGaugeCharge
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilitySpecialGaugeCharge : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityLancerMark
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityLancerMark : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityRecoveryShieldDurability
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityRecoveryShieldDurability : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityAddVoltageGauge
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityAddVoltageGauge : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDotVoltageGaugeUp
	 * Size -> 0x0008 (FullSize[0x00A0] - InheritedSize[0x0098])
	 */
	class USBAbilityDotVoltageGaugeUp : public USBAbilityDot
	{
	public:
		bool                                                       IsAddDuringFeverTime;                                    // 0x0098(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_IWQO[0x7];                                   // 0x0099(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityDecreaseBoostCartridgeConsumption
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityDecreaseBoostCartridgeConsumption : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityScapeArmor
	 * Size -> 0x0028 (FullSize[0x00A8] - InheritedSize[0x0080])
	 */
	class USBAbilityScapeArmor : public USBAbility
	{
	public:
		unsigned char                                              UnknownData_0RJM[0x4];                                   // 0x0080(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSBDefenceGuardConfig                               DefenceConfig;                                           // 0x0084(0x000C) Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected
		TArray<struct FSBGuardEffectSetting>                       GuardEffectSettingList;                                  // 0x0090(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		bool                                                       bIsRateValue;                                            // 0x00A0(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_H4VV[0x7];                                   // 0x00A1(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySkillSkillCoolTime
	 * Size -> 0x0010 (FullSize[0x0098] - InheritedSize[0x0088])
	 */
	class USBAbilitySkillSkillCoolTime : public USBAbilityStatusTimeBase
	{
	public:
		TArray<ESBAbilitySkillPosition>                            SkillActions;                                            // 0x0088(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityTacticalSkillIDSkillCoolTime
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityTacticalSkillIDSkillCoolTime : public USBAbilityStatusTimeBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySkillReduceStaminaByAll
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilitySkillReduceStaminaByAll : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySkillReduceStaminaByAction
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilitySkillReduceStaminaByAction : public USBAbilityStatusBase
	{
	public:
		ESBAbilityReduceStaminaType                                SkillAction;                                             // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_4TMC[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySkillButtonChargeTime
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilitySkillButtonChargeTime : public USBAbilityStatusTimeBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySkillRecoveryCoolTime
	 * Size -> 0x0018 (FullSize[0x0098] - InheritedSize[0x0080])
	 */
	class USBAbilitySkillRecoveryCoolTime : public USBAbility
	{
	public:
		TArray<ESBAbilitySkillPosition>                            ActionTypes;                                             // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		ESBAbilityValueShortAndExten                               ValueType;                                               // 0x0090(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ESBAbilityRecoveryAmountType                               AmountType;                                              // 0x0091(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_ILST[0x6];                                   // 0x0092(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusInvincible
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusInvincible : public USBAbility
	{
	public:
		ESBInvincibleLevel                                         Level;                                                   // 0x0080(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_88V9[0x7];                                   // 0x0081(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusSuperArmor
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusSuperArmor : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusStun
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusStun : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusPoison
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusPoison : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusFreeze
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusFreeze : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusSleep
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusSleep : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusFear
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusFear : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusParalyze
	 * Size -> 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusParalyze : public USBAbility
	{
	public:
		unsigned char                                              UnknownData_LO4B[0x8];                                   // 0x0080(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusRestraint
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusRestraint : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusFixTarget
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusFixTarget : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilitySuccessRateControlBadCondition
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilitySuccessRateControlBadCondition : public USBAbilityStatusBase
	{
	public:
		ESBAbilityControlBadCondition                              BadConditionType;                                        // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_NRS2[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityResistBadCondition
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityResistBadCondition : public USBAbilityStatusBase
	{
	public:
		ESBBattleStatusResistType                                  BadConditionType;                                        // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_YZBU[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityInvalidStatus
	 * Size -> 0x0020 (FullSize[0x00A0] - InheritedSize[0x0080])
	 */
	class USBAbilityInvalidStatus : public USBAbility
	{
	public:
		TArray<struct FSBAbilityID>                                AbilityIDList;                                           // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		TArray<ESBBattleEffectiveGroup>                            GroupList;                                               // 0x0090(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityPointGravity
	 * Size -> 0x0038 (FullSize[0x00B8] - InheritedSize[0x0080])
	 */
	class USBAbilityPointGravity : public USBAbility
	{
	public:
		TArray<class UCurveFloat*>                                 CurveValues;                                             // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		class UCurveFloat*                                         ResistAbsorbCurve;                                       // 0x0090(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_PEXT[0x18];                                  // 0x0098(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bUpdateGravityPointForCauserLocation;                    // 0x00B0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_LZWR[0x7];                                   // 0x00B1(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusTaunted
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusTaunted : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityHateCalcMagnification
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityHateCalcMagnification : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusFixHate
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityStatusFixHate : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGutsSelfDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityGutsSelfDamage : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityGutsOtherDamage
	 * Size -> 0x0000 (FullSize[0x0080] - InheritedSize[0x0080])
	 */
	class USBAbilityGutsOtherDamage : public USBAbility
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityBaseStatusBoost
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityBaseStatusBoost : public USBAbilityStatusBase
	{
	public:
		ESBBaseStatusBoostType                                     BaseStatusType;                                          // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_3QM5[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityBaseStatusRateBoost
	 * Size -> 0x0000 (FullSize[0x0090] - InheritedSize[0x0090])
	 */
	class USBAbilityBaseStatusRateBoost : public USBAbilityBaseStatusBoost
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityCharacterStatus
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityCharacterStatus : public USBAbilityStatusBase
	{
	public:
		ESBAbilityCharacterStatusType                              StatusType;                                              // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_QNIR[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusGiveDamage
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusGiveDamage : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusReceiveDamage
	 * Size -> 0x0000 (FullSize[0x0088] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusReceiveDamage : public USBAbilityStatusBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusSkillActionGiveDamage
	 * Size -> 0x0010 (FullSize[0x0098] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusSkillActionGiveDamage : public USBAbilityStatusBase
	{
	public:
		TArray<ESBAbilitySkillPosition>                            SkillTypes;                                              // 0x0088(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusDamageAttackTypeGiveDamage
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusDamageAttackTypeGiveDamage : public USBAbilityStatusBase
	{
	public:
		ESBDamageAttackType                                        AttackType;                                              // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_7FPW[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusDamageAttackTypeReceiveDamage
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusDamageAttackTypeReceiveDamage : public USBAbilityStatusBase
	{
	public:
		ESBDamageAttackType                                        AttackType;                                              // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HPHW[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusElementReceiveDamage
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusElementReceiveDamage : public USBAbilityStatusBase
	{
	public:
		ESBAttribute                                               Attribute;                                               // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_BHC6[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusBattleImagineElementReceiveDamage
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusBattleImagineElementReceiveDamage : public USBAbilityStatusBase
	{
	public:
		ESBAttribute                                               Attribute;                                               // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FBSU[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusRaceGiveDamage
	 * Size -> 0x0008 (FullSize[0x0090] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusRaceGiveDamage : public USBAbilityStatusBase
	{
	public:
		ESBEnemyRaceType                                           RaceType;                                                // 0x0088(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_UAMX[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class SkyBlue.SBAbilityStatusAttributeGiveDamage
	 * Size -> 0x0010 (FullSize[0x0098] - InheritedSize[0x0088])
	 */
	class USBAbilityStatusAttributeGiveDamage : public USBAbilityStatusBase
	{
	public:
