#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.UpdateCheck
	 */
	struct UStackTokenSelectorListView_C_UpdateCheck_Params
	{
	public:
		class UStackTokenSelectorListItem_C*                       OnSelect;                                                // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.Initialize
	 */
	struct UStackTokenSelectorListView_C_Initialize_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.Construct
	 */
	struct UStackTokenSelectorListView_C_Construct_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.OnSelectTicket
	 */
	struct UStackTokenSelectorListView_C_OnSelectTicket_Params
	{
	public:
		class UStackTokenSelectorListItem_C*                       Target;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.Close
	 */
	struct UStackTokenSelectorListView_C_Close_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.BndEvt__TokenSelectorListView_Btn_Close_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UStackTokenSelectorListView_C_BndEvt__TokenSelectorListView_Btn_Close_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.SetWindowPosition
	 */
	struct UStackTokenSelectorListView_C_SetWindowPosition_Params
	{
	public:
		struct FVector2D                                           InPosition;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.Set Window Alignment
	 */
	struct UStackTokenSelectorListView_C_SetWindowAlignment_Params
	{
	public:
		struct FVector2D                                           InAlignment;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.BndEvt__TokenSelectorListView_CmnClose02_K2Node_ComponentBoundEvent_3_OnClosed__DelegateSignature
	 */
	struct UStackTokenSelectorListView_C_BndEvt__TokenSelectorListView_CmnClose02_K2Node_ComponentBoundEvent_3_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.BndEvt__TokenSelectorListView_CmnBtn16_K2Node_ComponentBoundEvent_4_EventOnClicked__DelegateSignature
	 */
	struct UStackTokenSelectorListView_C_BndEvt__TokenSelectorListView_CmnBtn16_K2Node_ComponentBoundEvent_4_EventOnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.OnPressCancel
	 */
	struct UStackTokenSelectorListView_C_OnPressCancel_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.Destruct
	 */
	struct UStackTokenSelectorListView_C_Destruct_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.WidgetAnimationEvt_InAnim_K2Node_WidgetAnimationEvent_1
	 */
	struct UStackTokenSelectorListView_C_WidgetAnimationEvt_InAnim_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.ExecuteUbergraph_StackTokenSelectorListView
	 */
	struct UStackTokenSelectorListView_C_ExecuteUbergraph_StackTokenSelectorListView_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.OnSelectClose__DelegateSignature
	 */
	struct UStackTokenSelectorListView_C_OnSelectClose__DelegateSignature_Params
	{
	public:
		int32_t                                                    TokenID;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function StackTokenSelectorListView.StackTokenSelectorListView_C.OnClose__DelegateSignature
	 */
	struct UStackTokenSelectorListView_C_OnClose__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
