#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.Setup2
	 */
	struct UUMG_MatchingMenu_SupplyList_C_Setup2_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.OnClickCommonIcon
	 */
	struct UUMG_MatchingMenu_SupplyList_C_OnClickCommonIcon_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.Clear
	 */
	struct UUMG_MatchingMenu_SupplyList_C_Clear_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.Setup
	 */
	struct UUMG_MatchingMenu_SupplyList_C_Setup_Params
	{
	public:
		class FName                                                GameContentId;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon0_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
	 */
	struct UUMG_MatchingMenu_SupplyList_C_BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon0_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature_Params
	{
	public:
		class UCommonIcon_C*                                       Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon1_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
	 */
	struct UUMG_MatchingMenu_SupplyList_C_BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon1_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature_Params
	{
	public:
		class UCommonIcon_C*                                       Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon2_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
	 */
	struct UUMG_MatchingMenu_SupplyList_C_BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon2_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature_Params
	{
	public:
		class UCommonIcon_C*                                       Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon3_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
	 */
	struct UUMG_MatchingMenu_SupplyList_C_BndEvt__UMG_MatchingMenu_SupplyList_CommonIcon3_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature_Params
	{
	public:
		class UCommonIcon_C*                                       Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.ExecuteUbergraph_UMG_MatchingMenu_SupplyList
	 */
	struct UUMG_MatchingMenu_SupplyList_C_ExecuteUbergraph_UMG_MatchingMenu_SupplyList_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_G4O0[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UMG_MatchingMenu_SupplyList.UMG_MatchingMenu_SupplyList_C.OnClickIcon__DelegateSignature
	 */
	struct UUMG_MatchingMenu_SupplyList_C_OnClickIcon__DelegateSignature_Params
	{
	public:
		struct FSBDungeonSupply                                    DungeonSupply;                                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
