#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.GetValidReward
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_GetValidReward_Params
	{
	public:
		class USBSeasonPassMenuRewardItemData*                     ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.IsSubscribedReward
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_IsSubscribedReward_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.SetRewardData
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_SetRewardData_Params
	{
	public:
		class USBSeasonPassMenuRewardRankData*                     Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.PreConstruct
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.SetData
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_SetData_Params
	{
	public:
		class USBSeasonPassMenuRewardRankData*                     Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.UpdateDesign
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_UpdateDesign_Params
	{	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.OnUpdateData
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_OnUpdateData_Params
	{	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.UpdateDesignAndData
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_UpdateDesignAndData_Params
	{	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.DesignCheck
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_DesignCheck_Params
	{
	public:
		bool                                                       bPaidPlanSubscribed;                                     // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.BndEvt__UMG_SeasonPassMenuRewardRank_v106_SBButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_BndEvt__UMG_SeasonPassMenuRewardRank_v106_SBButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.BndEvt__UMG_SeasonPassMenuRewardRank_v106_SBButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_BndEvt__UMG_SeasonPassMenuRewardRank_v106_SBButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.BndEvt__UMG_SeasonPassMenuRewardRank_v106_SBButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_BndEvt__UMG_SeasonPassMenuRewardRank_v106_SBButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.ExecuteUbergraph_UMG_SeasonPassMenuRewardRank_v106
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_ExecuteUbergraph_UMG_SeasonPassMenuRewardRank_v106_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassMenuRewardRank_v106.UMG_SeasonPassMenuRewardRank_v106_C.OnClickItemIcon__DelegateSignature
	 */
	struct UUMG_SeasonPassMenuRewardRank_v106_C_OnClickItemIcon__DelegateSignature_Params
	{
	public:
		class USBSeasonPassMenuRewardItemData*                     RewardItemData;                                          // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
