#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * WidgetBlueprintGeneratedClass UMG_MatchingMenu_MissionDetail.UMG_MatchingMenu_MissionDetail_C
	 * Size -> 0x0190 (FullSize[0x0408] - InheritedSize[0x0278])
	 */
	class UUMG_MatchingMenu_MissionDetail_C : public UUserWidget
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x0278(0x0008) ZeroConstructor, Transient, DuplicateTransient
		class UBorder*                                             BorderEntryCondition;                                    // 0x0280(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UButton*                                             ButtonWeb;                                               // 0x0288(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Treasure_C*                        DropTreasure;                                            // 0x0290(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UHorizontalBox*                                      HorizontalBoxStackB;                                     // 0x0298(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              ImageLine0;                                              // 0x02A0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              ImageLine1;                                              // 0x02A8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              ImageLineStackB;                                         // 0x02B0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UImage*                                              ImageStackB;                                             // 0x02B8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardFirst;                                             // 0x02C0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardFirst_LimitTerm;                                   // 0x02C8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardFirstBronze;                                       // 0x02D0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardFirstGold;                                         // 0x02D8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardFirstSilver;                                       // 0x02E0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardHBoost;                                            // 0x02E8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardHNormal;                                           // 0x02F0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardHPlus;                                             // 0x02F8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardNormal;                                            // 0x0300(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardNormalBronze;                                      // 0x0308(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardNormalGold;                                        // 0x0310(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardNormalSilver;                                      // 0x0318(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_Reward_C*                          RewardPlus;                                              // 0x0320(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class USBRichTextBlock*                                    RichTextDescription;                                     // 0x0328(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class USBRuntimeTextBlock*                                 SBRuntimeTextBlock_109;                                  // 0x0330(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UScrollBox*                                          ScrollBox_108;                                           // 0x0338(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class USizeBox*                                            SizeBox_StackB;                                          // 0x0340(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UTextBlock*                                          TextLevelSyncValue;                                      // 0x0348(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UTextBlock*                                          TextParticipantMaxValue;                                 // 0x0350(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class USBRuntimeTextBlock*                                 TextStackB;                                              // 0x0358(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UTextBlock*                                          TextTimeLimitValue;                                      // 0x0360(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_EntryConditionList_C*              UMG_MatchingMenu_EntryConditionList;                     // 0x0368(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UUMG_MatchingMenu_SupplyList_C*                      UMG_MatchingMenu_SupplyList;                             // 0x0370(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class UWBP_StackB_S_C*                                     WBP_StackB_S;                                            // 0x0378(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash
		class FScriptMulticastDelegate                             OnCloseButtonClicked;                                    // 0x0380(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable
		class UUMG_MatchingMenu_EntryCondition_C*                  EntryCondition;                                          // 0x0390(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		int32_t                                                    EntryConditionId;                                        // 0x0398(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		unsigned char                                              UnknownData_R1P0[0x4];                                   // 0x039C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnClickRewardIcon;                                       // 0x03A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable
		class FString                                              SiteUrl;                                                 // 0x03B0(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash
		class FScriptMulticastDelegate                             OnClickSupplyIcon;                                       // 0x03C0(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable
		class UWBP_CommonToolTipText_Fixed_C*                      ToolTip;                                                 // 0x03D0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UUMG_MatchingMenu_EntryConditionClass_C*             EntryConditionClass;                                     // 0x03D8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UUMG_MatchingMenu_EntryConditionQuest_C*             EntryConditionQuest;                                     // 0x03E0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		TArray<ESBClassType>                                       EntryConditionClassList;                                 // 0x03E8(0x0010) Edit, BlueprintVisible, Net, DisableEditOnInstance
		TArray<class FName>                                        EntryConditionQuestList;                                 // 0x03F8(0x0010) Edit, BlueprintVisible, DisableEditOnInstance

	public:
		void CheckNeedPlayers(ESBEntryConditionPartyState PartyState, int32_t NeedPlayers, bool* Valid, bool* Passed);
		void GetRewardSearchName(int32_t ModeId, class FName* SearchName);
		void ClearRewardList(bool IsHelpMode);
		void GetExRankbyClassLv(int32_t Lv, int32_t* Rank);
		void CheckEntryConditionScb(int32_t Lv, int32_t Num, bool* Ret);
		void CheckEntryConditionQuest(TArray<class FName>* Quest, bool* Passed);
		void CheckEntryConditionClass(TArray<ESBClassType>* Class, bool* Passed);
		void SetStackB(ESBStackBEnableType StackB);
		void SetRewardList_DropTreasure(int32_t TreasureId);
		void SetRewardList_HelpBonus(const class FString& GameMode, const class FName& DungeonId, const class FName& RewardId, const struct FSBRewardBoostMissionMasterData& RewardBoostData, bool RewardBoostIsValid);
		void SetRewardList_Plus2(const class FString& GameMode, const class FName& DungeonId, const class FName& RewardId);
		void SetRewardList_Plus(const class FString& GameMode, const class FName& DungeonId, const class FName& RewardId);
		void SetRewardList_LimitTermFirst(const class FString& GameMode, const class FName& DungeonId, const class FName& RewardId, const struct FSBRewardBoostMissionMasterData& RewardBoostData, bool RewardBoostIsValid);
		void SetRewardList_FirstNormal2(const class FString& GameMode, const class FName& DungeonId, const class FName& RewardId, const struct FSBRewardBoostMissionMasterData& RewardBoostData, bool RewardBoostIsValid);
		void SetRewardList_FirstNormal(const class FString& GameMode, const class FName& DungeonId, const class FName& RewardId, const struct FSBRewardBoostMissionMasterData& RewardBoostData, bool RewardBoostIsValid);
		void SetRewardList_NormalRanked(const class FString& GameMode, const class FName& DungeonId, const struct FSBRewardBoostMissionMasterData& RewardBoostData, bool RewardBoostIsValid);
		void SetRewardList_FirstRanked(const class FString& GameMode, const class FName& DungeonId, const struct FSBRewardBoostMissionMasterData& RewardBoostData, bool RewardBoostIsValid);
		void SetRewardList2(const class FName& DungeonId, const class FName& DungeonRewardId, const class FString& DungeonGameMode);
		void SetRewardList(const class FName& DungeonId, const class FName& DungeonRewardId, const class FString& DungeonGameMode, int32_t DropTreasureID);
		void SetWebButton(const class FString& InSiteUrl);
		void SetEntryCondition2(int32_t RequiredBattleScore, int32_t RequiredClassLevel);
		void SetEntryCondition(int32_t RequiredBattleScore, int32_t LevelSync, int32_t RequiredAdventurerRank, int32_t EntryConditionId, ESBEntryConditionPartyState RequiredPartyState, int32_t RequiredClassLevel, TArray<class FName>* EntryConditionQuest, TArray<ESBClassType>* EntryConditionClass, int32_t NeedPlayers, int32_t EntryConditionSubClassLv, int32_t EntryConditionScbNum);
		void SetTimeLimit2();
		void SetTimeLimit(int32_t TimeLimit);
		void SetDungeonInfo2(const struct FSBMapInfo& DungeonMapInfo);
		void SetDungeonInfo(const struct FSBMapInfo& DungeonMapInfo);
		void Construct();
		void OnClickRewardIconEvent(class UQuestRewardIcon_C* Sender);
		void BndEvt__UMG_MatchingMenu_MissionDetail_ButtonWeb_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
		void BndEvt__UMG_MatchingMenu_MissionDetail_UMG_MatchingMenu_EntryConditionList_K2Node_ComponentBoundEvent_1_OnPressedButton__DelegateSignature(EntryConditionType EntryConditionType, int32_t Value, const struct FVector2D& Position);
		void OnCloseEntryCondition();
		void BndEvt__UMG_MatchingMenu_MissionDetail_UMG_MatchingMenu_SupplyList_K2Node_ComponentBoundEvent_2_OnClickIcon__DelegateSignature(const struct FSBDungeonSupply& DungeonSupply);
		void BndEvt__UMG_MatchingMenu_MissionDetail_ButtonWeb_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
		void BndEvt__UMG_MatchingMenu_MissionDetail_ButtonWeb_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
		void BndEvt__UMG_MatchingMenu_MissionDetail_UMG_MatchingMenu_EntryConditionList_K2Node_ComponentBoundEvent_5_OnPressedButtonClass__DelegateSignature(const struct FVector2D& Position);
		void BndEvt__UMG_MatchingMenu_MissionDetail_UMG_MatchingMenu_EntryConditionList_K2Node_ComponentBoundEvent_6_OnPressedButtonQuest__DelegateSignature(const struct FVector2D& Position);
		void OnClose_Quest();
		void OnClose_Class();
		void ExecuteUbergraph_UMG_MatchingMenu_MissionDetail(int32_t EntryPoint);
		void OnClickSupplyIcon__DelegateSignature(const struct FSBDungeonSupply& DungeonSupply);
		void OnClickRewardIcon__DelegateSignature(class UQuestRewardIcon_C* Sender);
		void OnCloseButtonClicked__DelegateSignature();
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
