#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.PreConstruct
	 */
	struct UUMG_PhotoModeControllCheckBox_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UUMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.Reset
	 */
	struct UUMG_PhotoModeControllCheckBox_C_Reset_Params
	{	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.SetValue
	 */
	struct UUMG_PhotoModeControllCheckBox_C_SetValue_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOnlyDisplay;                                            // 0x0001(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.UpdateShowNotify
	 */
	struct UUMG_PhotoModeControllCheckBox_C_UpdateShowNotify_Params
	{	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.Construct
	 */
	struct UUMG_PhotoModeControllCheckBox_C_Construct_Params
	{	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.SetDof
	 */
	struct UUMG_PhotoModeControllCheckBox_C_SetDof_Params
	{
	public:
		float                                                      Def;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.SetEnableDOF
	 */
	struct UUMG_PhotoModeControllCheckBox_C_SetEnableDOF_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.ExecuteUbergraph_UMG_PhotoModeControllCheckBox
	 */
	struct UUMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.OnCheckStateChanged__DelegateSignature
	 */
	struct UUMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
