#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.StartLoopAnimation
	 */
	struct UUMG_MatchingMenu_Confirm_C_StartLoopAnimation_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.SetSwitcherEnterOrJoin
	 */
	struct UUMG_MatchingMenu_Confirm_C_SetSwitcherEnterOrJoin_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Get_NeedParticipantNumberText_1_Text_1
	 */
	struct UUMG_MatchingMenu_Confirm_C_Get_NeedParticipantNumberText_1_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.IsTraveling
	 */
	struct UUMG_MatchingMenu_Confirm_C_IsTraveling_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Get_IsConfirmed
	 */
	struct UUMG_MatchingMenu_Confirm_C_Get_IsConfirmed_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.checkButtonEnable
	 */
	struct UUMG_MatchingMenu_Confirm_C_checkButtonEnable_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Get_JoinButton_bIsEnabled_1
	 */
	struct UUMG_MatchingMenu_Confirm_C_Get_JoinButton_bIsEnabled_1_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.IsEnableQualifyLevel
	 */
	struct UUMG_MatchingMenu_Confirm_C_IsEnableQualifyLevel_Params
	{
	public:
		bool                                                       enable;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_H55B[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.CancelInvite
	 */
	struct UUMG_MatchingMenu_Confirm_C_CancelInvite_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Get_TimeLimitText_Text_1
	 */
	struct UUMG_MatchingMenu_Confirm_C_Get_TimeLimitText_Text_1_Params
	{
	public:
		class FText                                                ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__JoinButton_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__JoinButton_K2Node_ComponentBoundEvent_199_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_199_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Tick
	 */
	struct UUMG_MatchingMenu_Confirm_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_EventOnClicked__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_1_EventOnClicked__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__JoinButton_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__JoinButton_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__JoinButton_1_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__JoinButton_1_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__JoinButton_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__JoinButton_1_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.OnGetPenaltyInfo
	 */
	struct UUMG_MatchingMenu_Confirm_C_OnGetPenaltyInfo_Params
	{
	public:
		bool                                                       bWasSuccessful;                                          // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_UK3D[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    PenaltyLiftedAt;                                         // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    LeftBeforePenalty;                                       // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.BndEvt__JoinButton_K2Node_ComponentBoundEvent_56_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_BndEvt__JoinButton_K2Node_ComponentBoundEvent_56_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.OnEndDeclineDialog
	 */
	struct UUMG_MatchingMenu_Confirm_C_OnEndDeclineDialog_Params
	{
	public:
		EYesNoDialogResult                                         Result;                                                  // 0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Construct
	 */
	struct UUMG_MatchingMenu_Confirm_C_Construct_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.Destruct
	 */
	struct UUMG_MatchingMenu_Confirm_C_Destruct_Params
	{	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.OnNoticeButtonUpdate_Event
	 */
	struct UUMG_MatchingMenu_Confirm_C_OnNoticeButtonUpdate_Event_Params
	{
	public:
		int32_t                                                    RetCode;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.ExecuteUbergraph_UMG_MatchingMenu_Confirm
	 */
	struct UUMG_MatchingMenu_Confirm_C_ExecuteUbergraph_UMG_MatchingMenu_Confirm_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_MatchingMenu_Confirm.UMG_MatchingMenu_Confirm_C.OnClosed__DelegateSignature
	 */
	struct UUMG_MatchingMenu_Confirm_C_OnClosed__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
