#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.Show
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_Show_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.Hide
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_Hide_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__FlatShop_ProductItem2_K2Node_ComponentBoundEvent_1_OnItemClicked__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__FlatShop_ProductItem2_K2Node_ComponentBoundEvent_1_OnItemClicked__DelegateSignature_Params
	{
	public:
		class UBP_SBProductItemData_C*                             Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__FlatShop_ProductItem2_K2Node_ComponentBoundEvent_3_OnSelectedItemData__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__FlatShop_ProductItem2_K2Node_ComponentBoundEvent_3_OnSelectedItemData__DelegateSignature_Params
	{
	public:
		class UBP_SBProductItemData_C*                             Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bTrying;                                                 // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__UMG_ItemPreviewItemInfo_K2Node_ComponentBoundEvent_9_OnShowDetails__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__UMG_ItemPreviewItemInfo_K2Node_ComponentBoundEvent_9_OnShowDetails__DelegateSignature_Params
	{
	public:
		bool                                                       bShow;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__UMG_ProductItem_K2Node_ComponentBoundEvent_0_OnReceiveButtonClicked__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__UMG_ProductItem_K2Node_ComponentBoundEvent_0_OnReceiveButtonClicked__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_WidgetAnimationEvt_AnimOut_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__UMG_DetailsImagineBattleZoomIn_K2Node_ComponentBoundEvent_10_OnClickZoomOut__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__UMG_DetailsImagineBattleZoomIn_K2Node_ComponentBoundEvent_10_OnClickZoomOut__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__UMG_SeasonPassItemReceiveMenu_UMG_ProductDetail_K2Node_ComponentBoundEvent_5_OnClickItemBoxDetail__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__UMG_SeasonPassItemReceiveMenu_UMG_ProductDetail_K2Node_ComponentBoundEvent_5_OnClickItemBoxDetail__DelegateSignature_Params
	{
	public:
		class UBP_SBProductItemData_C*                             Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__UMG_SeasonPassItemReceiveMenu_UMG_ProductDetail_K2Node_ComponentBoundEvent_2_OnClickZoomIn__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__UMG_SeasonPassItemReceiveMenu_UMG_ProductDetail_K2Node_ComponentBoundEvent_2_OnClickZoomIn__DelegateSignature_Params
	{
	public:
		E_SBDetailsZoomIn                                          Type;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.Construct
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_Construct_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.SetData
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_SetData_Params
	{
	public:
		class USBSeasonPassMenuRewardItemData*                     Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.SetProductData
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_SetProductData_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.BndEvt__FlatShop_ProductItem2_K2Node_ComponentBoundEvent_0_OnClose__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_BndEvt__FlatShop_ProductItem2_K2Node_ComponentBoundEvent_0_OnClose__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.UpdateDesign
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_UpdateDesign_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.UpdateDesignAndData
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_UpdateDesignAndData_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.OnUpdateData
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_OnUpdateData_Params
	{	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.ExecuteUbergraph_UMG_SeasonPassItemReceiveMenu
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_ExecuteUbergraph_UMG_SeasonPassItemReceiveMenu_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.OnClose__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_OnClose__DelegateSignature_Params
	{
	public:
		class UUMG_SeasonPassItemReceiveMenu_C*                    Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_SeasonPassItemReceiveMenu.UMG_SeasonPassItemReceiveMenu_C.OnClick_Receive__DelegateSignature
	 */
	struct UUMG_SeasonPassItemReceiveMenu_C_OnClick_Receive__DelegateSignature_Params
	{
	public:
		class USBSeasonPassMenuRewardItemData*                     Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
