#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.SetMode
	 */
	struct UUMG_PSOnlyDialog_C_SetMode_Params
	{
	public:
		bool                                                       OffToOn;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.OnInitialized
	 */
	struct UUMG_PSOnlyDialog_C_OnInitialized_Params
	{	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature
	 */
	struct UUMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SelectIndex;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature
	 */
	struct UUMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SelectIndex;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature
	 */
	struct UUMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SelectIndex;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature
	 */
	struct UUMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SelectIndex;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.ExecuteUbergraph_UMG_PSOnlyDialog
	 */
	struct UUMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.OnEnd__DelegateSignature
	 */
	struct UUMG_PSOnlyDialog_C_OnEnd__DelegateSignature_Params
	{
	public:
		bool                                                       Result;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
