#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.BndEvt__UMG_PhotoModePlayerListMain_SBCheckBoxCmnCheckBox01_DebugAll_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UUMG_PhotoModePlayerListMain_C_BndEvt__UMG_PhotoModePlayerListMain_SBCheckBoxCmnCheckBox01_DebugAll_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.BndEvt__UMG_PhotoModePlayerListMain_SBCheckBox_DebugVisibleOtherPlayer_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UUMG_PhotoModePlayerListMain_C_BndEvt__UMG_PhotoModePlayerListMain_SBCheckBox_DebugVisibleOtherPlayer_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.BndEvt__UMG_PhotoModePlayerListMain_UpdateButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_PhotoModePlayerListMain_C_BndEvt__UMG_PhotoModePlayerListMain_UpdateButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.BP_OnClickItemButton
	 */
	struct UUMG_PhotoModePlayerListMain_C_BP_OnClickItemButton_Params
	{
	public:
		class USBPhotoModePlayerListItem*                          Sender;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.BP_OnUpdatePlayerControlData
	 */
	struct UUMG_PhotoModePlayerListMain_C_BP_OnUpdatePlayerControlData_Params
	{	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.Construct
	 */
	struct UUMG_PhotoModePlayerListMain_C_Construct_Params
	{	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.ExecuteUbergraph_UMG_PhotoModePlayerListMain
	 */
	struct UUMG_PhotoModePlayerListMain_C_ExecuteUbergraph_UMG_PhotoModePlayerListMain_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.OnListUpdated__DelegateSignature
	 */
	struct UUMG_PhotoModePlayerListMain_C_OnListUpdated__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.OnClickUpdateButton__DelegateSignature
	 */
	struct UUMG_PhotoModePlayerListMain_C_OnClickUpdateButton__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_PhotoModePlayerListMain.UMG_PhotoModePlayerListMain_C.OnListSelected__DelegateSignature
	 */
	struct UUMG_PhotoModePlayerListMain_C_OnListSelected__DelegateSignature_Params
	{
	public:
		class ASBPlayerState*                                      PlayerState;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FName                                                CharacterId;                                             // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
