#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.Construct
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_Construct_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__Button_Register_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__Button_Register_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.AddItem
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_AddItem_Params
	{
	public:
		class USBAdminGotoBookmarkItem*                            NewData;                                                 // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.Destruct
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_Destruct_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.Reset
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_Reset_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__ListView_1_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__ListView_1_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature_Params
	{
	public:
		class UObject*                                             item;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bIsSelected;                                             // 0x0008(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__Button_Move_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__Button_Move_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.SetSelectedData
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_SetSelectedData_Params
	{
	public:
		class UObject*                                             SelectedData;                                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.CreateRegistrationWindow
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_CreateRegistrationWindow_Params
	{
	public:
		class USBAdminGotoBookmarkItem*                            EditingData;                                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__Button_Edit_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__Button_Edit_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.CloseRegistrationWindow
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_CloseRegistrationWindow_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__Button_Delete_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__Button_Delete_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.OnConfirmDelete
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_OnConfirmDelete_Params
	{
	public:
		EYesNoDialogResult                                         Result;                                                  // 0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__Button_Up_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__Button_Up_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__Button_Down_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__Button_Down_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.Show
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_Show_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.Hide
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_Hide_Params
	{	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__ListView_1_K2Node_ComponentBoundEvent_8_OnListEntryGeneratedDynamic__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__ListView_1_K2Node_ComponentBoundEvent_8_OnListEntryGeneratedDynamic__DelegateSignature_Params
	{
	public:
		class UUserWidget*                                         Widget;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.BndEvt__ListView_1_K2Node_ComponentBoundEvent_9_OnListEntryReleasedDynamic__DelegateSignature
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_BndEvt__ListView_1_K2Node_ComponentBoundEvent_9_OnListEntryReleasedDynamic__DelegateSignature_Params
	{
	public:
		class UUserWidget*                                         Widget;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.OnClickedItemMoveButton
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_OnClickedItemMoveButton_Params
	{
	public:
		class USBAdminGotoBookmarkItem*                            Data;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function UMG_AdminGotoBookmarkWindow.UMG_AdminGotoBookmarkWindow_C.ExecuteUbergraph_UMG_AdminGotoBookmarkWindow
	 */
	struct UUMG_AdminGotoBookmarkWindow_C_ExecuteUbergraph_UMG_AdminGotoBookmarkWindow_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
