#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.BndEvt__WBP_TermsOfService_SBCheckBoxCmnCheckBox01_C_6_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_BndEvt__WBP_TermsOfService_SBCheckBoxCmnCheckBox01_C_6_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.BndEvt__WBP_TermsOfService_ScrollBox_0_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_BndEvt__WBP_TermsOfService_ScrollBox_0_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature_Params
	{
	public:
		float                                                      CurrentOffset;                                           // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.Initialize
	 */
	struct UWBP_TermsOfService_C_Initialize_Params
	{
	public:
		class FText                                                InTitle;                                                 // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
		class FText                                                InExplanation;                                           // 0x0018(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
		class FText                                                InContents;                                              // 0x0030(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm)
	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.BndEvt__WBP_TermsOfService_SBButton_C_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_BndEvt__WBP_TermsOfService_SBButton_C_0_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.TryEnd
	 */
	struct UWBP_TermsOfService_C_TryEnd_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.WidgetAnimationEvt_AnimInOut_K2Node_WidgetAnimationEvent_1
	 */
	struct UWBP_TermsOfService_C_WidgetAnimationEvt_AnimInOut_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.Construct
	 */
	struct UWBP_TermsOfService_C_Construct_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.Destruct
	 */
	struct UWBP_TermsOfService_C_Destruct_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.BndEvt__WBP_TermsOfService_AgreeBtn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_BndEvt__WBP_TermsOfService_AgreeBtn_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.BndEvt__WBP_TermsOfService_AgreeBtn_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_BndEvt__WBP_TermsOfService_AgreeBtn_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.BndEvt__WBP_TermsOfService_CmnBack01_K2Node_ComponentBoundEvent_5_EventClicked__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_BndEvt__WBP_TermsOfService_CmnBack01_K2Node_ComponentBoundEvent_5_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.CustomEvent_1
	 */
	struct UWBP_TermsOfService_C_CustomEvent_1_Params
	{	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.ExecuteUbergraph_WBP_TermsOfService
	 */
	struct UWBP_TermsOfService_C_ExecuteUbergraph_WBP_TermsOfService_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_TermsOfService.WBP_TermsOfService_C.OnEnd__DelegateSignature
	 */
	struct UWBP_TermsOfService_C_OnEnd__DelegateSignature_Params
	{
	public:
		bool                                                       Approval;                                                // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
