#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.OnLoaded_1DFBD8004EBCEB458BED0A99B7EBFC67
	 */
	struct UWBP_SkillTreeHorizon_C_OnLoaded_1DFBD8004EBCEB458BED0A99B7EBFC67_Params
	{
	public:
		class UObject*                                             Loaded;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.OnLoaded_D391073141BB9F18836062A737A13918
	 */
	struct UWBP_SkillTreeHorizon_C_OnLoaded_D391073141BB9F18836062A737A13918_Params
	{
	public:
		class UObject*                                             Loaded;                                                  // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.PreConstruct
	 */
	struct UWBP_SkillTreeHorizon_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.Construct
	 */
	struct UWBP_SkillTreeHorizon_C_Construct_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.Init
	 */
	struct UWBP_SkillTreeHorizon_C_Init_Params
	{
	public:
		struct FSBSkillDataMasterData                              Skill;                                                   // 0x0000(0x0058)  (BlueprintVisible, BlueprintReadOnly, Parm)
		ESBClassType                                               ClassType;                                               // 0x0058(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.CustomEvent_1
	 */
	struct UWBP_SkillTreeHorizon_C_CustomEvent_1_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.Close
	 */
	struct UWBP_SkillTreeHorizon_C_Close_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_CmnBack01_K2Node_ComponentBoundEvent_0_EventClicked__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_CmnBack01_K2Node_ComponentBoundEvent_0_EventClicked__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_79_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_79_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_177_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_177_K2Node_ComponentBoundEvent_3_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.SkillDetailsDisplay
	 */
	struct UWBP_SkillTreeHorizon_C_SkillDetailsDisplay_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.SetISkillcon
	 */
	struct UWBP_SkillTreeHorizon_C_SetISkillcon_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_Q3Y8[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSBSkillTreeHorizonBranchData                       SBSkillTreeHorizonBranchData;                            // 0x0008(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		TArray<class UWBP_SkillHorizonBranchIcon_C*>               InSkillIconArray;                                        // 0x0020(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.SetSkillBrunch
	 */
	struct UWBP_SkillTreeHorizon_C_SetSkillBrunch_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_GU5K[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FSBSkillTreeHorizonBranchData                       SBSkillTreeHorizonBranchData;                            // 0x0008(0x0018)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		TArray<class UWBP_SkillTreeBranchSwitcher_C*>              InSkillBranchArray;                                      // 0x0020(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.TreeVisibleOff
	 */
	struct UWBP_SkillTreeHorizon_C_TreeVisibleOff_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIconOne_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIconOne_K2Node_ComponentBoundEvent_4_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.IconSelectUpdate
	 */
	struct UWBP_SkillTreeHorizon_C_IconSelectUpdate_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_1_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_1_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_2_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_2_K2Node_ComponentBoundEvent_6_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_3_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_3_K2Node_ComponentBoundEvent_7_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_4_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_4_4_K2Node_ComponentBoundEvent_8_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.UpdateRightWidgetsAnker
	 */
	struct UWBP_SkillTreeHorizon_C_UpdateRightWidgetsAnker_Params
	{	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_1_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_1_K2Node_ComponentBoundEvent_9_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_2_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_2_K2Node_ComponentBoundEvent_10_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_3_K2Node_ComponentBoundEvent_11_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_3_K2Node_ComponentBoundEvent_11_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_4_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_4_K2Node_ComponentBoundEvent_12_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_5_K2Node_ComponentBoundEvent_13_OnClick__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_BndEvt__WBP_SkillTreeHorizon_WBP_SkillHorizonBranchIcon_5_5_K2Node_ComponentBoundEvent_13_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.ExecuteUbergraph_WBP_SkillTreeHorizon
	 */
	struct UWBP_SkillTreeHorizon_C_ExecuteUbergraph_WBP_SkillTreeHorizon_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillTreeHorizon.WBP_SkillTreeHorizon_C.OnClose__DelegateSignature
	 */
	struct UWBP_SkillTreeHorizon_C_OnClose__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
