#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.PreConstruct
	 */
	struct UWBP_SkillHorizonBranchIcon_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.SkillSetSingleUpper
	 */
	struct UWBP_SkillHorizonBranchIcon_C_SkillSetSingleUpper_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.UpdetIcon
	 */
	struct UWBP_SkillHorizonBranchIcon_C_UpdetIcon_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_110_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_110_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_206_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_206_K2Node_ComponentBoundEvent_2_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.SetMulti
	 */
	struct UWBP_SkillHorizonBranchIcon_C_SetMulti_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.Init
	 */
	struct UWBP_SkillHorizonBranchIcon_C_Init_Params
	{
	public:
		TArray<struct FCharaSkillMasteryInfo>                      InSkillList;                                             // 0x0000(0x0010)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		ESkillTreeHorizonBranchType                                Brunch;                                                  // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_1_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_1_K2Node_ComponentBoundEvent_3_OnHovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_1_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_1_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_1_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_1_K2Node_ComponentBoundEvent_5_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_1_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_1_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_1_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_1_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_2_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_2_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_2_K2Node_ComponentBoundEvent_9_OnUnhovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_2_K2Node_ComponentBoundEvent_9_OnUnhovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_3_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_3_K2Node_ComponentBoundEvent_10_OnHovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_3_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_3_3_K2Node_ComponentBoundEvent_11_OnUnhovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_K2Node_ComponentBoundEvent_12_OnHovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_K2Node_ComponentBoundEvent_12_OnHovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_K2Node_ComponentBoundEvent_13_OnUnhovered__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_K2Node_ComponentBoundEvent_13_OnUnhovered__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_K2Node_ComponentBoundEvent_14_OnClick__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_BndEvt__WBP_SkillHorizonBranchIcon_WBP_SkillIconSwitcher_1_K2Node_ComponentBoundEvent_14_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.SkillSetSingleCenter
	 */
	struct UWBP_SkillHorizonBranchIcon_C_SkillSetSingleCenter_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.Construct
	 */
	struct UWBP_SkillHorizonBranchIcon_C_Construct_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.SelectUpdate
	 */
	struct UWBP_SkillHorizonBranchIcon_C_SelectUpdate_Params
	{	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.ExecuteUbergraph_WBP_SkillHorizonBranchIcon
	 */
	struct UWBP_SkillHorizonBranchIcon_C_ExecuteUbergraph_WBP_SkillHorizonBranchIcon_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_SkillHorizonBranchIcon.WBP_SkillHorizonBranchIcon_C.OnClick__DelegateSignature
	 */
	struct UWBP_SkillHorizonBranchIcon_C_OnClick__DelegateSignature_Params
	{
	public:
		int32_t                                                    SkillId;                                                 // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    SkillLV;                                                 // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
