#pragma once

/**
 * Name: BLUEPROTOCOL-Win64-Shipping
 * Version: 1.6.0
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.NewFunction_1
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_NewFunction_1_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.IsTestKeyUse
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_IsTestKeyUse_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
		bool                                                       Result;                                                  // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_WDQC[0x7];                                   // 0x0019(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.OnKeyDown
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_OnKeyDown_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FKeyEvent                                           InKeyEvent;                                              // 0x0038(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm)
		struct FEventReply                                         ReturnValue;                                             // 0x0070(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.Construct
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_Construct_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.UpdateKey
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_UpdateKey_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.Destruct
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_Destruct_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__Button1_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__Button1_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__Button1_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__Button1_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__Button1_1_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__Button1_1_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__Button2_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__Button2_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__Button1_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__Button1_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__Button2_1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__Button2_1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.BndEvt__WBP_CommandMenuBookmarkRegister_CmnClose02_K2Node_ComponentBoundEvent_2_OnClosed__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_BndEvt__WBP_CommandMenuBookmarkRegister_CmnClose02_K2Node_ComponentBoundEvent_2_OnClosed__DelegateSignature_Params
	{	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.ExecuteUbergraph_WBP_CommandMenuBookmarkRegister
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_ExecuteUbergraph_WBP_CommandMenuBookmarkRegister_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_LUOE[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function WBP_CommandMenuBookmarkRegister.WBP_CommandMenuBookmarkRegister_C.UpdateFinish__DelegateSignature
	 */
	struct UWBP_CommandMenuBookmarkRegister_C_UpdateFinish__DelegateSignature_Params
	{
	public:
		ESBBookMarkerSlot                                          BookmarkSlot;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_ELKJ[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              KeyString;                                               // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
