#pragma once

 

// Package: AIFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIFramework_structs.hpp"
#include "NavigationSystem_classes.hpp"


namespace SDK
{

// Class AIFramework.AIFwNodeBase
// 0x0008 (0x0030 - 0x0028)
class UAIFwNodeBase : public UObject
{
public:
	uint8                                         Pad_1A4D[0x8];                                     // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwNodeBase">();
	}
	static class UAIFwNodeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwNodeBase>();
	}
};
static_assert(alignof(UAIFwNodeBase) == 0x000008, "Wrong alignment on UAIFwNodeBase");
static_assert(sizeof(UAIFwNodeBase) == 0x000030, "Wrong size on UAIFwNodeBase");

// Class AIFramework.AIFwPTCriterionNode
// 0x0010 (0x0040 - 0x0030)
class UAIFwPTCriterionNode : public UAIFwNodeBase
{
public:
	EPTCriterionSlot                              CriterionSlot;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A4E[0xF];                                     // 0x0031(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTCriterionNode">();
	}
	static class UAIFwPTCriterionNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTCriterionNode>();
	}
};
static_assert(alignof(UAIFwPTCriterionNode) == 0x000008, "Wrong alignment on UAIFwPTCriterionNode");
static_assert(sizeof(UAIFwPTCriterionNode) == 0x000040, "Wrong size on UAIFwPTCriterionNode");
static_assert(offsetof(UAIFwPTCriterionNode, CriterionSlot) == 0x000030, "Member 'UAIFwPTCriterionNode::CriterionSlot' has a wrong offset!");

// Class AIFramework.AIFwPTCriterionActorsOfClass
// 0x0008 (0x0048 - 0x0040)
class UAIFwPTCriterionActorsOfClass final : public UAIFwPTCriterionNode
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTCriterionActorsOfClass">();
	}
	static class UAIFwPTCriterionActorsOfClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTCriterionActorsOfClass>();
	}
};
static_assert(alignof(UAIFwPTCriterionActorsOfClass) == 0x000008, "Wrong alignment on UAIFwPTCriterionActorsOfClass");
static_assert(sizeof(UAIFwPTCriterionActorsOfClass) == 0x000048, "Wrong size on UAIFwPTCriterionActorsOfClass");
static_assert(offsetof(UAIFwPTCriterionActorsOfClass, ActorClass) == 0x000040, "Member 'UAIFwPTCriterionActorsOfClass::ActorClass' has a wrong offset!");

// Class AIFramework.AIFwBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAIFwBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FAIFwClothoidSegment ClothoidInterp(const struct FVector2D& StartPosition, float StartAngle, const struct FVector2D& EndPosition, float EndAngle);
	static struct FAIFwClothoidSegment ClothoidInterpRad(const struct FVector2D& StartPosition, float StartAngle, const struct FVector2D& EndPosition, float EndAngle);
	static class AAIFwAIDirector* GetAIDirector(class UObject* WorldContextObject);
	static class UAIFwBlackboardComponent* GetAIFwBlackboard(class AActor* Target);
	static struct FVector2D GetClothoidLocationAtTime(const struct FAIFwClothoidSegment& Segment, float Time);
	static float GetFactionRelation(class AActor* From, class AActor* To);
	static struct FVector2D GetMultipleClothoidLocationAtTime(const struct FAIFwMultipleClothoidSegment& Segment, float Time);
	static int32 Hash32(const class FString& String);
	static struct FAIFwMultipleClothoidSegment MultipleClothoidInterp(const struct FVector2D& StartPosition, float StartAngle, float StartCurvature, const struct FVector2D& EndPosition, float EndAngle, float EndCurvature);
	static struct FAIFwMultipleClothoidSegment MultipleClothoidInterpRad(const struct FVector2D& StartPosition, float StartAngle, float StartCurvature, const struct FVector2D& EndPosition, float EndAngle, float EndCurvature);
	static bool RunAIFwBehaviorTree(class AActor* Target, class UAIFwBehaviorTree* BehaviorTree, bool bLooping);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBlueprintLibrary">();
	}
	static class UAIFwBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBlueprintLibrary>();
	}
};
static_assert(alignof(UAIFwBlueprintLibrary) == 0x000008, "Wrong alignment on UAIFwBlueprintLibrary");
static_assert(sizeof(UAIFwBlueprintLibrary) == 0x000028, "Wrong size on UAIFwBlueprintLibrary");

// Class AIFramework.AIFwAIDirector
// 0x0010 (0x0238 - 0x0228)
class AAIFwAIDirector : public AActor
{
public:
	class UAIFwBlackboardComponent*               BlackboardComponent;                               // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIFwHierarchyComponent*                HierarchyComponent;                                // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ReceiveOnActorSpawned(class AActor* SpawnedActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwAIDirector">();
	}
	static class AAIFwAIDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIFwAIDirector>();
	}
};
static_assert(alignof(AAIFwAIDirector) == 0x000008, "Wrong alignment on AAIFwAIDirector");
static_assert(sizeof(AAIFwAIDirector) == 0x000238, "Wrong size on AAIFwAIDirector");
static_assert(offsetof(AAIFwAIDirector, BlackboardComponent) == 0x000228, "Member 'AAIFwAIDirector::BlackboardComponent' has a wrong offset!");
static_assert(offsetof(AAIFwAIDirector, HierarchyComponent) == 0x000230, "Member 'AAIFwAIDirector::HierarchyComponent' has a wrong offset!");

// Class AIFramework.AIFwAITask_TeleportTo
// 0x0010 (0x0080 - 0x0070)
class UAIFwAITask_TeleportTo final : public UAITask
{
public:
	uint8                                         Pad_1A52[0x10];                                    // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwAITask_TeleportTo">();
	}
	static class UAIFwAITask_TeleportTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwAITask_TeleportTo>();
	}
};
static_assert(alignof(UAIFwAITask_TeleportTo) == 0x000008, "Wrong alignment on UAIFwAITask_TeleportTo");
static_assert(sizeof(UAIFwAITask_TeleportTo) == 0x000080, "Wrong size on UAIFwAITask_TeleportTo");

// Class AIFramework.AIFwNavVolumeTestingActor
// 0x0008 (0x0320 - 0x0318)
class AAIFwNavVolumeTestingActor final : public ANavigationTestingActor
{
public:
	uint8                                         bWantsStringPulling : 1;                           // 0x0318(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWantsShortcutPath : 1;                            // 0x0318(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1A53[0x7];                                     // 0x0319(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwNavVolumeTestingActor">();
	}
	static class AAIFwNavVolumeTestingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIFwNavVolumeTestingActor>();
	}
};
static_assert(alignof(AAIFwNavVolumeTestingActor) == 0x000008, "Wrong alignment on AAIFwNavVolumeTestingActor");
static_assert(sizeof(AAIFwNavVolumeTestingActor) == 0x000320, "Wrong size on AAIFwNavVolumeTestingActor");

// Class AIFramework.AIFwNodeBasedAsset
// 0x0008 (0x0030 - 0x0028)
class UAIFwNodeBasedAsset : public UObject
{
public:
	int32                                         DataType;                                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A54[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwNodeBasedAsset">();
	}
	static class UAIFwNodeBasedAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwNodeBasedAsset>();
	}
};
static_assert(alignof(UAIFwNodeBasedAsset) == 0x000008, "Wrong alignment on UAIFwNodeBasedAsset");
static_assert(sizeof(UAIFwNodeBasedAsset) == 0x000030, "Wrong size on UAIFwNodeBasedAsset");
static_assert(offsetof(UAIFwNodeBasedAsset, DataType) == 0x000028, "Member 'UAIFwNodeBasedAsset::DataType' has a wrong offset!");

// Class AIFramework.AIFwPerceptionComponent
// 0x0028 (0x00E0 - 0x00B8)
class UAIFwPerceptionComponent : public UActorComponent
{
public:
	TArray<struct FAIFwParameterizedBTRequest>    PerceptionTrees;                                   // 0x00B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A55[0x18];                                    // 0x00C8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearSensedActors();
	void SetSenseEnabled(const class FString& Tag, bool bEnabled);

	TArray<class AActor*> GetSensedActors(const class FString& Tag) const;
	int32 GetSensedActorsCount() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPerceptionComponent">();
	}
	static class UAIFwPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPerceptionComponent>();
	}
};
static_assert(alignof(UAIFwPerceptionComponent) == 0x000008, "Wrong alignment on UAIFwPerceptionComponent");
static_assert(sizeof(UAIFwPerceptionComponent) == 0x0000E0, "Wrong size on UAIFwPerceptionComponent");
static_assert(offsetof(UAIFwPerceptionComponent, PerceptionTrees) == 0x0000B8, "Member 'UAIFwPerceptionComponent::PerceptionTrees' has a wrong offset!");

// Class AIFramework.AIFwBehaviorTree
// 0x0010 (0x0040 - 0x0030)
class UAIFwBehaviorTree final : public UAIFwNodeBasedAsset
{
public:
	uint8                                         Pad_1A57[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBehaviorTree">();
	}
	static class UAIFwBehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBehaviorTree>();
	}
};
static_assert(alignof(UAIFwBehaviorTree) == 0x000008, "Wrong alignment on UAIFwBehaviorTree");
static_assert(sizeof(UAIFwBehaviorTree) == 0x000040, "Wrong size on UAIFwBehaviorTree");

// Class AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper
// 0x0040 (0x0068 - 0x0028)
class UAIFwPerceptionTreeInstanceBlueprintWrapper final : public UObject
{
public:
	uint8                                         Pad_1A58[0x30];                                    // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnFinishedDelegate;                                // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	static class UAIFwPerceptionTreeInstanceBlueprintWrapper* RunInstantParameterizedPerceptionTree(class AActor* Target, const struct FAIFwParameterizedBTRequest& Query, int32 MaxCount);
	static class UAIFwPerceptionTreeInstanceBlueprintWrapper* RunInstantParameterizedPerceptionTreeRandom(class AActor* Target, const struct FAIFwParameterizedBTRequest& Query, int32 MaxCount);
	static class UAIFwPerceptionTreeInstanceBlueprintWrapper* RunInstantPerceptionTree(class AActor* Target, class UAIFwBehaviorTree* Template);
	static class UAIFwPerceptionTreeInstanceBlueprintWrapper* RunPerceptionTree(class AActor* Target, class UAIFwBehaviorTree* Template);

	void AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature(class UAIFwPerceptionTreeInstanceBlueprintWrapper* QueryInstance);
	int32 GetResultCount();
	TArray<class AActor*> GetResultsAsActors();
	TArray<struct FVector> GetResultsAsLocations();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPerceptionTreeInstanceBlueprintWrapper">();
	}
	static class UAIFwPerceptionTreeInstanceBlueprintWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPerceptionTreeInstanceBlueprintWrapper>();
	}
};
static_assert(alignof(UAIFwPerceptionTreeInstanceBlueprintWrapper) == 0x000008, "Wrong alignment on UAIFwPerceptionTreeInstanceBlueprintWrapper");
static_assert(sizeof(UAIFwPerceptionTreeInstanceBlueprintWrapper) == 0x000068, "Wrong size on UAIFwPerceptionTreeInstanceBlueprintWrapper");
static_assert(offsetof(UAIFwPerceptionTreeInstanceBlueprintWrapper, OnFinishedDelegate) == 0x000058, "Member 'UAIFwPerceptionTreeInstanceBlueprintWrapper::OnFinishedDelegate' has a wrong offset!");

// Class AIFramework.AIFwBlackboardBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAIFwBlackboardBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearValue(struct FAIFwBlackboard* Blackboard, const class FString& KeyName);
	static bool GetValueAsBool(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static class UClass* GetValueAsClass(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static float GetValueAsFloat(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static int32 GetValueAsInt(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static class FName GetValueAsName(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static class UObject* GetValueAsObject(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static TArray<class UObject*> GetValueAsObjectArray(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static class FString GetValueAsString(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static struct FVector GetValueAsVector(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static TArray<struct FVector> GetValueAsVectorArray(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static bool IsValidKey(const struct FAIFwBlackboard& Blackboard, const class FString& KeyName);
	static void SetValueAsBool(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, bool BoolValue);
	static void SetValueAsClass(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, class UClass* ClassValue);
	static void SetValueAsFloat(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, float FloatValue);
	static void SetValueAsInt(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, int32 IntValue);
	static void SetValueAsName(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, class FName NameValue);
	static void SetValueAsObject(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, class UObject* ObjectValue);
	static void SetValueAsObjectArray(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, const TArray<class UObject*>& ObjectArray);
	static void SetValueAsString(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, const class FString& StringValue);
	static void SetValueAsVector(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, const struct FVector& VectorValue);
	static void SetValueAsVectorArray(struct FAIFwBlackboard* Blackboard, const class FString& KeyName, const TArray<struct FVector>& VectorArray);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBlackboardBlueprintLibrary">();
	}
	static class UAIFwBlackboardBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBlackboardBlueprintLibrary>();
	}
};
static_assert(alignof(UAIFwBlackboardBlueprintLibrary) == 0x000008, "Wrong alignment on UAIFwBlackboardBlueprintLibrary");
static_assert(sizeof(UAIFwBlackboardBlueprintLibrary) == 0x000028, "Wrong size on UAIFwBlackboardBlueprintLibrary");

// Class AIFramework.AIFwBlackboardComponent
// 0x0028 (0x00E0 - 0x00B8)
class UAIFwBlackboardComponent final : public UActorComponent
{
public:
	uint8                                         Pad_1A64[0x28];                                    // 0x00B8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindToUE4Blackboard(const class FString& KeyName, class UBlackboardComponent* OtherBlackboard, const class FName& OtherKeyName);
	void ClearValue(const class FString& KeyName);
	void SetValueAsBool(const class FString& KeyName, bool BoolValue);
	void SetValueAsClass(const class FString& KeyName, class UClass* ClassValue);
	void SetValueAsEnum(const class FString& KeyName, uint8 EnumValue);
	void SetValueAsFloat(const class FString& KeyName, float FloatValue);
	void SetValueAsInt(const class FString& KeyName, int32 IntValue);
	void SetValueAsIntArray(const class FString& KeyName, const TArray<int32>& IntArray);
	void SetValueAsName(const class FString& KeyName, class FName NameValue);
	void SetValueAsObject(const class FString& KeyName, class UObject* ObjectValue);
	void SetValueAsObjectArray(const class FString& KeyName, const TArray<class UObject*>& ObjectArray);
	void SetValueAsRotator(const class FString& KeyName, const struct FRotator& VectorValue);
	void SetValueAsString(const class FString& KeyName, const class FString& StringValue);
	void SetValueAsVector(const class FString& KeyName, const struct FVector& VectorValue);
	void SetValueAsVectorArray(const class FString& KeyName, const TArray<struct FVector>& VectorArray);

	bool GetValueAsBool(const class FString& KeyName) const;
	class UClass* GetValueAsClass(const class FString& KeyName) const;
	uint8 GetValueAsEnum(const class FString& KeyName) const;
	float GetValueAsFloat(const class FString& KeyName) const;
	int32 GetValueAsInt(const class FString& KeyName) const;
	TArray<int32> GetValueAsIntArray(const class FString& KeyName) const;
	struct FVector GetValueAsLocation(const class FString& KeyName) const;
	class FName GetValueAsName(const class FString& KeyName) const;
	class UObject* GetValueAsObject(const class FString& KeyName) const;
	TArray<class UObject*> GetValueAsObjectArray(const class FString& KeyName) const;
	struct FRotator GetValueAsRotation(const class FString& KeyName) const;
	struct FRotator GetValueAsRotator(const class FString& KeyName) const;
	class FString GetValueAsString(const class FString& KeyName) const;
	struct FVector GetValueAsVector(const class FString& KeyName) const;
	TArray<struct FVector> GetValueAsVectorArray(const class FString& KeyName) const;
	bool IsValidKey(const class FString& KeyName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBlackboardComponent">();
	}
	static class UAIFwBlackboardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBlackboardComponent>();
	}
};
static_assert(alignof(UAIFwBlackboardComponent) == 0x000008, "Wrong alignment on UAIFwBlackboardComponent");
static_assert(sizeof(UAIFwBlackboardComponent) == 0x0000E0, "Wrong size on UAIFwBlackboardComponent");

// Class AIFramework.AIFwPTCriterionSquadMember
// 0x0008 (0x0048 - 0x0040)
class UAIFwPTCriterionSquadMember : public UAIFwPTCriterionNode
{
public:
	bool                                          IgnoreSelf;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A74[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTCriterionSquadMember">();
	}
	static class UAIFwPTCriterionSquadMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTCriterionSquadMember>();
	}
};
static_assert(alignof(UAIFwPTCriterionSquadMember) == 0x000008, "Wrong alignment on UAIFwPTCriterionSquadMember");
static_assert(sizeof(UAIFwPTCriterionSquadMember) == 0x000048, "Wrong size on UAIFwPTCriterionSquadMember");
static_assert(offsetof(UAIFwPTCriterionSquadMember, IgnoreSelf) == 0x000040, "Member 'UAIFwPTCriterionSquadMember::IgnoreSelf' has a wrong offset!");

// Class AIFramework.AIFwPTCriterionSquadMemberDestinations
// 0x0008 (0x0048 - 0x0040)
class UAIFwPTCriterionSquadMemberDestinations : public UAIFwPTCriterionNode
{
public:
	bool                                          IgnoreSelf;                                        // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A75[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTCriterionSquadMemberDestinations">();
	}
	static class UAIFwPTCriterionSquadMemberDestinations* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTCriterionSquadMemberDestinations>();
	}
};
static_assert(alignof(UAIFwPTCriterionSquadMemberDestinations) == 0x000008, "Wrong alignment on UAIFwPTCriterionSquadMemberDestinations");
static_assert(sizeof(UAIFwPTCriterionSquadMemberDestinations) == 0x000048, "Wrong size on UAIFwPTCriterionSquadMemberDestinations");
static_assert(offsetof(UAIFwPTCriterionSquadMemberDestinations, IgnoreSelf) == 0x000040, "Member 'UAIFwPTCriterionSquadMemberDestinations::IgnoreSelf' has a wrong offset!");

// Class AIFramework.AIFwBTDecoratorNode
// 0x0008 (0x0038 - 0x0030)
class UAIFwBTDecoratorNode : public UAIFwNodeBase
{
public:
	uint8                                         Pad_1A76[0x8];                                     // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTDecoratorNode">();
	}
	static class UAIFwBTDecoratorNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTDecoratorNode>();
	}
};
static_assert(alignof(UAIFwBTDecoratorNode) == 0x000008, "Wrong alignment on UAIFwBTDecoratorNode");
static_assert(sizeof(UAIFwBTDecoratorNode) == 0x000038, "Wrong size on UAIFwBTDecoratorNode");

// Class AIFramework.AIFwPTEvaluationNode
// 0x0018 (0x0048 - 0x0030)
class UAIFwPTEvaluationNode : public UAIFwNodeBase
{
public:
	bool                                          Filter;                                            // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Score;                                             // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPTEvalOperation                              AdditionalOperation;                               // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A77[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditionalScale;                                   // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A78[0x10];                                    // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTEvaluationNode">();
	}
	static class UAIFwPTEvaluationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTEvaluationNode>();
	}
};
static_assert(alignof(UAIFwPTEvaluationNode) == 0x000008, "Wrong alignment on UAIFwPTEvaluationNode");
static_assert(sizeof(UAIFwPTEvaluationNode) == 0x000048, "Wrong size on UAIFwPTEvaluationNode");
static_assert(offsetof(UAIFwPTEvaluationNode, Filter) == 0x000030, "Member 'UAIFwPTEvaluationNode::Filter' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationNode, Score) == 0x000031, "Member 'UAIFwPTEvaluationNode::Score' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationNode, AdditionalOperation) == 0x000032, "Member 'UAIFwPTEvaluationNode::AdditionalOperation' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationNode, AdditionalScale) == 0x000034, "Member 'UAIFwPTEvaluationNode::AdditionalScale' has a wrong offset!");

// Class AIFramework.AIFwBTFocus
// 0x0028 (0x0060 - 0x0038)
class UAIFwBTFocus final : public UAIFwBTDecoratorNode
{
public:
	class FString                                 BlackboardKey;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A79[0x10];                                    // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EAIFwFocusPriority                            FocusPriority;                                     // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A7A[0x7];                                     // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTFocus">();
	}
	static class UAIFwBTFocus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTFocus>();
	}
};
static_assert(alignof(UAIFwBTFocus) == 0x000008, "Wrong alignment on UAIFwBTFocus");
static_assert(sizeof(UAIFwBTFocus) == 0x000060, "Wrong size on UAIFwBTFocus");
static_assert(offsetof(UAIFwBTFocus, BlackboardKey) == 0x000038, "Member 'UAIFwBTFocus::BlackboardKey' has a wrong offset!");
static_assert(offsetof(UAIFwBTFocus, FocusPriority) == 0x000058, "Member 'UAIFwBTFocus::FocusPriority' has a wrong offset!");

// Class AIFramework.AIFwPTEvaluationNodeUseCriterion
// 0x0008 (0x0050 - 0x0048)
class UAIFwPTEvaluationNodeUseCriterion : public UAIFwPTEvaluationNode
{
public:
	bool                                          AllPath;                                           // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPTEvalScoreType                              ScoreType;                                         // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A7B[0x6];                                     // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTEvaluationNodeUseCriterion">();
	}
	static class UAIFwPTEvaluationNodeUseCriterion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTEvaluationNodeUseCriterion>();
	}
};
static_assert(alignof(UAIFwPTEvaluationNodeUseCriterion) == 0x000008, "Wrong alignment on UAIFwPTEvaluationNodeUseCriterion");
static_assert(sizeof(UAIFwPTEvaluationNodeUseCriterion) == 0x000050, "Wrong size on UAIFwPTEvaluationNodeUseCriterion");
static_assert(offsetof(UAIFwPTEvaluationNodeUseCriterion, AllPath) == 0x000048, "Member 'UAIFwPTEvaluationNodeUseCriterion::AllPath' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationNodeUseCriterion, ScoreType) == 0x000049, "Member 'UAIFwPTEvaluationNodeUseCriterion::ScoreType' has a wrong offset!");

// Class AIFramework.AIFwBTNode
// 0x0010 (0x0040 - 0x0030)
class UAIFwBTNode : public UAIFwNodeBase
{
public:
	uint8                                         Pad_1A7C[0x10];                                    // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTNode">();
	}
	static class UAIFwBTNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTNode>();
	}
};
static_assert(alignof(UAIFwBTNode) == 0x000008, "Wrong alignment on UAIFwBTNode");
static_assert(sizeof(UAIFwBTNode) == 0x000040, "Wrong size on UAIFwBTNode");

// Class AIFramework.AIFwPTEvaluationInfluence
// 0x0018 (0x0068 - 0x0050)
class UAIFwPTEvaluationInfluence final : public UAIFwPTEvaluationNodeUseCriterion
{
public:
	class FString                                 LayerName;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinValue;                                          // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxValue;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTEvaluationInfluence">();
	}
	static class UAIFwPTEvaluationInfluence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTEvaluationInfluence>();
	}
};
static_assert(alignof(UAIFwPTEvaluationInfluence) == 0x000008, "Wrong alignment on UAIFwPTEvaluationInfluence");
static_assert(sizeof(UAIFwPTEvaluationInfluence) == 0x000068, "Wrong size on UAIFwPTEvaluationInfluence");
static_assert(offsetof(UAIFwPTEvaluationInfluence, LayerName) == 0x000050, "Member 'UAIFwPTEvaluationInfluence::LayerName' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationInfluence, MinValue) == 0x000060, "Member 'UAIFwPTEvaluationInfluence::MinValue' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationInfluence, MaxValue) == 0x000064, "Member 'UAIFwPTEvaluationInfluence::MaxValue' has a wrong offset!");

// Class AIFramework.AIFwBTInvokeFunction
// 0x0040 (0x0080 - 0x0040)
class UAIFwBTInvokeFunction final : public UAIFwBTNode
{
public:
	struct FAIFwBTNodePropertyString              ObjectKey;                                         // 0x0040(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyString              FunctionName;                                      // 0x0060(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTInvokeFunction">();
	}
	static class UAIFwBTInvokeFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTInvokeFunction>();
	}
};
static_assert(alignof(UAIFwBTInvokeFunction) == 0x000008, "Wrong alignment on UAIFwBTInvokeFunction");
static_assert(sizeof(UAIFwBTInvokeFunction) == 0x000080, "Wrong size on UAIFwBTInvokeFunction");
static_assert(offsetof(UAIFwBTInvokeFunction, ObjectKey) == 0x000040, "Member 'UAIFwBTInvokeFunction::ObjectKey' has a wrong offset!");
static_assert(offsetof(UAIFwBTInvokeFunction, FunctionName) == 0x000060, "Member 'UAIFwBTInvokeFunction::FunctionName' has a wrong offset!");

// Class AIFramework.AIFwPTEvaluationNavMeshRaycast
// 0x0010 (0x0060 - 0x0050)
class UAIFwPTEvaluationNavMeshRaycast final : public UAIFwPTEvaluationNodeUseCriterion
{
public:
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Acceptance;                                        // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A7D[0x7];                                     // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTEvaluationNavMeshRaycast">();
	}
	static class UAIFwPTEvaluationNavMeshRaycast* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTEvaluationNavMeshRaycast>();
	}
};
static_assert(alignof(UAIFwPTEvaluationNavMeshRaycast) == 0x000008, "Wrong alignment on UAIFwPTEvaluationNavMeshRaycast");
static_assert(sizeof(UAIFwPTEvaluationNavMeshRaycast) == 0x000060, "Wrong size on UAIFwPTEvaluationNavMeshRaycast");
static_assert(offsetof(UAIFwPTEvaluationNavMeshRaycast, FilterClass) == 0x000050, "Member 'UAIFwPTEvaluationNavMeshRaycast::FilterClass' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationNavMeshRaycast, Acceptance) == 0x000058, "Member 'UAIFwPTEvaluationNavMeshRaycast::Acceptance' has a wrong offset!");

// Class AIFramework.AIFwBTMaxWalkSpeed
// 0x0018 (0x0050 - 0x0038)
class UAIFwBTMaxWalkSpeed final : public UAIFwBTDecoratorNode
{
public:
	struct FAIFwBTNodePropertyFloat               MaxWalkSpeed;                                      // 0x0038(0x0018)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTMaxWalkSpeed">();
	}
	static class UAIFwBTMaxWalkSpeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTMaxWalkSpeed>();
	}
};
static_assert(alignof(UAIFwBTMaxWalkSpeed) == 0x000008, "Wrong alignment on UAIFwBTMaxWalkSpeed");
static_assert(sizeof(UAIFwBTMaxWalkSpeed) == 0x000050, "Wrong size on UAIFwBTMaxWalkSpeed");
static_assert(offsetof(UAIFwBTMaxWalkSpeed, MaxWalkSpeed) == 0x000038, "Member 'UAIFwBTMaxWalkSpeed::MaxWalkSpeed' has a wrong offset!");

// Class AIFramework.AIFwPTEvaluationPathfinding
// 0x0020 (0x0070 - 0x0050)
class UAIFwPTEvaluationPathfinding final : public UAIFwPTEvaluationNodeUseCriterion
{
public:
	EAIFwPTEvalPathfindingMode                    Mode;                                              // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A7E[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PathFromCriterion;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A7F[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinValue;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxValue;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          Acceptance;                                        // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A80[0x3];                                     // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwPTEvaluationPathfinding">();
	}
	static class UAIFwPTEvaluationPathfinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwPTEvaluationPathfinding>();
	}
};
static_assert(alignof(UAIFwPTEvaluationPathfinding) == 0x000008, "Wrong alignment on UAIFwPTEvaluationPathfinding");
static_assert(sizeof(UAIFwPTEvaluationPathfinding) == 0x000070, "Wrong size on UAIFwPTEvaluationPathfinding");
static_assert(offsetof(UAIFwPTEvaluationPathfinding, Mode) == 0x000050, "Member 'UAIFwPTEvaluationPathfinding::Mode' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationPathfinding, FilterClass) == 0x000058, "Member 'UAIFwPTEvaluationPathfinding::FilterClass' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationPathfinding, PathFromCriterion) == 0x000060, "Member 'UAIFwPTEvaluationPathfinding::PathFromCriterion' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationPathfinding, MinValue) == 0x000064, "Member 'UAIFwPTEvaluationPathfinding::MinValue' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationPathfinding, MaxValue) == 0x000068, "Member 'UAIFwPTEvaluationPathfinding::MaxValue' has a wrong offset!");
static_assert(offsetof(UAIFwPTEvaluationPathfinding, Acceptance) == 0x00006C, "Member 'UAIFwPTEvaluationPathfinding::Acceptance' has a wrong offset!");

// Class AIFramework.AIFwBTMoveTo
// 0x00A8 (0x00E8 - 0x0040)
class UAIFwBTMoveTo final : public UAIFwBTNode
{
public:
	uint8                                         Pad_1A81[0x8];                                     // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIFwBTNodePropertyString              BlackboardKey;                                     // 0x0048(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyFloat               AcceptableRadius;                                  // 0x0068(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyBool                bAllowStrafe;                                      // 0x0088(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyBool                bAllowPartialPath;                                 // 0x00A0(0x0018)(Edit, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyBool                bReachTestIncludesAgentRadius;                     // 0x00B8(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyBool                bReachTestIncludesGoalRadius;                      // 0x00D0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTMoveTo">();
	}
	static class UAIFwBTMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTMoveTo>();
	}
};
static_assert(alignof(UAIFwBTMoveTo) == 0x000008, "Wrong alignment on UAIFwBTMoveTo");
static_assert(sizeof(UAIFwBTMoveTo) == 0x0000E8, "Wrong size on UAIFwBTMoveTo");
static_assert(offsetof(UAIFwBTMoveTo, BlackboardKey) == 0x000048, "Member 'UAIFwBTMoveTo::BlackboardKey' has a wrong offset!");
static_assert(offsetof(UAIFwBTMoveTo, AcceptableRadius) == 0x000068, "Member 'UAIFwBTMoveTo::AcceptableRadius' has a wrong offset!");
static_assert(offsetof(UAIFwBTMoveTo, FilterClass) == 0x000080, "Member 'UAIFwBTMoveTo::FilterClass' has a wrong offset!");
static_assert(offsetof(UAIFwBTMoveTo, bAllowStrafe) == 0x000088, "Member 'UAIFwBTMoveTo::bAllowStrafe' has a wrong offset!");
static_assert(offsetof(UAIFwBTMoveTo, bAllowPartialPath) == 0x0000A0, "Member 'UAIFwBTMoveTo::bAllowPartialPath' has a wrong offset!");
static_assert(offsetof(UAIFwBTMoveTo, bReachTestIncludesAgentRadius) == 0x0000B8, "Member 'UAIFwBTMoveTo::bReachTestIncludesAgentRadius' has a wrong offset!");
static_assert(offsetof(UAIFwBTMoveTo, bReachTestIncludesGoalRadius) == 0x0000D0, "Member 'UAIFwBTMoveTo::bReachTestIncludesGoalRadius' has a wrong offset!");

// Class AIFramework.AIFwBTPrintString
// 0x0028 (0x0068 - 0x0040)
class UAIFwBTPrintString final : public UAIFwBTNode
{
public:
	struct FAIFwBTNodePropertyString              String;                                            // 0x0040(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bPrintToScreen;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintToLog;                                       // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A82[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTPrintString">();
	}
	static class UAIFwBTPrintString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTPrintString>();
	}
};
static_assert(alignof(UAIFwBTPrintString) == 0x000008, "Wrong alignment on UAIFwBTPrintString");
static_assert(sizeof(UAIFwBTPrintString) == 0x000068, "Wrong size on UAIFwBTPrintString");
static_assert(offsetof(UAIFwBTPrintString, String) == 0x000040, "Member 'UAIFwBTPrintString::String' has a wrong offset!");
static_assert(offsetof(UAIFwBTPrintString, bPrintToScreen) == 0x000060, "Member 'UAIFwBTPrintString::bPrintToScreen' has a wrong offset!");
static_assert(offsetof(UAIFwBTPrintString, bPrintToLog) == 0x000061, "Member 'UAIFwBTPrintString::bPrintToLog' has a wrong offset!");
static_assert(offsetof(UAIFwBTPrintString, Duration) == 0x000064, "Member 'UAIFwBTPrintString::Duration' has a wrong offset!");

// Class AIFramework.AIFwBTRunAITask
// 0x0028 (0x0068 - 0x0040)
class UAIFwBTRunAITask : public UAIFwBTNode
{
public:
	uint8                                         Pad_1A83[0x8];                                     // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAITask>                    TaskClass;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyBool                bNonBlocking;                                      // 0x0050(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTRunAITask">();
	}
	static class UAIFwBTRunAITask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTRunAITask>();
	}
};
static_assert(alignof(UAIFwBTRunAITask) == 0x000008, "Wrong alignment on UAIFwBTRunAITask");
static_assert(sizeof(UAIFwBTRunAITask) == 0x000068, "Wrong size on UAIFwBTRunAITask");
static_assert(offsetof(UAIFwBTRunAITask, TaskClass) == 0x000048, "Member 'UAIFwBTRunAITask::TaskClass' has a wrong offset!");
static_assert(offsetof(UAIFwBTRunAITask, bNonBlocking) == 0x000050, "Member 'UAIFwBTRunAITask::bNonBlocking' has a wrong offset!");

// Class AIFramework.AIFwBTRunHTNPlan
// 0x0010 (0x0050 - 0x0040)
class UAIFwBTRunHTNPlan final : public UAIFwBTNode
{
public:
	class FString                                 TaskName;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTRunHTNPlan">();
	}
	static class UAIFwBTRunHTNPlan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTRunHTNPlan>();
	}
};
static_assert(alignof(UAIFwBTRunHTNPlan) == 0x000008, "Wrong alignment on UAIFwBTRunHTNPlan");
static_assert(sizeof(UAIFwBTRunHTNPlan) == 0x000050, "Wrong size on UAIFwBTRunHTNPlan");
static_assert(offsetof(UAIFwBTRunHTNPlan, TaskName) == 0x000040, "Member 'UAIFwBTRunHTNPlan::TaskName' has a wrong offset!");

// Class AIFramework.AIFwBTRunPerceptionTree
// 0x0048 (0x0088 - 0x0040)
class UAIFwBTRunPerceptionTree : public UAIFwBTNode
{
public:
	class UAIFwBehaviorTree*                      PerceptionTree;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAIFwBTNodePropertyString              BlackboardKey;                                     // 0x0048(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	EAIFwPTRunMode                                RunMode;                                           // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A84[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIFwBTNodePropertyInt                 MaxCount;                                          // 0x0070(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTRunPerceptionTree">();
	}
	static class UAIFwBTRunPerceptionTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTRunPerceptionTree>();
	}
};
static_assert(alignof(UAIFwBTRunPerceptionTree) == 0x000008, "Wrong alignment on UAIFwBTRunPerceptionTree");
static_assert(sizeof(UAIFwBTRunPerceptionTree) == 0x000088, "Wrong size on UAIFwBTRunPerceptionTree");
static_assert(offsetof(UAIFwBTRunPerceptionTree, PerceptionTree) == 0x000040, "Member 'UAIFwBTRunPerceptionTree::PerceptionTree' has a wrong offset!");
static_assert(offsetof(UAIFwBTRunPerceptionTree, BlackboardKey) == 0x000048, "Member 'UAIFwBTRunPerceptionTree::BlackboardKey' has a wrong offset!");
static_assert(offsetof(UAIFwBTRunPerceptionTree, RunMode) == 0x000068, "Member 'UAIFwBTRunPerceptionTree::RunMode' has a wrong offset!");
static_assert(offsetof(UAIFwBTRunPerceptionTree, MaxCount) == 0x000070, "Member 'UAIFwBTRunPerceptionTree::MaxCount' has a wrong offset!");

// Class AIFramework.AIFwBTService_ReactiveSkill
// 0x0010 (0x0080 - 0x0070)
class UAIFwBTService_ReactiveSkill final : public UBTService
{
public:
	class FName                                   SkillTag;                                          // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bEnable : 1;                                       // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1A85[0x7];                                     // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTService_ReactiveSkill">();
	}
	static class UAIFwBTService_ReactiveSkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTService_ReactiveSkill>();
	}
};
static_assert(alignof(UAIFwBTService_ReactiveSkill) == 0x000008, "Wrong alignment on UAIFwBTService_ReactiveSkill");
static_assert(sizeof(UAIFwBTService_ReactiveSkill) == 0x000080, "Wrong size on UAIFwBTService_ReactiveSkill");
static_assert(offsetof(UAIFwBTService_ReactiveSkill, SkillTag) == 0x000070, "Member 'UAIFwBTService_ReactiveSkill::SkillTag' has a wrong offset!");

// Class AIFramework.AIFwBTService_RunPerceptionTree
// 0x0010 (0x00A8 - 0x0098)
class UAIFwBTService_RunPerceptionTree final : public UBTService_BlackboardBase
{
public:
	class UAIFwBehaviorTree*                      PerceptionTree;                                    // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClearBBValueWhenFailed;                           // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A86[0x7];                                     // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTService_RunPerceptionTree">();
	}
	static class UAIFwBTService_RunPerceptionTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTService_RunPerceptionTree>();
	}
};
static_assert(alignof(UAIFwBTService_RunPerceptionTree) == 0x000008, "Wrong alignment on UAIFwBTService_RunPerceptionTree");
static_assert(sizeof(UAIFwBTService_RunPerceptionTree) == 0x0000A8, "Wrong size on UAIFwBTService_RunPerceptionTree");
static_assert(offsetof(UAIFwBTService_RunPerceptionTree, PerceptionTree) == 0x000098, "Member 'UAIFwBTService_RunPerceptionTree::PerceptionTree' has a wrong offset!");
static_assert(offsetof(UAIFwBTService_RunPerceptionTree, bClearBBValueWhenFailed) == 0x0000A0, "Member 'UAIFwBTService_RunPerceptionTree::bClearBBValueWhenFailed' has a wrong offset!");

// Class AIFramework.AIFwBTTask_RunHTNPlan
// 0x0010 (0x0080 - 0x0070)
class UAIFwBTTask_RunHTNPlan final : public UBTTaskNode
{
public:
	class FString                                 TaskName;                                          // 0x0070(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTTask_RunHTNPlan">();
	}
	static class UAIFwBTTask_RunHTNPlan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTTask_RunHTNPlan>();
	}
};
static_assert(alignof(UAIFwBTTask_RunHTNPlan) == 0x000008, "Wrong alignment on UAIFwBTTask_RunHTNPlan");
static_assert(sizeof(UAIFwBTTask_RunHTNPlan) == 0x000080, "Wrong size on UAIFwBTTask_RunHTNPlan");
static_assert(offsetof(UAIFwBTTask_RunHTNPlan, TaskName) == 0x000070, "Member 'UAIFwBTTask_RunHTNPlan::TaskName' has a wrong offset!");

// Class AIFramework.AIFwBTTask_RunPerceptionTree
// 0x0008 (0x00A0 - 0x0098)
class UAIFwBTTask_RunPerceptionTree final : public UBTTask_BlackboardBase
{
public:
	class UAIFwBehaviorTree*                      PerceptionTree;                                    // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTTask_RunPerceptionTree">();
	}
	static class UAIFwBTTask_RunPerceptionTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTTask_RunPerceptionTree>();
	}
};
static_assert(alignof(UAIFwBTTask_RunPerceptionTree) == 0x000008, "Wrong alignment on UAIFwBTTask_RunPerceptionTree");
static_assert(sizeof(UAIFwBTTask_RunPerceptionTree) == 0x0000A0, "Wrong size on UAIFwBTTask_RunPerceptionTree");
static_assert(offsetof(UAIFwBTTask_RunPerceptionTree, PerceptionTree) == 0x000098, "Member 'UAIFwBTTask_RunPerceptionTree::PerceptionTree' has a wrong offset!");

// Class AIFramework.AIFwBTTask_UseSmartObject
// 0x0010 (0x00A8 - 0x0098)
class UAIFwBTTask_UseSmartObject final : public UBTTask_BlackboardBase
{
public:
	class FString                                 Usage;                                             // 0x0098(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTTask_UseSmartObject">();
	}
	static class UAIFwBTTask_UseSmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTTask_UseSmartObject>();
	}
};
static_assert(alignof(UAIFwBTTask_UseSmartObject) == 0x000008, "Wrong alignment on UAIFwBTTask_UseSmartObject");
static_assert(sizeof(UAIFwBTTask_UseSmartObject) == 0x0000A8, "Wrong size on UAIFwBTTask_UseSmartObject");
static_assert(offsetof(UAIFwBTTask_UseSmartObject, Usage) == 0x000098, "Member 'UAIFwBTTask_UseSmartObject::Usage' has a wrong offset!");

// Class AIFramework.AIFwBTTeleportTo
// 0x0028 (0x0068 - 0x0040)
class UAIFwBTTeleportTo final : public UAIFwBTNode
{
public:
	uint8                                         Pad_1A87[0x8];                                     // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIFwBTNodePropertyString              BlackboardKey;                                     // 0x0048(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTTeleportTo">();
	}
	static class UAIFwBTTeleportTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTTeleportTo>();
	}
};
static_assert(alignof(UAIFwBTTeleportTo) == 0x000008, "Wrong alignment on UAIFwBTTeleportTo");
static_assert(sizeof(UAIFwBTTeleportTo) == 0x000068, "Wrong size on UAIFwBTTeleportTo");
static_assert(offsetof(UAIFwBTTeleportTo, BlackboardKey) == 0x000048, "Member 'UAIFwBTTeleportTo::BlackboardKey' has a wrong offset!");

// Class AIFramework.AIFwBTToggleReactiveSkill
// 0x0010 (0x0048 - 0x0038)
class UAIFwBTToggleReactiveSkill final : public UAIFwBTDecoratorNode
{
public:
	class FName                                   SkillTag;                                          // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A88[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwBTToggleReactiveSkill">();
	}
	static class UAIFwBTToggleReactiveSkill* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwBTToggleReactiveSkill>();
	}
};
static_assert(alignof(UAIFwBTToggleReactiveSkill) == 0x000008, "Wrong alignment on UAIFwBTToggleReactiveSkill");
static_assert(sizeof(UAIFwBTToggleReactiveSkill) == 0x000048, "Wrong size on UAIFwBTToggleReactiveSkill");
static_assert(offsetof(UAIFwBTToggleReactiveSkill, SkillTag) == 0x000038, "Member 'UAIFwBTToggleReactiveSkill::SkillTag' has a wrong offset!");
static_assert(offsetof(UAIFwBTToggleReactiveSkill, bEnable) == 0x000040, "Member 'UAIFwBTToggleReactiveSkill::bEnable' has a wrong offset!");

// Class AIFramework.AIFwEntityComponent
// 0x0008 (0x00C0 - 0x00B8)
class UAIFwEntityComponent final : public UActorComponent
{
public:
	uint8                                         Pad_1A89[0x8];                                     // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwEntityComponent">();
	}
	static class UAIFwEntityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwEntityComponent>();
	}
};
static_assert(alignof(UAIFwEntityComponent) == 0x000008, "Wrong alignment on UAIFwEntityComponent");
static_assert(sizeof(UAIFwEntityComponent) == 0x0000C0, "Wrong size on UAIFwEntityComponent");

// Class AIFramework.AIFwFactionComponent
// 0x0040 (0x00F8 - 0x00B8)
class UAIFwFactionComponent final : public UActorComponent
{
public:
	uint8                                         Pad_1A8A[0x10];                                    // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FactionNameString;                                 // 0x00C8(0x0010)(Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FactionName;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8B[0x18];                                    // 0x00E0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_FactionNameString();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwFactionComponent">();
	}
	static class UAIFwFactionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwFactionComponent>();
	}
};
static_assert(alignof(UAIFwFactionComponent) == 0x000008, "Wrong alignment on UAIFwFactionComponent");
static_assert(sizeof(UAIFwFactionComponent) == 0x0000F8, "Wrong size on UAIFwFactionComponent");
static_assert(offsetof(UAIFwFactionComponent, FactionNameString) == 0x0000C8, "Member 'UAIFwFactionComponent::FactionNameString' has a wrong offset!");
static_assert(offsetof(UAIFwFactionComponent, FactionName) == 0x0000D8, "Member 'UAIFwFactionComponent::FactionName' has a wrong offset!");

// Class AIFramework.AIFwHierarchyComponent
// 0x0018 (0x00D0 - 0x00B8)
class UAIFwHierarchyComponent : public UActorComponent
{
public:
	class UAIFwHierarchyComponent*                Parent;                                            // 0x00B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAIFwHierarchyComponent*>        Children;                                          // 0x00C0(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	bool Add(class AActor* Actor);
	bool Remove(class AActor* Actor);
	void SendMessageToChildren(class FName Message, class UObject* MessageSource, bool bSuccess, class AActor* IgnoreActor);
	void SendMessageToParent(class FName Message, class UObject* MessageSource, bool bSuccess);
	void SendMessageToSiblings(class FName Message, class UObject* MessageSource, bool bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AIFwHierarchyComponent">();
	}
	static class UAIFwHierarchyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIFwHierarchyComponent>();
	}
};
static_assert(alignof(UAIFwHierarchyComponent) == 0x000008, "Wrong alignment on UAIFwHierarchyComponent");
static_assert(sizeof(UAIFwHierarchyComponent) == 0x0000D0, "Wrong size on UAIFwHierarchyComponent");
static_assert(offsetof(UAIFwHierarchyComponent, Parent) == 0x0000B8, "Member 'UAIFwHierarchyComponent::Parent' has a wrong offset!");
static_assert(offsetof(UAIFwHierarchyComponent, Children) == 0x0000C0, "Member 'UAIFwHierarchyComponent::Children' has a wrong offset!");

