#pragma once

 

// Package: AIFramework

#include "Basic.hpp"

#include "AIFramework_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AIFramework.AIFwBlueprintLibrary.ClothoidInterp
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlueprintLibrary_ClothoidInterp final
{
public:
	struct FVector2D                              StartPosition;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPosition;                                       // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAngle;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwClothoidSegment                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_ClothoidInterp) == 0x000004, "Wrong alignment on AIFwBlueprintLibrary_ClothoidInterp");
static_assert(sizeof(AIFwBlueprintLibrary_ClothoidInterp) == 0x000030, "Wrong size on AIFwBlueprintLibrary_ClothoidInterp");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterp, StartPosition) == 0x000000, "Member 'AIFwBlueprintLibrary_ClothoidInterp::StartPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterp, StartAngle) == 0x000008, "Member 'AIFwBlueprintLibrary_ClothoidInterp::StartAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterp, EndPosition) == 0x00000C, "Member 'AIFwBlueprintLibrary_ClothoidInterp::EndPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterp, EndAngle) == 0x000014, "Member 'AIFwBlueprintLibrary_ClothoidInterp::EndAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterp, ReturnValue) == 0x000018, "Member 'AIFwBlueprintLibrary_ClothoidInterp::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.ClothoidInterpRad
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlueprintLibrary_ClothoidInterpRad final
{
public:
	struct FVector2D                              StartPosition;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPosition;                                       // 0x000C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAngle;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwClothoidSegment                   ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_ClothoidInterpRad) == 0x000004, "Wrong alignment on AIFwBlueprintLibrary_ClothoidInterpRad");
static_assert(sizeof(AIFwBlueprintLibrary_ClothoidInterpRad) == 0x000030, "Wrong size on AIFwBlueprintLibrary_ClothoidInterpRad");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterpRad, StartPosition) == 0x000000, "Member 'AIFwBlueprintLibrary_ClothoidInterpRad::StartPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterpRad, StartAngle) == 0x000008, "Member 'AIFwBlueprintLibrary_ClothoidInterpRad::StartAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterpRad, EndPosition) == 0x00000C, "Member 'AIFwBlueprintLibrary_ClothoidInterpRad::EndPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterpRad, EndAngle) == 0x000014, "Member 'AIFwBlueprintLibrary_ClothoidInterpRad::EndAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_ClothoidInterpRad, ReturnValue) == 0x000018, "Member 'AIFwBlueprintLibrary_ClothoidInterpRad::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.GetAIDirector
// 0x0010 (0x0010 - 0x0000)
struct AIFwBlueprintLibrary_GetAIDirector final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AAIFwAIDirector*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_GetAIDirector) == 0x000008, "Wrong alignment on AIFwBlueprintLibrary_GetAIDirector");
static_assert(sizeof(AIFwBlueprintLibrary_GetAIDirector) == 0x000010, "Wrong size on AIFwBlueprintLibrary_GetAIDirector");
static_assert(offsetof(AIFwBlueprintLibrary_GetAIDirector, WorldContextObject) == 0x000000, "Member 'AIFwBlueprintLibrary_GetAIDirector::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetAIDirector, ReturnValue) == 0x000008, "Member 'AIFwBlueprintLibrary_GetAIDirector::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.GetAIFwBlackboard
// 0x0010 (0x0010 - 0x0000)
struct AIFwBlueprintLibrary_GetAIFwBlackboard final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwBlackboardComponent*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_GetAIFwBlackboard) == 0x000008, "Wrong alignment on AIFwBlueprintLibrary_GetAIFwBlackboard");
static_assert(sizeof(AIFwBlueprintLibrary_GetAIFwBlackboard) == 0x000010, "Wrong size on AIFwBlueprintLibrary_GetAIFwBlackboard");
static_assert(offsetof(AIFwBlueprintLibrary_GetAIFwBlackboard, Target) == 0x000000, "Member 'AIFwBlueprintLibrary_GetAIFwBlackboard::Target' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetAIFwBlackboard, ReturnValue) == 0x000008, "Member 'AIFwBlueprintLibrary_GetAIFwBlackboard::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.GetClothoidLocationAtTime
// 0x0024 (0x0024 - 0x0000)
struct AIFwBlueprintLibrary_GetClothoidLocationAtTime final
{
public:
	struct FAIFwClothoidSegment                   Segment;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x001C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_GetClothoidLocationAtTime) == 0x000004, "Wrong alignment on AIFwBlueprintLibrary_GetClothoidLocationAtTime");
static_assert(sizeof(AIFwBlueprintLibrary_GetClothoidLocationAtTime) == 0x000024, "Wrong size on AIFwBlueprintLibrary_GetClothoidLocationAtTime");
static_assert(offsetof(AIFwBlueprintLibrary_GetClothoidLocationAtTime, Segment) == 0x000000, "Member 'AIFwBlueprintLibrary_GetClothoidLocationAtTime::Segment' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetClothoidLocationAtTime, Time) == 0x000018, "Member 'AIFwBlueprintLibrary_GetClothoidLocationAtTime::Time' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetClothoidLocationAtTime, ReturnValue) == 0x00001C, "Member 'AIFwBlueprintLibrary_GetClothoidLocationAtTime::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.GetFactionRelation
// 0x0018 (0x0018 - 0x0000)
struct AIFwBlueprintLibrary_GetFactionRelation final
{
public:
	class AActor*                                 From;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 To;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4F[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlueprintLibrary_GetFactionRelation) == 0x000008, "Wrong alignment on AIFwBlueprintLibrary_GetFactionRelation");
static_assert(sizeof(AIFwBlueprintLibrary_GetFactionRelation) == 0x000018, "Wrong size on AIFwBlueprintLibrary_GetFactionRelation");
static_assert(offsetof(AIFwBlueprintLibrary_GetFactionRelation, From) == 0x000000, "Member 'AIFwBlueprintLibrary_GetFactionRelation::From' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetFactionRelation, To) == 0x000008, "Member 'AIFwBlueprintLibrary_GetFactionRelation::To' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetFactionRelation, ReturnValue) == 0x000010, "Member 'AIFwBlueprintLibrary_GetFactionRelation::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.GetMultipleClothoidLocationAtTime
// 0x0044 (0x0044 - 0x0000)
struct AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime final
{
public:
	struct FAIFwMultipleClothoidSegment           Segment;                                           // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x003C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime) == 0x000004, "Wrong alignment on AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime");
static_assert(sizeof(AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime) == 0x000044, "Wrong size on AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime");
static_assert(offsetof(AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime, Segment) == 0x000000, "Member 'AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime::Segment' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime, Time) == 0x000038, "Member 'AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime::Time' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime, ReturnValue) == 0x00003C, "Member 'AIFwBlueprintLibrary_GetMultipleClothoidLocationAtTime::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.Hash32
// 0x0018 (0x0018 - 0x0000)
struct AIFwBlueprintLibrary_Hash32 final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A50[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlueprintLibrary_Hash32) == 0x000008, "Wrong alignment on AIFwBlueprintLibrary_Hash32");
static_assert(sizeof(AIFwBlueprintLibrary_Hash32) == 0x000018, "Wrong size on AIFwBlueprintLibrary_Hash32");
static_assert(offsetof(AIFwBlueprintLibrary_Hash32, String) == 0x000000, "Member 'AIFwBlueprintLibrary_Hash32::String' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_Hash32, ReturnValue) == 0x000010, "Member 'AIFwBlueprintLibrary_Hash32::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.MultipleClothoidInterp
// 0x0058 (0x0058 - 0x0000)
struct AIFwBlueprintLibrary_MultipleClothoidInterp final
{
public:
	struct FVector2D                              StartPosition;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartCurvature;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPosition;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAngle;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndCurvature;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwMultipleClothoidSegment           ReturnValue;                                       // 0x0020(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_MultipleClothoidInterp) == 0x000004, "Wrong alignment on AIFwBlueprintLibrary_MultipleClothoidInterp");
static_assert(sizeof(AIFwBlueprintLibrary_MultipleClothoidInterp) == 0x000058, "Wrong size on AIFwBlueprintLibrary_MultipleClothoidInterp");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, StartPosition) == 0x000000, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::StartPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, StartAngle) == 0x000008, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::StartAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, StartCurvature) == 0x00000C, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::StartCurvature' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, EndPosition) == 0x000010, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::EndPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, EndAngle) == 0x000018, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::EndAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, EndCurvature) == 0x00001C, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::EndCurvature' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterp, ReturnValue) == 0x000020, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterp::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.MultipleClothoidInterpRad
// 0x0058 (0x0058 - 0x0000)
struct AIFwBlueprintLibrary_MultipleClothoidInterpRad final
{
public:
	struct FVector2D                              StartPosition;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAngle;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartCurvature;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndPosition;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAngle;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndCurvature;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwMultipleClothoidSegment           ReturnValue;                                       // 0x0020(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlueprintLibrary_MultipleClothoidInterpRad) == 0x000004, "Wrong alignment on AIFwBlueprintLibrary_MultipleClothoidInterpRad");
static_assert(sizeof(AIFwBlueprintLibrary_MultipleClothoidInterpRad) == 0x000058, "Wrong size on AIFwBlueprintLibrary_MultipleClothoidInterpRad");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, StartPosition) == 0x000000, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::StartPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, StartAngle) == 0x000008, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::StartAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, StartCurvature) == 0x00000C, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::StartCurvature' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, EndPosition) == 0x000010, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::EndPosition' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, EndAngle) == 0x000018, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::EndAngle' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, EndCurvature) == 0x00001C, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::EndCurvature' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_MultipleClothoidInterpRad, ReturnValue) == 0x000020, "Member 'AIFwBlueprintLibrary_MultipleClothoidInterpRad::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlueprintLibrary.RunAIFwBehaviorTree
// 0x0018 (0x0018 - 0x0000)
struct AIFwBlueprintLibrary_RunAIFwBehaviorTree final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwBehaviorTree*                      BehaviorTree;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A51[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlueprintLibrary_RunAIFwBehaviorTree) == 0x000008, "Wrong alignment on AIFwBlueprintLibrary_RunAIFwBehaviorTree");
static_assert(sizeof(AIFwBlueprintLibrary_RunAIFwBehaviorTree) == 0x000018, "Wrong size on AIFwBlueprintLibrary_RunAIFwBehaviorTree");
static_assert(offsetof(AIFwBlueprintLibrary_RunAIFwBehaviorTree, Target) == 0x000000, "Member 'AIFwBlueprintLibrary_RunAIFwBehaviorTree::Target' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_RunAIFwBehaviorTree, BehaviorTree) == 0x000008, "Member 'AIFwBlueprintLibrary_RunAIFwBehaviorTree::BehaviorTree' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_RunAIFwBehaviorTree, bLooping) == 0x000010, "Member 'AIFwBlueprintLibrary_RunAIFwBehaviorTree::bLooping' has a wrong offset!");
static_assert(offsetof(AIFwBlueprintLibrary_RunAIFwBehaviorTree, ReturnValue) == 0x000011, "Member 'AIFwBlueprintLibrary_RunAIFwBehaviorTree::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwAIDirector.ReceiveOnActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct AIFwAIDirector_ReceiveOnActorSpawned final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwAIDirector_ReceiveOnActorSpawned) == 0x000008, "Wrong alignment on AIFwAIDirector_ReceiveOnActorSpawned");
static_assert(sizeof(AIFwAIDirector_ReceiveOnActorSpawned) == 0x000008, "Wrong size on AIFwAIDirector_ReceiveOnActorSpawned");
static_assert(offsetof(AIFwAIDirector_ReceiveOnActorSpawned, SpawnedActor) == 0x000000, "Member 'AIFwAIDirector_ReceiveOnActorSpawned::SpawnedActor' has a wrong offset!");

// Function AIFramework.AIFwPerceptionComponent.SetSenseEnabled
// 0x0018 (0x0018 - 0x0000)
struct AIFwPerceptionComponent_SetSenseEnabled final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A56[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwPerceptionComponent_SetSenseEnabled) == 0x000008, "Wrong alignment on AIFwPerceptionComponent_SetSenseEnabled");
static_assert(sizeof(AIFwPerceptionComponent_SetSenseEnabled) == 0x000018, "Wrong size on AIFwPerceptionComponent_SetSenseEnabled");
static_assert(offsetof(AIFwPerceptionComponent_SetSenseEnabled, Tag) == 0x000000, "Member 'AIFwPerceptionComponent_SetSenseEnabled::Tag' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionComponent_SetSenseEnabled, bEnabled) == 0x000010, "Member 'AIFwPerceptionComponent_SetSenseEnabled::bEnabled' has a wrong offset!");

// Function AIFramework.AIFwPerceptionComponent.GetSensedActors
// 0x0020 (0x0020 - 0x0000)
struct AIFwPerceptionComponent_GetSensedActors final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionComponent_GetSensedActors) == 0x000008, "Wrong alignment on AIFwPerceptionComponent_GetSensedActors");
static_assert(sizeof(AIFwPerceptionComponent_GetSensedActors) == 0x000020, "Wrong size on AIFwPerceptionComponent_GetSensedActors");
static_assert(offsetof(AIFwPerceptionComponent_GetSensedActors, Tag) == 0x000000, "Member 'AIFwPerceptionComponent_GetSensedActors::Tag' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionComponent_GetSensedActors, ReturnValue) == 0x000010, "Member 'AIFwPerceptionComponent_GetSensedActors::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionComponent.GetSensedActorsCount
// 0x0004 (0x0004 - 0x0000)
struct AIFwPerceptionComponent_GetSensedActorsCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionComponent_GetSensedActorsCount) == 0x000004, "Wrong alignment on AIFwPerceptionComponent_GetSensedActorsCount");
static_assert(sizeof(AIFwPerceptionComponent_GetSensedActorsCount) == 0x000004, "Wrong size on AIFwPerceptionComponent_GetSensedActorsCount");
static_assert(offsetof(AIFwPerceptionComponent_GetSensedActorsCount, ReturnValue) == 0x000000, "Member 'AIFwPerceptionComponent_GetSensedActorsCount::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.RunInstantParameterizedPerceptionTree
// 0x0030 (0x0030 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwParameterizedBTRequest            Query;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         MaxCount;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A59[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIFwPerceptionTreeInstanceBlueprintWrapper* ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree) == 0x000030, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree, Target) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree::Target' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree, Query) == 0x000008, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree::Query' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree, MaxCount) == 0x000020, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree::MaxCount' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree, ReturnValue) == 0x000028, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTree::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.RunInstantParameterizedPerceptionTreeRandom
// 0x0030 (0x0030 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwParameterizedBTRequest            Query;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         MaxCount;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIFwPerceptionTreeInstanceBlueprintWrapper* ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom) == 0x000030, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom, Target) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom::Target' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom, Query) == 0x000008, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom::Query' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom, MaxCount) == 0x000020, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom::MaxCount' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom, ReturnValue) == 0x000028, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantParameterizedPerceptionTreeRandom::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.RunInstantPerceptionTree
// 0x0018 (0x0018 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwBehaviorTree*                      Template;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwPerceptionTreeInstanceBlueprintWrapper* ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree) == 0x000018, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree, Target) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree::Target' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree, Template) == 0x000008, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree::Template' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree, ReturnValue) == 0x000010, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunInstantPerceptionTree::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.RunPerceptionTree
// 0x0018 (0x0018 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwBehaviorTree*                      Template;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwPerceptionTreeInstanceBlueprintWrapper* ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree) == 0x000018, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree, Target) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree::Target' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree, Template) == 0x000008, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree::Template' has a wrong offset!");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree, ReturnValue) == 0x000010, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_RunPerceptionTree::ReturnValue' has a wrong offset!");

// DelegateFunction AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature final
{
public:
	class UAIFwPerceptionTreeInstanceBlueprintWrapper* QueryInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature) == 0x000008, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature, QueryInstance) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_AIFwOnPerceptionTreeFinishedWrapper__DelegateSignature::QueryInstance' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.GetResultCount
// 0x0004 (0x0004 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount) == 0x000004, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount) == 0x000004, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount, ReturnValue) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultCount::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.GetResultsAsActors
// 0x0010 (0x0010 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors) == 0x000010, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors, ReturnValue) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsActors::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwPerceptionTreeInstanceBlueprintWrapper.GetResultsAsLocations
// 0x0010 (0x0010 - 0x0000)
struct AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations) == 0x000008, "Wrong alignment on AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations");
static_assert(sizeof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations) == 0x000010, "Wrong size on AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations");
static_assert(offsetof(AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations, ReturnValue) == 0x000000, "Member 'AIFwPerceptionTreeInstanceBlueprintWrapper_GetResultsAsLocations::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.ClearValue
// 0x0028 (0x0028 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_ClearValue final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_ClearValue) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_ClearValue");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_ClearValue) == 0x000028, "Wrong size on AIFwBlackboardBlueprintLibrary_ClearValue");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_ClearValue, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_ClearValue::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_ClearValue, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_ClearValue::KeyName' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsBool
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsBool final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5B[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsBool) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsBool");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsBool) == 0x000030, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsBool");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsBool, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsBool::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsBool, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsBool::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsBool, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsBool::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsClass
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsClass final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsClass) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsClass");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsClass) == 0x000030, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsClass");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsClass, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsClass::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsClass, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsClass::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsClass, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsClass::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsFloat
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsFloat final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5C[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsFloat) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsFloat");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsFloat) == 0x000030, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsFloat");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsFloat, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsFloat::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsFloat, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsFloat::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsFloat, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsFloat::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsInt
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsInt final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5D[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsInt) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsInt");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsInt) == 0x000030, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsInt");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsInt, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsInt::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsInt, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsInt::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsInt, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsInt::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsName
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsName final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsName) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsName");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsName) == 0x000030, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsName");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsName, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsName::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsName, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsName::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsName, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsName::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsObject
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsObject final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsObject) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsObject");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsObject) == 0x000030, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsObject");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsObject, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsObject::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsObject, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsObject::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsObject, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsObject::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsObjectArray
// 0x0038 (0x0038 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray) == 0x000038, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsObjectArray::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsString
// 0x0038 (0x0038 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsString final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsString) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsString");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsString) == 0x000038, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsString");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsString, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsString::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsString, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsString::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsString, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsString::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsVector
// 0x0038 (0x0038 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsVector final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5E[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsVector) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsVector");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsVector) == 0x000038, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsVector");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsVector, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsVector::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsVector, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsVector::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsVector, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsVector::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.GetValueAsVectorArray
// 0x0038 (0x0038 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray) == 0x000008, "Wrong alignment on AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray");
static_assert(sizeof(AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray) == 0x000038, "Wrong size on AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray, Blackboard) == 0x000000, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray::Blackboard' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray, KeyName) == 0x000018, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray::KeyName' has a wrong offset!");
static_assert(offsetof(AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray, ReturnValue) == 0x000028, "Member 'AIFwBlackboardBlueprintLibrary_GetValueAsVectorArray::ReturnValue' has a wrong offset!");

// Function AIFramework.AIFwBlackboardBlueprintLibrary.IsValidKey
// 0x0030 (0x0030 - 0x0000)
struct AIFwBlackboardBlueprintLibrary_IsValidKey final
{
public:
	struct FAIFwBlackboard                        Blackboard;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 KeyName;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A5F[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
