#pragma once

 

// Package: BP_BattleHUD

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_TutorialExtendData_structs.hpp"
#include "ST_TutorialExtendDataMain_structs.hpp"
#include "EKeyGuideType_structs.hpp"


namespace SDK::Params
{

// Function BP_BattleHUD.BP_BattleHUD_C.ExecuteUbergraph_BP_BattleHUD
// 0x06B0 (0x06B0 - 0x0000)
struct BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5208[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5209[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsSBBattle_Contents_HUD;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_520A[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBBattleContentsHUD*                   CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_520B[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBUIType InUIType, bool bInVisibility, bool bInInstantly)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	ETimerHUDType                                 K2Node_Event_HUDType;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520C[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Level;                                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_520D[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_SkillType;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class USBChatMessage* Message, struct FSBChatUIMessage& Mess)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class URmShopMenu_C*                          K2Node_CustomEvent_InRmShop_1;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URmShopMenu_C*                          K2Node_CustomEvent_InRmShop;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_520E[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBSubMenuInterface>   K2Node_DynamicCast_AsSBSub_Menu_Interface;         // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_520F[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBDebugMenuType MenuType, class FName RowName)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5210[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_PlayerID;                             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Name_1;                               // 0x00D8(0x0018)()
	class FString                                 K2Node_Event_CharacterId;                          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESBPrivilegeType                              K2Node_Event_Privilege_Type;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bCheckUnlock;                         // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5211[0x1];                                     // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBInteractionInfo                     K2Node_Event_InteractionInfo;                      // 0x0104(0x0018)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5212[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDebugMenu_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x012F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5213[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHitIndicator_bValid;                   // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5214[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHitIndicator_C*                        CallFunc_GetHitIndicator_HitIndicator;             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5215[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FSBWarehouseAbilityNotifyUIInfo>& UIInfo)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5216[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerCharacter_C*                  K2Node_Event_InOtherPC;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_MemberName;                           // 0x0178(0x0018)()
	EKeyGuideType                                 K2Node_Event_InKeyGuideType_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5217[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EKeyGuideType                                 K2Node_Event_InKeyGuideType;                       // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5218[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_CreatedUserWidget;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMountShortcutIcon_C*                   K2Node_DynamicCast_AsMount_Shortcut_Icon;          // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5219[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Combo;                                // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521A[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_BattleHUD_C>      K2Node_DynamicCast_AsBPI_Battle_HUD;               // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521B[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521C[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InRespawnTime;                        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEditMode;                            // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetRespawnHUD_bValid;                     // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521D[0x1];                                     // 0x01EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class URespawnHUD_C*                          CallFunc_GetRespawnHUD_RespawnHUD;                 // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Event_InVisibility;                         // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          K2Node_Event_InSkillActionPosition;                // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InIsVisible;                          // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521E[0x1];                                     // 0x01FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_30;                   // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_31;                   // 0x0207(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_32;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_33;                   // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521F[0x6];                                     // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable_1;                             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsRm_Shop_Menu;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess_1;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_34;                   // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5220[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URmShopMenu_C*                          CallFunc_Create_ReturnValue_2;                     // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_35;                   // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5221[0x7];                                     // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5222[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWarehouseAbilityComponent*           CallFunc_GetWarehouseAbilityComponent_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_36;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5223[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBWarehouseAbilityNotifyUIInfo> K2Node_CustomEvent_UIInfo;                         // 0x0260(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5224[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded_1;                       // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USBWarehouseAbilityComponent*           CallFunc_GetWarehouseAbilityComponent_ReturnValue_1; // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_37;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5225[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_PlayerController_C> K2Node_DynamicCast_AsBPI_Player_Controller;        // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugFunction_IsValid;                 // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5226[0x6];                                     // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue;             // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSaveGameReturn                             CallFunc_LoadDebugSettings_ReturnValue;            // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5227[0x2];                                     // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBool_ReturnValue;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5228[0x3];                                     // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugFunction_IsValid_1;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5229[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_1;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugFunction_IsValid_2;               // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_522A[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_2;           // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBDebugMenuType                              K2Node_CustomEvent_MenuType;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522B[0x3];                                     // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_RowName;                        // 0x02FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InQuestIndex;                   // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InStepNo;                       // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelaySeconds;                   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStepCompleteText_OutText;              // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStepCompleteText_ReturnValue;          // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_522C[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InQuestId;                            // 0x0324(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522D[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0330(0x0018)()
	int32                                         K2Node_Event_InAchievementId;                      // 0x0348(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InTutorialHelpId;                     // 0x034C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerPassiveImagineSlotType               K2Node_Event_Slot;                                 // 0x0354(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522E[0x3];                                     // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Param_2;                        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGetMaterialEventParam*               K2Node_DynamicCast_AsSBGet_Material_Event_Param;   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_522F[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0370(0x0018)()
	ESBSeasonPassQuestCycleType                   K2Node_Event_InCycle;                              // 0x0388(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5230[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_QuestName;                            // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSBWarehouseAbilityNotifyUIInfo> K2Node_CustomEvent_InParam;                        // 0x03A0(0x0010)(ConstParm, ReferenceParm)
	ESBRecipeType                                 K2Node_Event_RecipeType;                           // 0x03B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5231[0x3];                                     // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RecepiId;                             // 0x03B4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBWarehouseAbilityNotifyUIInfo        CallFunc_Array_Get_Item;                           // 0x03B8(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5232[0x3];                                     // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NetworkCafeTotalTimePlayedToday;      // 0x03E0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoginTimeOnly;                     // 0x03E4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5233[0x3];                                     // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InMessage_2;                          // 0x03E8(0x0018)(ConstParm)
	class USBNetworkCafeMessageManager*           CallFunc_GetNetworkCafeMessageManager_ReturnValue; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBNetworkCafeReward>           CallFunc_GetRewards_OutRewards;                    // 0x0408(0x0010)(ReferenceParm)
	struct FSBNetworkCafeReward                   CallFunc_Array_Get_Item_1;                         // 0x0418(0x000C)(NoDestructor)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0424(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_MemberName;                     // 0x0438(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5234[0x7];                                     // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InMessage_1;                          // 0x0458(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InMessage;                            // 0x0470(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InMainMessage;                        // 0x0488(0x0018)(ConstParm)
	class FText                                   K2Node_Event_InSubMessage;                         // 0x04A0(0x0018)(ConstParm)
	int32                                         K2Node_Event_InItemID;                             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SizeX;                                // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SizeY;                                // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5235[0x4];                                     // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBChatMessage*                   K2Node_CustomEvent_Message;                        // 0x04D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBChatUIMessage                       K2Node_CustomEvent_Mess;                           // 0x04D8(0x0070)(ConstParm)
	class USBGameInstance*                        K2Node_DynamicCast_AsSBGame_Instance;              // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5236[0x6];                                     // 0x0552(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBChatMemberState*                     CallFunc_GetSenderMemberState_ReturnValue;         // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSenderCharacterId_ReturnValue;         // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_38;                   // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5237[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBBalloonWindowComponent*              CallFunc_GetComponentByClass_ReturnValue;          // 0x0590(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_39;                   // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_40;                   // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_41;                   // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x059B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5238[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5239[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOtherMessageComponent*               CallFunc_GetComponentByClass_ReturnValue_1;        // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGameInstance*                        K2Node_DynamicCast_AsSBGame_Instance_1;            // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_42;                   // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowRequest_ReturnValue;                  // 0x05D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523A[0x5];                                     // 0x05D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetValidPlayerState_ReturnValue;          // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterId_self_CastInput;            // 0x05F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_43;                   // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523B[0x6];                                     // 0x0612(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Sender_1;                       // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_1;                        // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBUpdateQuestProgressEventParam*       K2Node_DynamicCast_AsSBUpdate_Quest_Progress_Event_Param; // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523C[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x0648(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Name;                                 // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_44;                   // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523D[0x7];                                     // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBClassHudInterface>  CallFunc_RegistClassHud_self_CastInput;            // 0x0668(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_Event_TextId;                               // 0x0678(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBUIType                                     K2Node_CustomEvent_InUIType;                       // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisibility;                  // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInInstantly;                   // 0x0682(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0683(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0685(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_523E[0x2];                                     // 0x0686(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0688(0x0010)(ZeroConstructor, NoDestructor)
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue;         // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue_1;       // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_45;                   // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD) == 0x000008, "Wrong alignment on BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD");
static_assert(sizeof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD) == 0x0006B0, "Wrong size on BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, EntryPoint) == 0x000000, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, Temp_class_Variable) == 0x000008, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_HasAuthority_ReturnValue) == 0x000010, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_ClassDynamicCast_AsSBBattle_Contents_HUD) == 0x000018, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_ClassDynamicCast_AsSBBattle_Contents_HUD' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CustomEvent_Loaded) == 0x000030, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, Temp_byte_Variable) == 0x000038, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, Temp_byte_Variable_1) == 0x000039, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, Temp_bool_Variable) == 0x00003A, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_HUDType) == 0x00004C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_HUDType' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_Actor_1) == 0x000050, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_Level) == 0x000058, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_Level' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_SkillType) == 0x000060, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_SkillType' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CustomEvent_InRmShop_1) == 0x000080, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CustomEvent_InRmShop_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CustomEvent_InRmShop) == 0x000088, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CustomEvent_InRmShop' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_DynamicCast_AsSBSub_Menu_Interface) == 0x000098, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_DynamicCast_AsSBSub_Menu_Interface' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_2) == 0x0000A9, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_3) == 0x0000AA, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, Temp_int_Array_Index_Variable) == 0x0000AC, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_4) == 0x0000C0, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_PlayerID) == 0x0000C8, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_PlayerID' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_Name_1) == 0x0000D8, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_Name_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_CharacterId) == 0x0000F0, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_CharacterId' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_Privilege_Type) == 0x000100, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_Privilege_Type' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_5) == 0x000101, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_bCheckUnlock) == 0x000102, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_bCheckUnlock' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_InteractionInfo) == 0x000104, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_InteractionInfo' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_6) == 0x00011C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_Create_ReturnValue_1) == 0x000120, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_7) == 0x000128, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_8) == 0x000129, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_9) == 0x00012A, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_10) == 0x00012B, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_11) == 0x00012C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_12) == 0x00012D, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_13) == 0x00012E, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_14) == 0x00012F, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_15) == 0x000130, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_Actor) == 0x000138, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_HitLocation) == 0x000140, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_GetHitIndicator_bValid) == 0x00014C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_GetHitIndicator_bValid' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_GetHitIndicator_HitIndicator) == 0x000150, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_GetHitIndicator_HitIndicator' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_16) == 0x000158, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_CreateDelegate_OutputDelegate_3) == 0x00015C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_IsValid_ReturnValue_17) == 0x00016C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_InOtherPC) == 0x000170, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_InOtherPC' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_MemberName) == 0x000178, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_MemberName' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_InKeyGuideType_1) == 0x000190, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_InKeyGuideType_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, Temp_int_Loop_Counter_Variable) == 0x000194, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_Add_IntInt_ReturnValue) == 0x000198, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_InKeyGuideType) == 0x00019C, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_InKeyGuideType' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, CallFunc_GetWidget_CreatedUserWidget) == 0x0001A0, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::CallFunc_GetWidget_CreatedUserWidget' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_DynamicCast_AsMount_Shortcut_Icon) == 0x0001A8, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_DynamicCast_AsMount_Shortcut_Icon' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD, K2Node_Event_Combo) == 0x0001B4, "Member 'BP_BattleHUD_C_ExecuteUbergraph_BP_BattleHUD::K2Node_Event_Combo' has a wrong offset!");
