#pragma once

 

// Package: BP_DHCMeasurer

#include "Basic.hpp"

#include "ST_DHCStatus_structs.hpp"
#include "EN_DHCMessage_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EN_DHCStatus_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function BP_DHCMeasurer.BP_DHCMeasurer_C.DHC_StateChanged__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature final
{
public:
	EN_DHCStatus                                  DHCState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalPlayerJoined;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature");
static_assert(sizeof(BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature) == 0x000002, "Wrong size on BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature");
static_assert(offsetof(BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature, DHCState) == 0x000000, "Member 'BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature::DHCState' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature, LocalPlayerJoined) == 0x000001, "Member 'BP_DHCMeasurer_C_DHC_StateChanged__DelegateSignature::LocalPlayerJoined' has a wrong offset!");

// Function BP_DHCMeasurer.BP_DHCMeasurer_C.ExecuteUbergraph_BP_DHCMeasurer
// 0x06E0 (0x06E0 - 0x0000)
struct BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetFirstLocalPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559F[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A0[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A1[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A2[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Add_DateTimeTimespan_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A3[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A4[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Add_TimespanTimespan_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalMilliseconds_ReturnValue;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A5[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue_2;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A6[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55A7[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Add_DateTimeTimespan_ReturnValue_1;       // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A8[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue_1;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A9[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_Select_Default_1;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EN_DHCStatus                                  Temp_byte_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55AA[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue_3;                     // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_2;               // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_3;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55AB[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Add_DateTimeTimespan_ReturnValue_2;       // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_3;               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue_2;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55AC[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Add_DateTimeTimespan_ReturnValue_3;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55AD[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Select_Default_2;                           // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55AE[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     K2Node_CustomEvent_Other_Actor_1;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterPlayers_Initialized;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBAttribute                                  K2Node_CustomEvent_ElementType;                    // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue_3;             // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_4;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55AF[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Other_Actor;                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_View_Rotation;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class AActor* Other_Actor, const struct FRotator& View_Rotation)> K2Node_CreateDelegate_OutputDelegate;              // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_3;                             // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBAttribute ElementType)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ASBEnemyCharacter* DamagedActor, float Damage, struct FSBDamageEvent& DamageEvent, class AController* InstigatedBy, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B0[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_CuaseCharacter;                 // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B1[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBEnemyCharacter*                      K2Node_CustomEvent_DamagedActor;                   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B2[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBDamageEvent                         K2Node_CustomEvent_DamageEvent;                    // 0x01C8(0x01A0)(ConstParm, ContainsInstancedReference)
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerStatusRef_Index;                 // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B3[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_5;          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B4[0x3];                                     // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue_4;               // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EN_DHCMessage                                 K2Node_CustomEvent_Type;                           // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0397(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B5[0x7];                                     // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_Array_Get_Item;                           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B6[0x3];                                     // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_DHCStatus                          K2Node_MakeStruct_ST_DHCStatus;                    // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B7[0x4];                                     // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B8[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B9[0x6];                                     // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_UtcNow_ReturnValue_4;                     // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Add_DateTimeTimespan_ReturnValue_4;       // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_Select_Default_3;                           // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_4;                             // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BA[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue_1;  // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Add_TimespanTimespan_ReturnValue_1;       // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayerController*>              K2Node_CustomEvent_RegisterPlayers;                // 0x0418(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_GetTotalMilliseconds_ReturnValue_1;       // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BB[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_6;          // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_7;          // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55BC[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBBattleArea*                          Temp_object_Variable;                              // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0458(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55BD[0x3];                                     // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_5;                             // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_DHCStatus                                  Temp_byte_Variable_1;                              // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55BE[0x3];                                     // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_4;                           // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0480(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55BF[0x3];                                     // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0488(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x048C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_DHCMessage                                 Temp_byte_Variable_2;                              // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C0[0x7];                                     // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_5;                           // 0x04B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C1[0x3];                                     // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x04D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x04E0(0x0018)()
	bool                                          CallFunc_IsPlayInEditor_ReturnValue_4;             // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C2[0x6];                                     // 0x04FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              K2Node_CustomEvent_ExitMembers;                    // 0x0500(0x0010)(ConstParm, ReferenceParm)
	struct FDateTime                              K2Node_Select_Default_6;                           // 0x0510(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_8;          // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C3[0x7];                                     // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue_2;  // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Add_TimespanTimespan_ReturnValue_2;       // 0x0528(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalMilliseconds_ReturnValue_2;       // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C4[0x3];                                     // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_7;                           // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C5[0x3];                                     // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBBattleHUD*                           K2Node_DynamicCast_AsSBBattle_HUD;                 // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C6[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBBattleContentsHUD*                   CallFunc_GetBattleContentsHUD_ReturnValue;         // 0x0580(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBattleContentsHUD_C*                   K2Node_DynamicCast_AsBattle_Contents_HUD;          // 0x0590(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C7[0x7];                                     // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBBattleHUD*                           K2Node_DynamicCast_AsSBBattle_HUD_1;               // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C8[0x7];                                     // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBBattleContentsHUD*                   CallFunc_GetBattleContentsHUD_ReturnValue_1;       // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x05B8(0x0010)(ZeroConstructor, NoDestructor)
	class UBattleContentsHUD_C*                   K2Node_DynamicCast_AsBattle_Contents_HUD_1;        // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55C9[0x7];                                     // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCurrentHUD_ReturnValue;                // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDhcBattleHUD_C*                        K2Node_DynamicCast_AsDhc_Battle_HUD;               // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Invincible;                     // 0x05EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_3;                               // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Temp_object_Variable_1;                            // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_Array_Get_Item_1;                         // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55CA[0x4];                                     // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55CB[0x6];                                     // 0x0612(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_CustomEvent_PlayerCharacter;                // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Clear;                          // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55CC[0x7];                                     // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default_8;                           // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character_1;         // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55CD[0x7];                                     // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISBBattleParamInterface> K2Node_DynamicCast_AsSBBattle_Param_Interface;     // 0x0648(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55CE[0x7];                                     // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDhcBattleComponent*                  CallFunc_GetDhcBattleComponent_ReturnValue;        // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55CF[0x7];                                     // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBBattleParamInterface> CallFunc_SetBattleArea_self_CastInput;             // 0x0670(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBattleArea_ReturnValue;                // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55D0[0x3];                                     // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0684(0x0010)(ZeroConstructor, NoDestructor)
	float                                         Temp_float_Variable_6;                             // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_DHCStatus                                  Temp_byte_Variable_3;                              // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55D1[0x3];                                     // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_9;                           // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55D2[0x7];                                     // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBBattleArea*                          K2Node_Select_Default_10;                          // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetBattleArea_ReturnValue_1;              // 0x06B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x06B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55D3[0x1];                                     // 0x06B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x06B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x06C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer) == 0x000008, "Wrong alignment on BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer");
static_assert(sizeof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer) == 0x0006E0, "Wrong size on BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, EntryPoint) == 0x000000, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_GetFirstLocalPlayerController_ReturnValue) == 0x000008, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_GetFirstLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, K2Node_DynamicCast_AsSBPlayer_State) == 0x000010, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::K2Node_DynamicCast_AsSBPlayer_State' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_bool_Variable) == 0x000020, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_UtcNow_ReturnValue) == 0x000028, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_bool_Variable_1) == 0x000031, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_bool_Variable_2) == 0x000032, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsPlayInEditor_ReturnValue) == 0x000033, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsDedicatedServer_ReturnValue) == 0x000034, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Not_PreBool_ReturnValue) == 0x000035, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_bool_Variable_3) == 0x000036, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_BooleanAND_ReturnValue) == 0x000037, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_HasAuthority_ReturnValue_1) == 0x000038, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_float_Variable) == 0x00003C, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000040, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_BooleanAND_ReturnValue_1) == 0x000041, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_MakeTimespan_ReturnValue) == 0x000048, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_float_Variable_1) == 0x00005C, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_UtcNow_ReturnValue_1) == 0x000060, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_UtcNow_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_DateTimeTimespan_ReturnValue) == 0x000068, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_DateTimeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_HasAuthority_ReturnValue_2) == 0x000070, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, K2Node_Select_Default) == 0x000078, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000080, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_float_Variable_2) == 0x000088, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_TimespanTimespan_ReturnValue) == 0x000090, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_GetTotalMilliseconds_ReturnValue) == 0x000098, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_GetTotalMilliseconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_UtcNow_ReturnValue_2) == 0x0000A0, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_UtcNow_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_FTrunc_ReturnValue) == 0x0000A8, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_MakeTimespan_ReturnValue_1) == 0x0000B0, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_MakeTimespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000B8, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_DateTimeTimespan_ReturnValue_1) == 0x0000C0, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_DateTimeTimespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000C8, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_int_Loop_Counter_Variable_1) == 0x0000CC, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsPlayInEditor_ReturnValue_1) == 0x0000D0, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsPlayInEditor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_BooleanAND_ReturnValue_2) == 0x0000D1, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D4, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, K2Node_Select_Default_1) == 0x0000D8, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, Temp_byte_Variable) == 0x0000E0, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_UtcNow_ReturnValue_3) == 0x0000E8, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_UtcNow_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_MakeTimespan_ReturnValue_2) == 0x0000F0, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_MakeTimespan_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsDedicatedServer_ReturnValue_3) == 0x0000F8, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsDedicatedServer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_DateTimeTimespan_ReturnValue_2) == 0x000100, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_DateTimeTimespan_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_MakeTimespan_ReturnValue_3) == 0x000108, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_MakeTimespan_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsPlayInEditor_ReturnValue_2) == 0x000110, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsPlayInEditor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_Add_DateTimeTimespan_ReturnValue_3) == 0x000118, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_Add_DateTimeTimespan_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_BooleanAND_ReturnValue_3) == 0x000120, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, K2Node_Select_Default_2) == 0x000128, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer, K2Node_CustomEvent_Other_Actor_1) == 0x000138, "Member 'BP_DHCMeasurer_C_ExecuteUbergraph_BP_DHCMeasurer::K2Node_CustomEvent_Other_Actor_1' has a wrong offset!");
