#pragma once

 

// Package: BP_EF_BPSet_SpawnGround_Circle_Square

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square
// 0x0140 (0x0140 - 0x0000)
struct BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8836[0xB];                                     // 0x0025(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8837[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8838[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8839[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Divide_VectorVector_ReturnValue;          // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBEffectVisibleType                          CallFunc_GetEffectVisibleType_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_883A[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBSpawnEmitterAtLocationParam         K2Node_MakeStruct_SBSpawnEmitterAtLocationParam;   // 0x00F0(0x0048)(NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square) == 0x000010, "Wrong alignment on BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square");
static_assert(sizeof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square) == 0x000140, "Wrong size on BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, EntryPoint) == 0x000000, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000014, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_BreakTransform_Location) == 0x000060, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, Temp_int_Variable) == 0x000084, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000088, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x00008C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000094, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00009C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_BreakVector_X) == 0x0000A4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_BreakVector_Z) == 0x0000AC, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000B0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000B4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0000B8, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Less_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000C0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_GetOwner_ReturnValue) == 0x0000C8, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000D0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_Divide_VectorVector_ReturnValue) == 0x0000D4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_Divide_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_GetEffectVisibleType_ReturnValue) == 0x0000E0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_GetEffectVisibleType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_GetActorScale3D_ReturnValue) == 0x0000E4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, K2Node_MakeStruct_SBSpawnEmitterAtLocationParam) == 0x0000F0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::K2Node_MakeStruct_SBSpawnEmitterAtLocationParam' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000138, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ExecuteUbergraph_BP_EF_BPSet_SpawnGround_Circle_Square::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick");
static_assert(sizeof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick) == 0x000004, "Wrong size on BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_EF_BPSet_SpawnGround_Circle_Square.BP_EF_BPSet_SpawnGround_Circle_Square_C.GroundHit_Circle
// 0x0410 (0x0410 - 0x0000)
struct BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_SpawnCount;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_23;                              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_24;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_25;                              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0080(0x0010)(ConstParm, ReferenceParm)
	ESBEffectVisibleType                          CallFunc_GetEffectVisibleType_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_883B[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_26;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_27;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_883C[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_28;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_29;                              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_883D[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              Temp_byte_Variable;                                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_883E[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_883F[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x01C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8840[0x1];                                     // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8841[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8842[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSpawnEmitterAtLocationParam         K2Node_MakeStruct_SBSpawnEmitterAtLocationParam;   // 0x02E0(0x0048)(NoDestructor)
	class UParticleSystem*                        CallFunc_Array_Get_Item;                           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBSpawnEmitterAtLocationParam         K2Node_MakeStruct_SBSpawnEmitterAtLocationParam_1; // 0x0338(0x0048)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8843[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8844[0x4];                                     // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x03B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8845[0x4];                                     // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle) == 0x000010, "Wrong alignment on BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle");
static_assert(sizeof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle) == 0x000410, "Wrong size on BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Range) == 0x000000, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Range' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Param_SpawnCount) == 0x000004, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Param_SpawnCount' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable) == 0x000008, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_1) == 0x000018, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00001C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_2) == 0x000020, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_3) == 0x000024, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_4) == 0x000028, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_5) == 0x00002C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_6) == 0x000030, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_7) == 0x000034, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_8) == 0x000038, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_9) == 0x00003C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_10) == 0x000040, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_11) == 0x000044, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_12) == 0x000048, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_13) == 0x00004C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_14) == 0x000050, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_15) == 0x000054, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_16) == 0x000058, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_17) == 0x00005C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_18) == 0x000060, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_19) == 0x000064, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_20) == 0x000068, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_21) == 0x00006C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_22) == 0x000070, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_23) == 0x000074, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_24) == 0x000078, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_25) == 0x00007C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_object_Variable) == 0x000080, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_GetEffectVisibleType_ReturnValue) == 0x000090, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_GetEffectVisibleType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_26) == 0x000094, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_26' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_27) == 0x000098, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_27' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00009C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakVector_X) == 0x0000A4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakVector_Z) == 0x0000AC, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_28) == 0x0000B0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_28' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_int_Variable_29) == 0x0000B4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_int_Variable_29' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B8, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakVector_X_1) == 0x0000C4, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakVector_Y_1) == 0x0000C8, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakVector_Z_1) == 0x0000CC, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, K2Node_MakeArray_Array) == 0x0000E0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000F0, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000FC, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakRotator_Roll) == 0x000108, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakRotator_Pitch) == 0x00010C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_BreakRotator_Yaw) == 0x000110, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Add_FloatFloat_ReturnValue) == 0x000114, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_MakeRotator_ReturnValue) == 0x000118, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_GetForwardVector_ReturnValue) == 0x000124, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000130, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, Temp_byte_Variable) == 0x00013C, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, K2Node_SwitchInteger_CmpSuccess) == 0x00013D, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000140, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle, CallFunc_MakeVector_ReturnValue_1) == 0x000144, "Member 'BP_EF_BPSet_SpawnGround_Circle_Square_C_GroundHit_Circle::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
