#pragma once

 

// Package: BP_MannequinForCapture_Studio

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "ST_MannequinForCapture_ArrangementInfo_structs.hpp"
#include "ST_MannequinForCapture_CameraSettingInfo_structs.hpp"
#include "ST_MannequinForCapture_Info_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CharaParts_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_MannequinForCapture_Studio.BP_MannequinForCapture_Studio_C.ExecuteUbergraph_BP_MannequinForCapture_Studio
// 0x03F0 (0x03F0 - 0x0000)
struct BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DEA[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsMaleActive_1;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EProtectorCategory                            K2Node_CustomEvent_InProtectorCategory_1;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DEB[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InCostumeItemId_1;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsNoResetLocAndRot_1;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DEC[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InCostumeItemIndex;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsOwnItem;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DED[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InOwnCostumeColorId;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InOwnCostumeColorS;             // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InOwnCostumeColorV;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InOwnCostumeMaterialId;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MannequinForCapture_C*              K2Node_DynamicCast_AsBP_Mannequin_for_Capture;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DEE[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharaCreateComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DEF[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MannequinForCapture_C*              K2Node_DynamicCast_AsBP_Mannequin_for_Capture_1;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF0[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharaCreateComponent*                CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF1[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MannequinForCapture_C*              K2Node_DynamicCast_AsBP_Mannequin_for_Capture_2;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF2[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MannequinForCapture_C*              K2Node_DynamicCast_AsBP_Mannequin_for_Capture_3;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF3[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MannequinForCapture_C*              K2Node_DynamicCast_AsBP_Mannequin_for_Capture_4;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF4[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MannequinForCapture_C*              K2Node_DynamicCast_AsBP_Mannequin_for_Capture_5;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue_1;    // 0x00C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF5[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF6[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF7[0xA];                                     // 0x0136(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DF8[0xC];                                     // 0x0194(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF9[0x8];                                     // 0x0218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0220(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DFA[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0260(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0290(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DFB[0x3];                                     // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x031C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_1;                              // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DFC[0x3];                                     // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x03A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsPartsLoaded_Result;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPartsLoaded_Result_1;                   // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Result;                         // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsMaleActive;                   // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EProtectorCategory                            K2Node_CustomEvent_InProtectorCategory;            // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DFD[0x2];                                     // 0x03BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InCostumeItemId;                // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsNoResetLocAndRot;           // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DFE[0x3];                                     // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x03C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DFF[0x3];                                     // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x03DC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x03EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio) == 0x000010, "Wrong alignment on BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio");
static_assert(sizeof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio) == 0x0003F0, "Wrong size on BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, EntryPoint) == 0x000000, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_IsVisible) == 0x000004, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_Event_EndPlayReason) == 0x000005, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsDedicatedServer_ReturnValue) == 0x000006, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsLocallyControlled_ReturnValue) == 0x000012, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_IsMaleActive_1) == 0x000014, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_IsMaleActive_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InProtectorCategory_1) == 0x000015, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InProtectorCategory_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InCostumeItemId_1) == 0x000018, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InCostumeItemId_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InIsNoResetLocAndRot_1) == 0x00001C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InIsNoResetLocAndRot_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InCostumeItemIndex) == 0x000020, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InCostumeItemIndex' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_IsOwnItem) == 0x000024, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_IsOwnItem' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InOwnCostumeColorId) == 0x000028, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InOwnCostumeColorId' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InOwnCostumeColorS) == 0x00002C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InOwnCostumeColorS' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InOwnCostumeColorV) == 0x000030, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InOwnCostumeColorV' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InOwnCostumeMaterialId) == 0x000034, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InOwnCostumeMaterialId' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_AsBP_Mannequin_for_Capture) == 0x000038, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_AsBP_Mannequin_for_Capture' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_AsBP_Mannequin_for_Capture_1) == 0x000058, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_AsBP_Mannequin_for_Capture_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000068, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_4) == 0x000071, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_AsBP_Mannequin_for_Capture_2) == 0x000078, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_AsBP_Mannequin_for_Capture_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_AsBP_Mannequin_for_Capture_3) == 0x000088, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_AsBP_Mannequin_for_Capture_3' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_5) == 0x000091, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_6) == 0x000092, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Not_PreBool_ReturnValue_2) == 0x000093, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Not_PreBool_ReturnValue_3) == 0x000094, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_AsBP_Mannequin_for_Capture_4) == 0x000098, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_AsBP_Mannequin_for_Capture_4' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_bSuccess_4) == 0x0000A0, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_AsBP_Mannequin_for_Capture_5) == 0x0000A8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_AsBP_Mannequin_for_Capture_5' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_DynamicCast_bSuccess_5) == 0x0000B0, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_7) == 0x0000B1, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_8) == 0x0000B2, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, Temp_bool_Variable) == 0x0000B3, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetVectorParameterValue_ReturnValue) == 0x0000B4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetVectorParameterValue_ReturnValue_1) == 0x0000C4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetVectorParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_9) == 0x0000D4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0000D8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_10) == 0x0000E4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Location) == 0x0000E8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Rotation) == 0x0000F4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Scale) == 0x000100, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakVector_X) == 0x00010C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakVector_Y) == 0x000110, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakVector_Z) == 0x000114, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000118, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakVector_X_1) == 0x00011C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakVector_Y_1) == 0x000120, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakVector_Z_1) == 0x000124, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Add_FloatFloat_ReturnValue) == 0x000128, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00012C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000130, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_11) == 0x000134, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_12) == 0x000135, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetRelativeTransform_ReturnValue) == 0x000140, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Location_1) == 0x000170, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Rotation_1) == 0x00017C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Scale_1) == 0x000188, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_GetRelativeTransform_ReturnValue_1) == 0x0001A0, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_GetRelativeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_ComposeRotators_ReturnValue) == 0x0001D0, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Location_2) == 0x0001DC, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Rotation_2) == 0x0001E8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BreakTransform_Scale_2) == 0x0001F4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BreakTransform_Scale_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Add_VectorVector_ReturnValue) == 0x000200, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_ComposeRotators_ReturnValue_1) == 0x00020C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_MakeTransform_ReturnValue) == 0x000220, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000250, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_MakeTransform_ReturnValue_1) == 0x000260, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000290, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_Result_1) == 0x000318, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_K2_SetRelativeTransform_SweepHitResult_1) == 0x00031C, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_K2_SetRelativeTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, Temp_bool_Variable_1) == 0x0003A4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CreateDelegate_OutputDelegate) == 0x0003A8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsPartsLoaded_Result) == 0x0003B8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsPartsLoaded_Result' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsPartsLoaded_Result_1) == 0x0003B9, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsPartsLoaded_Result_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_Result) == 0x0003BA, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_BooleanAND_ReturnValue_1) == 0x0003BB, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_IsMaleActive) == 0x0003BC, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_IsMaleActive' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InProtectorCategory) == 0x0003BD, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InProtectorCategory' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InCostumeItemId) == 0x0003C0, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InCostumeItemId' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CustomEvent_InIsNoResetLocAndRot) == 0x0003C4, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CustomEvent_InIsNoResetLocAndRot' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003C8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, Temp_bool_Variable_2) == 0x0003D8, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003DC, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, K2Node_Select_Default) == 0x0003EC, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_13) == 0x0003ED, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio, CallFunc_IsValid_ReturnValue_14) == 0x0003EE, "Member 'BP_MannequinForCapture_Studio_C_ExecuteUbergraph_BP_MannequinForCapture_Studio::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");

// Function BP_MannequinForCapture_Studio.BP_MannequinForCapture_Studio_C.SwitchActiveMannequin_LoadAssetAfter
// 0x000C (0x000C - 0x0000)
struct BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter final
{
public:
	bool                                          Param_IsMaleActive;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EProtectorCategory                            InProtectorCategory;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E00[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InCostumeItemId;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsNoResetLocAndRot;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter) == 0x000004, "Wrong alignment on BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter");
static_assert(sizeof(BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter) == 0x00000C, "Wrong size on BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter, Param_IsMaleActive) == 0x000000, "Member 'BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter::Param_IsMaleActive' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter, InProtectorCategory) == 0x000001, "Member 'BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter::InProtectorCategory' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter, InCostumeItemId) == 0x000004, "Member 'BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter::InCostumeItemId' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter, InIsNoResetLocAndRot) == 0x000008, "Member 'BP_MannequinForCapture_Studio_C_SwitchActiveMannequin_LoadAssetAfter::InIsNoResetLocAndRot' has a wrong offset!");

// Function BP_MannequinForCapture_Studio.BP_MannequinForCapture_Studio_C.CostumeFemaleLoadEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd) == 0x000001, "Wrong alignment on BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd");
static_assert(sizeof(BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd) == 0x000001, "Wrong size on BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd, Result) == 0x000000, "Member 'BP_MannequinForCapture_Studio_C_CostumeFemaleLoadEnd::Result' has a wrong offset!");

// Function BP_MannequinForCapture_Studio.BP_MannequinForCapture_Studio_C.CostumeMaleLoadEnd
// 0x0001 (0x0001 - 0x0000)
struct BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd) == 0x000001, "Wrong alignment on BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd");
static_assert(sizeof(BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd) == 0x000001, "Wrong size on BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd, Result) == 0x000000, "Member 'BP_MannequinForCapture_Studio_C_CostumeMaleLoadEnd::Result' has a wrong offset!");

// Function BP_MannequinForCapture_Studio.BP_MannequinForCapture_Studio_C.SetCostumeToMannequin
// 0x0018 (0x0018 - 0x0000)
struct BP_MannequinForCapture_Studio_C_SetCostumeToMannequin final
{
public:
	int32                                         InCostumeItemIndex;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwnItem;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E01[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InOwnCostumeColorId;                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InOwnCostumeColorS;                                // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InOwnCostumeColorV;                                // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InOwnCostumeMaterialId;                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin) == 0x000004, "Wrong alignment on BP_MannequinForCapture_Studio_C_SetCostumeToMannequin");
static_assert(sizeof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin) == 0x000018, "Wrong size on BP_MannequinForCapture_Studio_C_SetCostumeToMannequin");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin, InCostumeItemIndex) == 0x000000, "Member 'BP_MannequinForCapture_Studio_C_SetCostumeToMannequin::InCostumeItemIndex' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin, IsOwnItem) == 0x000004, "Member 'BP_MannequinForCapture_Studio_C_SetCostumeToMannequin::IsOwnItem' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin, InOwnCostumeColorId) == 0x000008, "Member 'BP_MannequinForCapture_Studio_C_SetCostumeToMannequin::InOwnCostumeColorId' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin, InOwnCostumeColorS) == 0x00000C, "Member 'BP_MannequinForCapture_Studio_C_SetCostumeToMannequin::InOwnCostumeColorS' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin, InOwnCostumeColorV) == 0x000010, "Member 'BP_MannequinForCapture_Studio_C_SetCostumeToMannequin::InOwnCostumeColorV' has a wrong offset!");
static_assert(offsetof(BP_MannequinForCapture_Studio_C_SetCostumeToMannequin, InOwnCostumeMaterialId) == 0x000014, "Member 'BP_MannequinForCapture_Studio_C_SetCostumeToMannequin::InOwnCostumeMaterialId' has a wrong offset!");

// Function BP_MannequinForCapture_Studio.BP_MannequinForCapture_Studio_C.SwitchActiveMannequin
// 0x000C (0x000C - 0x0000)
struct BP_MannequinForCapture_Studio_C_SwitchActiveMannequin final
{
public:
	bool                                          Param_IsMaleActive;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EProtectorCategory                            InProtectorCategory;                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E02[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InCostumeItemId;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsNoResetLocAndRot;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
