#pragma once

 

// Package: BP_PlayerSceneCapture2D_Studio

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_PlayerSceneCapture2D_Rotation_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerSceneCapture2D_Studio.BP_PlayerSceneCapture2D_Studio_C.ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio
// 0x0418 (0x0418 - 0x0000)
struct BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A18[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A19[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1A[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1B[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaRotationZ;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x007C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_9A1C[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Sender_3;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_3;                        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_2;                       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_2;                        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBIntParam*                            K2Node_DynamicCast_AsSBInt_Param;                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1D[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBIntParam*                            K2Node_DynamicCast_AsSBInt_Param_1;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1E[0x2];                                     // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1F[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Sender_1;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_1;                        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBIntParam*                            K2Node_DynamicCast_AsSBInt_Param_2;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A20[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBIntParam*                            K2Node_DynamicCast_AsSBInt_Param_3;                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A21[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A22[0x2];                                     // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A23[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A24[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A25[0x3];                                     // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Set_Length_ReturnValue_1;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Remove_ReturnValue_1;                 // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_2;          // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A26[0x3];                                     // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_1;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0210(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A27[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBUserImageComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bResult;                        // 0x0251(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A28[0x2];                                     // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UploadFaceImage_Request_ReturnValue;      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A29[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bResult, int32 RetCode)>  K2Node_CreateDelegate_OutputDelegate_5;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2A[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bResult, int32 RetCode)>  K2Node_CreateDelegate_OutputDelegate_6;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2B[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bResult, int32 RetCode)>  K2Node_CreateDelegate_OutputDelegate_7;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9A2C[0x4];                                     // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& InPrevStateName, const class FString& InNextStateName)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2D[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_InPrevStateName;                // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_InNextStateName;                // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& InPrevStateName, const class FString& InNextStateName)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2E[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_State_Machine_Name_OutName;           // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_State_Name_IsValid;                   // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A2F[0x6];                                     // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_State_Name_OutStateName;              // 0x0310(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A30[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A31[0x1];                                     // 0x0333(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A32[0x7];                                     // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A33[0x3];                                     // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A34[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharaCreateComponent*                CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A35[0x2];                                     // 0x036A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_3;                    // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A36[0x1];                                     // 0x0373(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmoteFinished_ReturnValue;              // 0x0383(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A37[0x2];                                     // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_10;           // 0x0388(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAnalogStickRotate_bValid;              // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A38[0x2];                                     // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAnalogStickRotate_RotateValue;         // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMouseRotate_bValid;                    // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A39[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMouseRotate_RotateValue;               // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x03A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_3;                          // 0x03D8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_2;      // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A3A[0x7];                                     // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_3;      // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio) == 0x000008, "Wrong alignment on BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio");
static_assert(sizeof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio) == 0x000418, "Wrong size on BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, EntryPoint) == 0x000000, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsEmpty_ReturnValue) == 0x000004, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D) == 0x000008, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_1) == 0x000060, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_3) == 0x00006A, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_DeltaRotationZ) == 0x00006C, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_DeltaRotationZ' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x00007C, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetEventExecutor_ReturnValue) == 0x000108, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetEventExecutor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_2) == 0x000120, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_3) == 0x000130, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_4) == 0x000140, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Sender_3) == 0x000150, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Sender_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Param_3) == 0x000158, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Param_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Sender_2) == 0x000160, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Sender_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Param_2) == 0x000168, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Param_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_AsSBInt_Param) == 0x000170, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_AsSBInt_Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_bSuccess_2) == 0x000178, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_AsSBInt_Param_1) == 0x000180, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_AsSBInt_Param_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_bSuccess_3) == 0x000188, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000189, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Set_Length_ReturnValue) == 0x00018C, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Set_Remove_ReturnValue) == 0x000190, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Greater_IntInt_ReturnValue) == 0x000191, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000192, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Sender_1) == 0x000198, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Sender_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Param_1) == 0x0001A0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Param_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_AsSBInt_Param_2) == 0x0001A8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_AsSBInt_Param_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_bSuccess_4) == 0x0001B0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Sender) == 0x0001B8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_Param) == 0x0001C0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_Param' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_AsSBInt_Param_3) == 0x0001C8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_AsSBInt_Param_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_DynamicCast_bSuccess_5) == 0x0001D0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Add_IntInt_ReturnValue) == 0x0001D4, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsEmpty_ReturnValue_1) == 0x0001D8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001D9, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001DC, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0001E0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E4, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0001E8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001EC, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Greater_IntInt_ReturnValue_4) == 0x0001F0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Set_Length_ReturnValue_1) == 0x0001F4, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Set_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Greater_IntInt_ReturnValue_5) == 0x0001F8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Set_Remove_ReturnValue_1) == 0x0001F9, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Set_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_BooleanOR_ReturnValue) == 0x0001FA, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x0001FB, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_NotEqual_BoolBool_ReturnValue_2) == 0x0001FC, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_NotEqual_BoolBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetEventExecutor_ReturnValue_1) == 0x000200, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetEventExecutor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetPlayerController_ReturnValue) == 0x000208, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_MakeArray_Array_1) == 0x000210, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_4) == 0x000220, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Array_Get_Item_1) == 0x000228, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000230, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetComponentByClass_ReturnValue) == 0x000238, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetDisplayName_ReturnValue_1) == 0x000240, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_5) == 0x000250, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_bResult) == 0x000251, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_RetCode) == 0x000254, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_UploadFaceImage_Request_ReturnValue) == 0x000258, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_UploadFaceImage_Request_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_5) == 0x00025C, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Not_PreBool_ReturnValue) == 0x00026C, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_6) == 0x000270, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_6) == 0x000280, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_7) == 0x000284, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetCharacterId_ReturnValue) == 0x000298, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002A8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Not_PreBool_ReturnValue_1) == 0x0002B8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_InPrevStateName) == 0x0002C0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_InPrevStateName' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_InNextStateName) == 0x0002D0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_InNextStateName' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002E0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_7) == 0x0002F0, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Get_State_Machine_Name_OutName) == 0x0002F8, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Get_State_Machine_Name_OutName' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000308, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Get_State_Name_IsValid) == 0x000309, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Get_State_Name_IsValid' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Get_State_Name_OutStateName) == 0x000310, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Get_State_Name_OutStateName' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_BooleanAND_ReturnValue) == 0x000320, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_8) == 0x000321, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_CustomEvent_IsVisible) == 0x000322, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsDedicatedServer_ReturnValue) == 0x000323, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_Not_PreBool_ReturnValue_2) == 0x000324, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000328, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsValid_ReturnValue_9) == 0x000330, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsLocallyControlled_ReturnValue) == 0x000331, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_BooleanAND_ReturnValue_1) == 0x000332, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, K2Node_Event_DeltaSeconds) == 0x000334, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000338, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000340, "Member 'BP_PlayerSceneCapture2D_Studio_C_ExecuteUbergraph_BP_PlayerSceneCapture2D_Studio::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
