#pragma once

 

// Package: BP_PlayerLevelStartSequenceTaskTutorialHelp

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "ST_TutorialExtendData_structs.hpp"
#include "ST_TutorialExtendDataMain_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerLevelStartSequenceTaskTutorialHelp.BP_PlayerLevelStartSequenceTaskTutorialHelp_C.ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp
// 0x01C0 (0x01C0 - 0x0000)
struct BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90FA[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_wildcard_Variable;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_90FB[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTutorialHelpData                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90FC[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_TutorialExtendData                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0090(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90FD[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_TutorialExtendDataMain             CallFunc_Array_Get_Item;                           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90FE[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCityCurrentMapLevel_ReturnValue;        // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_90FF[0x1];                                     // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9100[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9101[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9102[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	struct FSBTutorialHelpData                    CallFunc_Array_Get_Item_1;                         // 0x0100(0x0058)()
	TArray<struct FSBTutorialHelpData>            CallFunc_SortTutorialHelpDataArray_ReturnValue;    // 0x0158(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9103[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9104[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBCharactersLogComponent*              CallFunc_GetCharacterLogComponent_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetConditionClearTutorialHelpIdList_ReturnValue; // 0x0198(0x0010)(ReferenceParm)
	class UTutorialHelpDialogBox_C*               CallFunc_Create_ReturnValue;                       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp) == 0x000008, "Wrong alignment on BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp");
static_assert(sizeof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp) == 0x0001C0, "Wrong size on BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, EntryPoint) == 0x000000, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_wildcard_Variable) == 0x000020, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetClassType_ReturnValue) == 0x000028, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000088, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000090, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000A0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Get_Item) == 0x0000A4, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_BooleanAND_ReturnValue) == 0x0000B5, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B6, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000B7, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_BooleanOR_ReturnValue) == 0x0000B8, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, Temp_int_Variable) == 0x0000BC, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Length_ReturnValue_1) == 0x0000C0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_IsStandalone_ReturnValue) == 0x0000C5, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_IsCityCurrentMapLevel_ReturnValue) == 0x0000C6, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_IsCityCurrentMapLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Length_ReturnValue_2) == 0x0000C8, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, K2Node_MakeArray_Array) == 0x0000D0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000E0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Length_ReturnValue_3) == 0x0000E4, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000E8, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000EC, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, K2Node_CreateDelegate_OutputDelegate) == 0x0000F0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_SortTutorialHelpDataArray_ReturnValue) == 0x000158, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_SortTutorialHelpDataArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Map_Find_Value) == 0x000168, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Map_Find_ReturnValue) == 0x000170, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetPlayerController_ReturnValue) == 0x000178, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000180, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Add_ReturnValue) == 0x00018C, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetCharacterLogComponent_ReturnValue) == 0x000190, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetCharacterLogComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_GetConditionClearTutorialHelpIdList_ReturnValue) == 0x000198, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_GetConditionClearTutorialHelpIdList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Create_ReturnValue) == 0x0001A8, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Length_ReturnValue_4) == 0x0001B0, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Array_Get_Item_2) == 0x0001B4, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001BC, "Member 'BP_PlayerLevelStartSequenceTaskTutorialHelp_C_ExecuteUbergraph_BP_PlayerLevelStartSequenceTaskTutorialHelp::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

}

