#pragma once

 

// Package: BP_RsDialog_ChargeRoseOrb

#include "Basic.hpp"

#include "RsDialogButtonType_structs.hpp"


namespace SDK::Params
{

// Function BP_RsDialog_ChargeRoseOrb.BP_RsDialog_ChargeRoseOrb_C.OnButtonClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature final
{
public:
	ERsDialogButtonType                           Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature) == 0x000001, "Wrong alignment on BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature");
static_assert(sizeof(BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature) == 0x000001, "Wrong size on BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature");
static_assert(offsetof(BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature, Type) == 0x000000, "Member 'BP_RsDialog_ChargeRoseOrb_C_OnButtonClicked__DelegateSignature::Type' has a wrong offset!");

// Function BP_RsDialog_ChargeRoseOrb.BP_RsDialog_ChargeRoseOrb_C.ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb
// 0x0004 (0x0004 - 0x0000)
struct BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb) == 0x000004, "Wrong alignment on BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb");
static_assert(sizeof(BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb) == 0x000004, "Wrong size on BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb");
static_assert(offsetof(BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb, EntryPoint) == 0x000000, "Member 'BP_RsDialog_ChargeRoseOrb_C_ExecuteUbergraph_BP_RsDialog_ChargeRoseOrb::EntryPoint' has a wrong offset!");

}

