#pragma once

 

// Package: BP_SBProductItemData

#include "Basic.hpp"

#include "E_SBProductDetailType_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SBProductItemData.BP_SBProductItemData_C.OnChangeTrying__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_SBProductItemData_C_OnChangeTrying__DelegateSignature final
{
public:
	class UBP_SBProductItemData_C*                Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTrying;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SBProductItemData_C_OnChangeTrying__DelegateSignature) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_OnChangeTrying__DelegateSignature");
static_assert(sizeof(BP_SBProductItemData_C_OnChangeTrying__DelegateSignature) == 0x000010, "Wrong size on BP_SBProductItemData_C_OnChangeTrying__DelegateSignature");
static_assert(offsetof(BP_SBProductItemData_C_OnChangeTrying__DelegateSignature, Sender) == 0x000000, "Member 'BP_SBProductItemData_C_OnChangeTrying__DelegateSignature::Sender' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_OnChangeTrying__DelegateSignature, bTrying) == 0x000008, "Member 'BP_SBProductItemData_C_OnChangeTrying__DelegateSignature::bTrying' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.OnChangeVisibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature final
{
public:
	ESlateVisibility                              Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature) == 0x000001, "Wrong alignment on BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature");
static_assert(sizeof(BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature) == 0x000001, "Wrong size on BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature");
static_assert(offsetof(BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature, Visibility) == 0x000000, "Member 'BP_SBProductItemData_C_OnChangeVisibility__DelegateSignature::Visibility' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.ExecuteUbergraph_BP_SBProductItemData
// 0x0018 (0x0018 - 0x0000)
struct BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10FD[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SBProductItemData_C*                K2Node_Event_Data;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData");
static_assert(sizeof(BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData) == 0x000018, "Wrong size on BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData");
static_assert(offsetof(BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData, EntryPoint) == 0x000000, "Member 'BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData, K2Node_Event_Data) == 0x000008, "Member 'BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData, K2Node_Event_Value) == 0x000010, "Member 'BP_SBProductItemData_C_ExecuteUbergraph_BP_SBProductItemData::K2Node_Event_Value' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.SetSelectedData
// 0x0008 (0x0008 - 0x0000)
struct BP_SBProductItemData_C_SetSelectedData final
{
public:
	class UBP_SBProductItemData_C*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SBProductItemData_C_SetSelectedData) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_SetSelectedData");
static_assert(sizeof(BP_SBProductItemData_C_SetSelectedData) == 0x000008, "Wrong size on BP_SBProductItemData_C_SetSelectedData");
static_assert(offsetof(BP_SBProductItemData_C_SetSelectedData, Data) == 0x000000, "Member 'BP_SBProductItemData_C_SetSelectedData::Data' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.SetScrollOffset
// 0x0004 (0x0004 - 0x0000)
struct BP_SBProductItemData_C_SetScrollOffset final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SBProductItemData_C_SetScrollOffset) == 0x000004, "Wrong alignment on BP_SBProductItemData_C_SetScrollOffset");
static_assert(sizeof(BP_SBProductItemData_C_SetScrollOffset) == 0x000004, "Wrong size on BP_SBProductItemData_C_SetScrollOffset");
static_assert(offsetof(BP_SBProductItemData_C_SetScrollOffset, Value) == 0x000000, "Member 'BP_SBProductItemData_C_SetScrollOffset::Value' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.InitFromUniqueId
// 0x01B8 (0x01B8 - 0x0000)
struct BP_SBProductItemData_C_InitFromUniqueId final
{
public:
	class FString                                 Param_UniqueId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FE[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10FF[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBNetworkDataCache*              CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0088(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemList*                         CallFunc_GetOwnItemList_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindItemByAllStorage_bOutExist;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1100[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItemByAllStorage_ReturnValue;      // 0x00A0(0x0118)()
};
static_assert(alignof(BP_SBProductItemData_C_InitFromUniqueId) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_InitFromUniqueId");
static_assert(sizeof(BP_SBProductItemData_C_InitFromUniqueId) == 0x0001B8, "Wrong size on BP_SBProductItemData_C_InitFromUniqueId");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, Param_UniqueId) == 0x000000, "Member 'BP_SBProductItemData_C_InitFromUniqueId::Param_UniqueId' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_IsEmpty_ReturnValue_1) == 0x000011, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_SBProductItemData_C_InitFromUniqueId::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, K2Node_MakeArray_Array_1) == 0x000028, "Member 'BP_SBProductItemData_C_InitFromUniqueId::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000050, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_GetDisplayName_ReturnValue_1) == 0x000068, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_IsEmpty_ReturnValue_2) == 0x000078, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_GetSBPlayerController_ReturnValue) == 0x000080, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_GetNetworkDataCache_ReturnValue) == 0x000088, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_GetOwnItemList_ReturnValue) == 0x000090, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_GetOwnItemList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_BP_FindItemByAllStorage_bOutExist) == 0x000098, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_BP_FindItemByAllStorage_bOutExist' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromUniqueId, CallFunc_BP_FindItemByAllStorage_ReturnValue) == 0x0000A0, "Member 'BP_SBProductItemData_C_InitFromUniqueId::CallFunc_BP_FindItemByAllStorage_ReturnValue' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.InitFromItemData
// 0x0148 (0x0148 - 0x0000)
struct BP_SBProductItemData_C_InitFromItemData final
{
public:
	EItemType                                     Param_ItemType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1101[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Amount;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1102[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetItemName_OutName;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemName_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1103[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1104[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0120(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0130(0x0018)()
};
static_assert(alignof(BP_SBProductItemData_C_InitFromItemData) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_InitFromItemData");
static_assert(sizeof(BP_SBProductItemData_C_InitFromItemData) == 0x000148, "Wrong size on BP_SBProductItemData_C_InitFromItemData");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, Param_ItemType) == 0x000000, "Member 'BP_SBProductItemData_C_InitFromItemData::Param_ItemType' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, ItemId) == 0x000004, "Member 'BP_SBProductItemData_C_InitFromItemData::ItemId' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, Param_Amount) == 0x000008, "Member 'BP_SBProductItemData_C_InitFromItemData::Param_Amount' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_SBProductItemData_C_InitFromItemData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_GetItemName_OutName) == 0x000020, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_GetItemName_OutName' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_GetItemName_ReturnValue) == 0x000030, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_GetDisplayName_ReturnValue) == 0x000060, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_IsEmpty_ReturnValue) == 0x000070, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'BP_SBProductItemData_C_InitFromItemData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000B8, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C8, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E0, "Member 'BP_SBProductItemData_C_InitFromItemData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, K2Node_MakeArray_Array_1) == 0x000120, "Member 'BP_SBProductItemData_C_InitFromItemData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemData, CallFunc_Format_ReturnValue) == 0x000130, "Member 'BP_SBProductItemData_C_InitFromItemData::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.InitFromRewardData
// 0x0090 (0x0090 - 0x0000)
struct BP_SBProductItemData_C_InitFromRewardData final
{
public:
	ESBRewardItemType                             Param_RewardType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1105[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Amount;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_AmountMin;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1106[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1107[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetRewardItemNameAndType2_OutName;        // 0x0058(0x0018)()
	class FText                                   CallFunc_GetRewardItemNameAndType2_OutType;        // 0x0070(0x0018)()
	bool                                          CallFunc_GetRewardItemNameAndType2_OutNoName;      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SBProductItemData_C_InitFromRewardData) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_InitFromRewardData");
static_assert(sizeof(BP_SBProductItemData_C_InitFromRewardData) == 0x000090, "Wrong size on BP_SBProductItemData_C_InitFromRewardData");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, Param_RewardType) == 0x000000, "Member 'BP_SBProductItemData_C_InitFromRewardData::Param_RewardType' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, ItemId) == 0x000004, "Member 'BP_SBProductItemData_C_InitFromRewardData::ItemId' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, Param_Amount) == 0x000008, "Member 'BP_SBProductItemData_C_InitFromRewardData::Param_Amount' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, Param_AmountMin) == 0x00000C, "Member 'BP_SBProductItemData_C_InitFromRewardData::Param_AmountMin' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, K2Node_MakeArray_Array) == 0x000010, "Member 'BP_SBProductItemData_C_InitFromRewardData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000028, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_IsEmpty_ReturnValue) == 0x000030, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000048, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_GetSBPlayerController_ReturnValue) == 0x000050, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_GetRewardItemNameAndType2_OutName) == 0x000058, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_GetRewardItemNameAndType2_OutName' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_GetRewardItemNameAndType2_OutType) == 0x000070, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_GetRewardItemNameAndType2_OutType' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromRewardData, CallFunc_GetRewardItemNameAndType2_OutNoName) == 0x000088, "Member 'BP_SBProductItemData_C_InitFromRewardData::CallFunc_GetRewardItemNameAndType2_OutNoName' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.InitFromMasterReward
// 0x0058 (0x0058 - 0x0000)
struct BP_SBProductItemData_C_InitFromMasterReward final
{
public:
	struct FSBMasterReward                        Param_MasterReward;                                // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_1108[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1109[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SBProductItemData_C_InitFromMasterReward) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_InitFromMasterReward");
static_assert(sizeof(BP_SBProductItemData_C_InitFromMasterReward) == 0x000058, "Wrong size on BP_SBProductItemData_C_InitFromMasterReward");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, Param_MasterReward) == 0x000000, "Member 'BP_SBProductItemData_C_InitFromMasterReward::Param_MasterReward' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, K2Node_MakeArray_Array) == 0x000018, "Member 'BP_SBProductItemData_C_InitFromMasterReward::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_SBProductItemData_C_InitFromMasterReward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'BP_SBProductItemData_C_InitFromMasterReward::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, CallFunc_IsEmpty_ReturnValue) == 0x000038, "Member 'BP_SBProductItemData_C_InitFromMasterReward::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'BP_SBProductItemData_C_InitFromMasterReward::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromMasterReward, CallFunc_NotEqual_NameName_ReturnValue) == 0x000050, "Member 'BP_SBProductItemData_C_InitFromMasterReward::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.initFromItemBoxContentParam
// 0x0090 (0x0090 - 0x0000)
struct BP_SBProductItemData_C_InitFromItemBoxContentParam final
{
public:
	struct FSBItemBoxContentParam                 ItemBoxContentParam;                               // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	bool                                          bCanParentBppExchange;                             // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110A[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110B[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MathExpression_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110C[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110D[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_MathExpression_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110E[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_110F[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SBProductItemData_C_InitFromItemBoxContentParam) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_InitFromItemBoxContentParam");
static_assert(sizeof(BP_SBProductItemData_C_InitFromItemBoxContentParam) == 0x000090, "Wrong size on BP_SBProductItemData_C_InitFromItemBoxContentParam");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, ItemBoxContentParam) == 0x000000, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::ItemBoxContentParam' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, bCanParentBppExchange) == 0x000020, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::bCanParentBppExchange' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_IsEmpty_ReturnValue) == 0x000021, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000040, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, K2Node_MathExpression_ReturnValue) == 0x00005C, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00006C, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, Temp_int_Variable) == 0x000070, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, K2Node_MathExpression_ReturnValue_1) == 0x000074, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, Temp_bool_Variable) == 0x000080, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000084, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, K2Node_Select_Default) == 0x000088, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitFromItemBoxContentParam, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_SBProductItemData_C_InitFromItemBoxContentParam::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_SBProductItemData.BP_SBProductItemData_C.InitIfItemBox
// 0x0208 (0x0208 - 0x0000)
struct BP_SBProductItemData_C_InitIfItemBox final
{
public:
	struct FSBMasterRewardLotteryGroups           LotteryGroupsMaster;                               // 0x0000(0x0018)(Edit, BlueprintVisible)
	struct FRecipeSetMasterData                   RecipeSetMaster;                                   // 0x0018(0x0018)(Edit, BlueprintVisible)
	struct FSBMasterItemBox                       MasterItemBox;                                     // 0x0030(0x0020)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1110[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1111[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterRewardLotteryGroupsRewards    CallFunc_Array_Get_Item_1;                         // 0x0078(0x0038)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1112[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBItemBoxContentParam                 CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0020)(NoDestructor)
	class UBP_SBProductItemData_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SBProductData_C>  K2Node_DynamicCast_AsBPI_SBProduct_Data;           // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1113[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndex_ItemIndex;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             CallFunc_GetRewardType_RewardType;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindRewardLotteryGroupsMaster_bIsValid;   // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1114[0x1];                                     // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterRewardLotteryGroups           CallFunc_FindRewardLotteryGroupsMaster_RewardLotteryGroupsMaster; // 0x0110(0x0018)()
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1115[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             CallFunc_GetRewardType_RewardType_1;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             CallFunc_GetRewardType_RewardType_2;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1116[0x4];                                     // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemIndex_ItemIndex_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1117[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_2;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetBPPtExchangeMasterByItemId_IsExists; // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1118[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBBPPtExchangeMasterData              CallFunc_BP_GetBPPtExchangeMasterByItemId_ReturnValue; // 0x015C(0x0018)(NoDestructor)
	bool                                          CallFunc_FindItemBoxMaster_bIsValid;               // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1119[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterItemBox                       CallFunc_FindItemBoxMaster_ItemBoxMaster;          // 0x0178(0x0020)()
	int32                                         CallFunc_GetItemIndex_ItemIndex_2;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindRecipeSetMaster_bIsValid;             // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111A[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipeSetMasterData                   CallFunc_FindRecipeSetMaster_RecipeSetMaster;      // 0x01A0(0x0018)()
	class UBP_SBProductItemData_C*                CallFunc_SpawnObject_ReturnValue_1;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SBProductData_C>  K2Node_DynamicCast_AsBPI_SBProduct_Data_1;         // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111B[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111C[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111D[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SBProductItemData_C*                CallFunc_SpawnObject_ReturnValue_2;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SBProductData_C>  K2Node_DynamicCast_AsBPI_SBProduct_Data_2;         // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111E[0x3];                                     // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SBProductItemData_C_InitIfItemBox) == 0x000008, "Wrong alignment on BP_SBProductItemData_C_InitIfItemBox");
static_assert(sizeof(BP_SBProductItemData_C_InitIfItemBox) == 0x000208, "Wrong size on BP_SBProductItemData_C_InitIfItemBox");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, LotteryGroupsMaster) == 0x000000, "Member 'BP_SBProductItemData_C_InitIfItemBox::LotteryGroupsMaster' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, RecipeSetMaster) == 0x000018, "Member 'BP_SBProductItemData_C_InitIfItemBox::RecipeSetMaster' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, MasterItemBox) == 0x000030, "Member 'BP_SBProductItemData_C_InitIfItemBox::MasterItemBox' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_SBProductItemData_C_InitIfItemBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, Temp_int_Array_Index_Variable) == 0x000064, "Member 'BP_SBProductItemData_C_InitIfItemBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Length_ReturnValue_2) == 0x00006C, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, Temp_int_Array_Index_Variable_1) == 0x000070, "Member 'BP_SBProductItemData_C_InitIfItemBox::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, Temp_int_Loop_Counter_Variable_1) == 0x0000B0, "Member 'BP_SBProductItemData_C_InitIfItemBox::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B4, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B8, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, Temp_int_Array_Index_Variable_2) == 0x0000BC, "Member 'BP_SBProductItemData_C_InitIfItemBox::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_SpawnObject_ReturnValue) == 0x0000E0, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, K2Node_DynamicCast_AsBPI_SBProduct_Data) == 0x0000E8, "Member 'BP_SBProductItemData_C_InitIfItemBox::K2Node_DynamicCast_AsBPI_SBProduct_Data' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'BP_SBProductItemData_C_InitIfItemBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_Array_Add_ReturnValue) == 0x0000FC, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_GetSBPlayerController_ReturnValue) == 0x000100, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_GetItemIndex_ItemIndex) == 0x000108, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_GetItemIndex_ItemIndex' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_GetRewardType_RewardType) == 0x00010C, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_GetRewardType_RewardType' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00010D, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_FindRewardLotteryGroupsMaster_bIsValid) == 0x00010E, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_FindRewardLotteryGroupsMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(BP_SBProductItemData_C_InitIfItemBox, CallFunc_FindRewardLotteryGroupsMaster_RewardLotteryGroupsMaster) == 0x000110, "Member 'BP_SBProductItemData_C_InitIfItemBox::CallFunc_FindRewardLotteryGroupsMaster_RewardLotteryGroupsMaster' has a wrong offset!");
