#pragma once

 

// Package: BP_UI_MapFunctionLibrary

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "NPCFacilityIconData_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_MapFunctionLibrary.BP_UI_MapFunctionLibrary_C.CheckIfIconPositionCoincide
// 0x0048 (0x0048 - 0x0000)
struct BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide final
{
public:
	TArray<struct FVector2D>                      InRegisteredPositionList;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector2D                              InNewPosition;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoesCoincide;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8063[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OutCoincideIconRegId;                              // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue;  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8064[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide) == 0x000008, "Wrong alignment on BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide");
static_assert(sizeof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide) == 0x000048, "Wrong size on BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, InRegisteredPositionList) == 0x000000, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::InRegisteredPositionList' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, InNewPosition) == 0x000010, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::InNewPosition' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, __WorldContext) == 0x000018, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, DoesCoincide) == 0x000020, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::DoesCoincide' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, OutCoincideIconRegId) == 0x000024, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::OutCoincideIconRegId' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, CallFunc_Array_Get_Item) == 0x000034, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, CallFunc_EqualEqual_Vector2DVector2D_ReturnValue) == 0x00003C, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::CallFunc_EqualEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_UI_MapFunctionLibrary_C_CheckIfIconPositionCoincide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UI_MapFunctionLibrary.BP_UI_MapFunctionLibrary_C.GetMapUIErrorMessageText
// 0x0058 (0x0058 - 0x0000)
struct BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText final
{
public:
	int32                                         InTextID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8065[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutText;                                           // 0x0010(0x0018)(Parm, OutParm)
	int32                                         TmpTextId;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8066[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
};
static_assert(alignof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText) == 0x000008, "Wrong alignment on BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText");
static_assert(sizeof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText) == 0x000058, "Wrong size on BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText, InTextID) == 0x000000, "Member 'BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText::InTextID' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText, __WorldContext) == 0x000008, "Member 'BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText, OutText) == 0x000010, "Member 'BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText::OutText' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText, TmpTextId) == 0x000028, "Member 'BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText::TmpTextId' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText, CallFunc_GetTextFromAsset_ReturnValue) == 0x000030, "Member 'BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'BP_UI_MapFunctionLibrary_C_GetMapUIErrorMessageText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BP_UI_MapFunctionLibrary.BP_UI_MapFunctionLibrary_C.GetMapSymbolIconTexture
// 0x03B8 (0x03B8 - 0x0000)
struct BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture final
{
public:
	EMapSymbolIconType                            InSymbolIconType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8067[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             OutSymbolIconTexture;                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapSymbolIconType                            TmpSymbolIconType;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               TmpFacilityType;                                   // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8068[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             TmpIconTexture;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_2;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_3;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_4;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_5;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_6;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_7;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_8;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_9;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_10;                             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_11;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_12;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_13;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_14;                             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_15;                             // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_16;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_17;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_18;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_19;                             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_20;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_21;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_22;                             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_23;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_24;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_25;                             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_26;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_27;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_28;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_29;                             // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_30;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_31;                             // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_32;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_33;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_34;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_35;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_36;                             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_37;                             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_38;                             // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_39;                             // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_40;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_41;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_42;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_43;                             // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_44;                             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_45;                             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_46;                             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_47;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_48;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_49;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_50;                             // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_51;                             // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_52;                             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_53;                             // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_54;                             // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_55;                             // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_56;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_57;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_58;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_59;                             // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_60;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_61;                             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_62;                             // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_63;                             // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_64;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_65;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_66;                             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_67;                             // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_68;                             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_69;                             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_70;                             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_71;                             // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_72;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_73;                             // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_74;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_75;                             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_76;                             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_77;                             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_78;                             // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_79;                             // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_80;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_81;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_82;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_83;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_84;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_85;                             // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapSymbolIconType                            Temp_byte_Variable_86;                             // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8069[0x1];                                     // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_9;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_10;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_11;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_12;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_13;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_14;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_15;                           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_16;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_17;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_18;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_19;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_20;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_21;                           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_22;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_23;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_24;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_25;                           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_26;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_27;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_28;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_29;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_30;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_31;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_32;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_33;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_34;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_35;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_36;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_37;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_38;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_39;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_40;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_41;                           // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_42;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_43;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_44;                           // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_45;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_46;                           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_47;                           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_48;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_49;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_50;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_51;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_52;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_53;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_54;                           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_55;                           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_56;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_57;                           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_58;                           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_59;                           // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_60;                           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_61;                           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_62;                           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_63;                           // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_64;                           // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_65;                           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_66;                           // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_67;                           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_68;                           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_69;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_70;                           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_71;                           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_72;                           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_73;                           // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_74;                           // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_75;                           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_76;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_77;                           // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_78;                           // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_79;                           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_80;                           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_81;                           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_82;                           // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_83;                           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_84;                           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_85;                           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_86;                           // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_87;                           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_806A[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_806B[0x3];                                     // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_87;                             // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_806C[0x3];                                     // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               Temp_byte_Variable_88;                             // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMapSymbolIconType                            Temp_byte_Variable_89;                             // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFacilityType                               K2Node_Select_Default;                             // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_806D[0x5];                                     // 0x035B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0368(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_806E[0x3];                                     // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x037C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNPCFacilityIconData                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0388(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture) == 0x000008, "Wrong alignment on BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture");
static_assert(sizeof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture) == 0x0003B8, "Wrong size on BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, InSymbolIconType) == 0x000000, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::InSymbolIconType' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, __WorldContext) == 0x000008, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, OutSymbolIconTexture) == 0x000010, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::OutSymbolIconTexture' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, TmpSymbolIconType) == 0x000018, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::TmpSymbolIconType' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, TmpFacilityType) == 0x000019, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::TmpFacilityType' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, TmpIconTexture) == 0x000020, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::TmpIconTexture' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable) == 0x000028, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_1) == 0x000029, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_2) == 0x00002A, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_3) == 0x00002B, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_4) == 0x00002C, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_5) == 0x00002D, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_6) == 0x00002E, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_7) == 0x00002F, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_8) == 0x000030, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_9) == 0x000031, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_10) == 0x000032, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_11) == 0x000033, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_12) == 0x000034, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_13) == 0x000035, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_14) == 0x000036, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_15) == 0x000037, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_16) == 0x000038, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_17) == 0x000039, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_18) == 0x00003A, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_19) == 0x00003B, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_20) == 0x00003C, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_21) == 0x00003D, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_22) == 0x00003E, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_23) == 0x00003F, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_24) == 0x000040, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_24' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_25) == 0x000041, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_25' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_26) == 0x000042, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_26' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_27) == 0x000043, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_27' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_28) == 0x000044, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_28' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_29) == 0x000045, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_29' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_30) == 0x000046, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_30' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_31) == 0x000047, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_31' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_32) == 0x000048, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_32' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_33) == 0x000049, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_33' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_34) == 0x00004A, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_34' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_35) == 0x00004B, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_35' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_36) == 0x00004C, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_36' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_37) == 0x00004D, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_37' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_38) == 0x00004E, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_38' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_39) == 0x00004F, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_39' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_40) == 0x000050, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_40' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_41) == 0x000051, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_41' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_42) == 0x000052, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_42' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_43) == 0x000053, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_43' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_44) == 0x000054, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_44' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_45) == 0x000055, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_45' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_46) == 0x000056, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_46' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_47) == 0x000057, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_47' has a wrong offset!");
static_assert(offsetof(BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture, Temp_byte_Variable_48) == 0x000058, "Member 'BP_UI_MapFunctionLibrary_C_GetMapSymbolIconTexture::Temp_byte_Variable_48' has a wrong offset!");
