#pragma once

 

// Package: BP_UIBluePrintFunctionLibrary

#include "Basic.hpp"

#include "ST_ShopIconData_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "ST_ItemIconData_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ST_LiquidMemoryIconData_structs.hpp"
#include "CharaParts_structs.hpp"
#include "ST_ItemDetail_CaptureStudio_MapLocation_structs.hpp"


namespace SDK::Params
{

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetPlayerMaxHp
// 0x0040 (0x0040 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBCharacter*                           K2Node_DynamicCast_AsSBCharacter;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_593B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBBattleParamInterface> CallFunc_GetMaxHitPoint_self_CastInput;            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxHitPoint_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp) == 0x000040, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, __WorldContext) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, ReturnValue) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, K2Node_DynamicCast_AsSBCharacter) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::K2Node_DynamicCast_AsSBCharacter' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, CallFunc_GetMaxHitPoint_self_CastInput) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::CallFunc_GetMaxHitPoint_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, CallFunc_GetMaxHitPoint_ReturnValue) == 0x000038, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::CallFunc_GetMaxHitPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp, CallFunc_FFloor_ReturnValue) == 0x00003C, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxHp::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetPlayerCurrentHp
// 0x0040 (0x0040 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBCharacter*                           K2Node_DynamicCast_AsSBCharacter;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_593D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBBattleParamInterface> CallFunc_GetCurrentHitPoint_self_CastInput;        // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCurrentHitPoint_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp) == 0x000040, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, __WorldContext) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, ReturnValue) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, K2Node_DynamicCast_AsSBCharacter) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::K2Node_DynamicCast_AsSBCharacter' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, CallFunc_GetCurrentHitPoint_self_CastInput) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::CallFunc_GetCurrentHitPoint_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, CallFunc_GetCurrentHitPoint_ReturnValue) == 0x000038, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::CallFunc_GetCurrentHitPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp, CallFunc_FFloor_ReturnValue) == 0x00003C, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentHp::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetPlayerMaxMp
// 0x0040 (0x0040 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_593F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPCMagicianComponent*                 K2Node_DynamicCast_AsSBPCMagician_Component;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5940[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxMagicPoint_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp) == 0x000040, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, __WorldContext) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, ReturnValue) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, K2Node_DynamicCast_AsSBPlayer_Character) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, K2Node_DynamicCast_AsSBPCMagician_Component) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::K2Node_DynamicCast_AsSBPCMagician_Component' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, CallFunc_GetMaxMagicPoint_ReturnValue) == 0x000034, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::CallFunc_GetMaxMagicPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp, CallFunc_FFloor_ReturnValue) == 0x000038, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxMp::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetPlayerCurrentMp
// 0x0040 (0x0040 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5941[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5942[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPCMagicianComponent*                 K2Node_DynamicCast_AsSBPCMagician_Component;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5943[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentMagicPoint_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp) == 0x000040, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, __WorldContext) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, ReturnValue) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, K2Node_DynamicCast_AsSBPlayer_Character) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, K2Node_DynamicCast_AsSBPCMagician_Component) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::K2Node_DynamicCast_AsSBPCMagician_Component' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, CallFunc_GetCurrentMagicPoint_ReturnValue) == 0x000034, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::CallFunc_GetCurrentMagicPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp, CallFunc_FFloor_ReturnValue) == 0x000038, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentMp::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetPlayerMaxStamina
// 0x0030 (0x0030 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5944[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5945[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetStamina_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina) == 0x000030, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, __WorldContext) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, ReturnValue) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, K2Node_DynamicCast_AsSBPlayer_Character) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, CallFunc_GetStamina_ReturnValue) == 0x000024, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::CallFunc_GetStamina_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina, CallFunc_FFloor_ReturnValue) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerMaxStamina::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetPlayerCurrentStamina
// 0x0030 (0x0030 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5946[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5947[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurrentStamina_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina) == 0x000030, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, __WorldContext) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, ReturnValue) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, K2Node_DynamicCast_AsSBPlayer_Character) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, CallFunc_GetCurrentStamina_ReturnValue) == 0x000024, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::CallFunc_GetCurrentStamina_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina, CallFunc_FFloor_ReturnValue) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_GetPlayerCurrentStamina::CallFunc_FFloor_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.Create Quest Reward Icon
// 0x0068 (0x0068 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon final
{
public:
	struct FRewardInfo                            InRewardInfo;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bInSelectRewardSelectable;                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnableHiddenReward;                               // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5948[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            OutWidget;                                         // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TmpEnableHiddenReward;                             // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpHideReward_;                                    // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBRewardItemType                             TmpRewardType;                                     // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5949[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TmpRewardId;                                       // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestRewardIcon_C*                     TmpIcon;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpIndex;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpAmount;                                         // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestRewardIcon_C*                     CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMasterReward                        CallFunc_FindRewardMasterData_ReturnValue;         // 0x0050(0x0014)(NoDestructor)
	bool                                          CallFunc_FindRewardMasterData_IsExist;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon) == 0x000068, "Wrong size on BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, InRewardInfo) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::InRewardInfo' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, bInSelectRewardSelectable) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::bInSelectRewardSelectable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, bEnableHiddenReward) == 0x000019, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::bEnableHiddenReward' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, __WorldContext) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, OutWidget) == 0x000028, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::OutWidget' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpEnableHiddenReward) == 0x000030, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpEnableHiddenReward' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpHideReward_) == 0x000031, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpHideReward_' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpRewardType) == 0x000032, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpRewardType' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpRewardId) == 0x000034, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpRewardId' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpIcon) == 0x000038, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpIcon' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpIndex) == 0x000040, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpIndex' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, TmpAmount) == 0x000044, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::TmpAmount' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, CallFunc_Create_ReturnValue) == 0x000048, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, CallFunc_FindRewardMasterData_ReturnValue) == 0x000050, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::CallFunc_FindRewardMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, CallFunc_FindRewardMasterData_IsExist) == 0x000064, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::CallFunc_FindRewardMasterData_IsExist' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000065, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, K2Node_SwitchEnum_CmpSuccess) == 0x000066, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon, CallFunc_BooleanAND_ReturnValue) == 0x000067, "Member 'BP_UIBluePrintFunctionLibrary_C_Create_Quest_Reward_Icon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetTeamColor
// 0x0050 (0x0050 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetTeamColor final
{
public:
	int32                                         TeamNumber;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   ColorTable;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetTeamColor");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor) == 0x000050, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetTeamColor");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor, TeamNumber) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetTeamColor::TeamNumber' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor, __WorldContext) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetTeamColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor, Color) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetTeamColor::Color' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor, ColorTable) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetTeamColor::ColorTable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_UIBluePrintFunctionLibrary_C_GetTeamColor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetTeamColor, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_UIBluePrintFunctionLibrary_C_GetTeamColor::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetHostilityColor
// 0x0058 (0x0058 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetHostilityColor final
{
public:
	ESBHostility                                  Hostility;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   ColorTable;                                        // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetHostilityColor");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor) == 0x000058, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetHostilityColor");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, Hostility) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::Hostility' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, __WorldContext) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, Color) == 0x000010, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::Color' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, ColorTable) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::ColorTable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetHostilityColor, CallFunc_Array_Get_Item) == 0x000044, "Member 'BP_UIBluePrintFunctionLibrary_C_GetHostilityColor::CallFunc_Array_Get_Item' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetItemIconTexture
// 0x0528 (0x0528 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture final
{
public:
	int32                                         InItemID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     InItemType;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            InGender;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeIcon;                                         // 0x0006(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUnidentified;                                     // 0x0007(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemCategory                                 ItemCategory;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UnidentifiedIconName;                              // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594D[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              OutIconTexture;                                    // 0x0020(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	int32                                         NewLocalVar_0;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594E[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ItemIconData                       LocalVal_IconData;                                 // 0x0050(0x00C8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UDataTable*                             LocalVal_DataTable;                                // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalVal_RowName;                                  // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemCategory                                 Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594F[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ItemIconData                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0130(0x00C8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5950[0x6];                                     // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable_1;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5951[0x3];                                     // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x025C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5952[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0268(0x0028)(HasGetValueTypeHash)
	struct FST_ItemIconData                       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0290(0x00C8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterGender                            Temp_byte_Variable_2;                              // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5953[0x6];                                     // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0360(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x0388(0x0028)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5954[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_3;                        // 0x03B8(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x03E0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x0408(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_3;                           // 0x0430(0x0028)(HasGetValueTypeHash)
	struct FST_ItemIconData                       CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0458(0x00C8)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture) == 0x000008, "Wrong alignment on BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture");
static_assert(sizeof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture) == 0x000528, "Wrong size on BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, InItemID) == 0x000000, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::InItemID' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, InItemType) == 0x000004, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::InItemType' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, InGender) == 0x000005, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::InGender' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, LargeIcon) == 0x000006, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::LargeIcon' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, bUnidentified) == 0x000007, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::bUnidentified' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, ItemCategory) == 0x000008, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::ItemCategory' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, UnidentifiedIconName) == 0x00000C, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::UnidentifiedIconName' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, __WorldContext) == 0x000018, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, OutIconTexture) == 0x000020, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::OutIconTexture' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, NewLocalVar_0) == 0x000048, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, LocalVal_IconData) == 0x000050, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::LocalVal_IconData' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, LocalVal_DataTable) == 0x000118, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::LocalVal_DataTable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, LocalVal_RowName) == 0x000120, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::LocalVal_RowName' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_byte_Variable) == 0x000128, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_GetDataTableRowFromName_OutRow) == 0x000130, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001F8, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, K2Node_SwitchEnum_CmpSuccess) == 0x0001F9, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_Conv_IntToString_ReturnValue) == 0x000200, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable) == 0x000210, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_Conv_StringToName_ReturnValue) == 0x000218, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_1) == 0x000220, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_2) == 0x000228, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_3) == 0x000230, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_4) == 0x000238, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_5) == 0x000240, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_6) == 0x000248, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_name_Variable_7) == 0x000250, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_byte_Variable_1) == 0x000258, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, K2Node_Select_Default) == 0x00025C, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_softobject_Variable) == 0x000268, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000290, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000358, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_byte_Variable_2) == 0x000359, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_softobject_Variable_1) == 0x000360, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_softobject_Variable_2) == 0x000388, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_bool_Variable) == 0x0003B0, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, Temp_softobject_Variable_3) == 0x0003B8, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::Temp_softobject_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, K2Node_Select_Default_1) == 0x0003E0, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, K2Node_Select_Default_2) == 0x000408, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, K2Node_Select_Default_3) == 0x000430, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000458, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000520, "Member 'BP_UIBluePrintFunctionLibrary_C_GetItemIconTexture::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");

// Function BP_UIBluePrintFunctionLibrary.BP_UIBluePrintFunctionLibrary_C.GetRewardItemIconTexture
// 0x06E8 (0x06E8 - 0x0000)
struct BP_UIBluePrintFunctionLibrary_C_GetRewardItemIconTexture final
{
public:
	int32                                         InItemID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
