#pragma once

 

// Package: BP_UI_AestheShopFunctionLibrary

#include "Basic.hpp"

#include "ST_AestheShopPartsIconComplexInfo_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "E_AestheShop_TopMenuItems_DetailSettings_structs.hpp"


namespace SDK::Params
{

// Function BP_UI_AestheShopFunctionLibrary.BP_UI_AestheShopFunctionLibrary_C.GetAestheCourseMasterFromTicketTokenId
// 0x0150 (0x0150 - 0x0000)
struct BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId final
{
public:
	int32                                         InTicketTokenId;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FC9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsValid;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCA[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAestheShopCourseMasterData          OutMaster;                                         // 0x0018(0x0050)(Parm, OutParm)
	struct FSBAestheShopCourseMasterData          LocalMasterData;                                   // 0x0068(0x0050)(Edit, BlueprintVisible)
	TArray<struct FSBAestheShopCourseMasterData>  TmpMasterDatas;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible)
	int32                                         TmpTicketTokenId;                                  // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBAestheShopCourseMasterData          CallFunc_Array_Get_Item;                           // 0x00D8(0x0050)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCB[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCC[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBAestheShopCourseMasterData>  CallFunc_BP_GetAestheShopCourseMasterDataArray_ReturnValue; // 0x0140(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId) == 0x000008, "Wrong alignment on BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId");
static_assert(sizeof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId) == 0x000150, "Wrong size on BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, InTicketTokenId) == 0x000000, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::InTicketTokenId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, __WorldContext) == 0x000008, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, OutIsValid) == 0x000010, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::OutIsValid' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, OutMaster) == 0x000018, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::OutMaster' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, LocalMasterData) == 0x000068, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::LocalMasterData' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, TmpMasterDatas) == 0x0000B8, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::TmpMasterDatas' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, TmpTicketTokenId) == 0x0000C8, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::TmpTicketTokenId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, Temp_int_Array_Index_Variable) == 0x0000D0, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, Temp_int_Loop_Counter_Variable) == 0x0000D4, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000130, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_GetMasterDataManager_IsValid) == 0x000131, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_GetMasterDataManager_ReturnValue) == 0x000138, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId, CallFunc_BP_GetAestheShopCourseMasterDataArray_ReturnValue) == 0x000140, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCourseMasterFromTicketTokenId::CallFunc_BP_GetAestheShopCourseMasterDataArray_ReturnValue' has a wrong offset!");

// Function BP_UI_AestheShopFunctionLibrary.BP_UI_AestheShopFunctionLibrary_C.GetAestheCategoryIconTexture
// 0x01D0 (0x01D0 - 0x0000)
struct BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture final
{
public:
	E_AestheShop_TopMenuItems_DetailSettings      InAestheDetailSettingType;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              OutIconTexture;                                    // 0x0010(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	E_AestheShop_TopMenuItems_DetailSettings      Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCE[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0040(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0068(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_2;                        // 0x0090(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_3;                        // 0x00B8(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_4;                        // 0x00E0(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_5;                        // 0x0108(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_6;                        // 0x0130(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_7;                        // 0x0158(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_8;                        // 0x0180(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default;                             // 0x01A8(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture) == 0x000008, "Wrong alignment on BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture");
static_assert(sizeof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture) == 0x0001D0, "Wrong size on BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, InAestheDetailSettingType) == 0x000000, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::InAestheDetailSettingType' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, __WorldContext) == 0x000008, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, OutIconTexture) == 0x000010, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::OutIconTexture' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_byte_Variable) == 0x000038, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable) == 0x000040, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_1) == 0x000068, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_2) == 0x000090, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_3) == 0x0000B8, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_4) == 0x0000E0, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_5) == 0x000108, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_6) == 0x000130, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_7) == 0x000158, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, Temp_softobject_Variable_8) == 0x000180, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::Temp_softobject_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture, K2Node_Select_Default) == 0x0001A8, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAestheCategoryIconTexture::K2Node_Select_Default' has a wrong offset!");

// Function BP_UI_AestheShopFunctionLibrary.BP_UI_AestheShopFunctionLibrary_C.IsAesthePartsIconActive
// 0x0190 (0x0190 - 0x0000)
struct BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive final
{
public:
	class FString                                 InPartsIconId;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              InNowTime;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsIconActive;                                   // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FCF[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalEventTermId;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSBAestheShopPartsMasterData           LocalAestheShopPartsMasterData;                    // 0x0038(0x0048)(Edit, BlueprintVisible)
	TArray<struct FSBEventTermsData>              LocalTerms;                                        // 0x0080(0x0010)(Edit, BlueprintVisible)
	bool                                          TmpIsActive;                                       // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD0[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              TmpNowTime;                                        // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 TmpPartsIconId;                                    // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class USBGameInstance*                        CallFunc_GetSBGameInstance_ReturnValue;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD1[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBEventScheduler*                      CallFunc_GetEventScheduler_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD2[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventTermsMasterData                CallFunc_GetMasterDataBP_OutMaster;                // 0x00D0(0x0020)()
	bool                                          CallFunc_GetMasterDataBP_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEventTermActive_ReturnValue;            // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD3[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventTermsData                      CallFunc_Array_Get_Item;                           // 0x00F8(0x0030)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD4[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD5[0x5];                                     // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindAestheShopPartsMasterByIconId_IsExists; // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD6[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAestheShopPartsMasterData           CallFunc_BP_FindAestheShopPartsMasterByIconId_ReturnValue; // 0x0148(0x0048)()
};
static_assert(alignof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive) == 0x000008, "Wrong alignment on BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive");
static_assert(sizeof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive) == 0x000190, "Wrong size on BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, InPartsIconId) == 0x000000, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::InPartsIconId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, InNowTime) == 0x000010, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::InNowTime' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, __WorldContext) == 0x000018, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, OutIsIconActive) == 0x000020, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::OutIsIconActive' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, LocalEventTermId) == 0x000028, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::LocalEventTermId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, LocalAestheShopPartsMasterData) == 0x000038, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::LocalAestheShopPartsMasterData' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, LocalTerms) == 0x000080, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::LocalTerms' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, TmpIsActive) == 0x000090, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::TmpIsActive' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, TmpNowTime) == 0x000098, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::TmpNowTime' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, TmpPartsIconId) == 0x0000A0, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::TmpPartsIconId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_GetSBGameInstance_ReturnValue) == 0x0000B0, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_GetSBGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_GetEventScheduler_ReturnValue) == 0x0000C0, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_GetEventScheduler_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_GetMasterDataBP_OutMaster) == 0x0000D0, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_GetMasterDataBP_OutMaster' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_GetMasterDataBP_ReturnValue) == 0x0000F0, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_GetMasterDataBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_IsEventTermActive_ReturnValue) == 0x0000F1, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_IsEventTermActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_Not_PreBool_ReturnValue) == 0x000128, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000129, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_Greater_IntInt_ReturnValue) == 0x000130, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000131, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_GetMasterDataManager_IsValid) == 0x000132, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_GetMasterDataManager_ReturnValue) == 0x000138, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_BP_FindAestheShopPartsMasterByIconId_IsExists) == 0x000140, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_BP_FindAestheShopPartsMasterByIconId_IsExists' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive, CallFunc_BP_FindAestheShopPartsMasterByIconId_ReturnValue) == 0x000148, "Member 'BP_UI_AestheShopFunctionLibrary_C_IsAesthePartsIconActive::CallFunc_BP_FindAestheShopPartsMasterByIconId_ReturnValue' has a wrong offset!");

// Function BP_UI_AestheShopFunctionLibrary.BP_UI_AestheShopFunctionLibrary_C.GetAesthePartsSortId
// 0x0080 (0x0080 - 0x0000)
struct BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId final
{
public:
	class FString                                 InIconId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutSortId;                                         // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpSortId;                                         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD7[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindAestheShopPartsMasterByIconId_IsExists; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD8[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAestheShopPartsMasterData           CallFunc_BP_FindAestheShopPartsMasterByIconId_ReturnValue; // 0x0038(0x0048)()
};
static_assert(alignof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId) == 0x000008, "Wrong alignment on BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId");
static_assert(sizeof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId) == 0x000080, "Wrong size on BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, InIconId) == 0x000000, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::InIconId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, __WorldContext) == 0x000010, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, OutSortId) == 0x000018, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::OutSortId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, TmpSortId) == 0x00001C, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::TmpSortId' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, CallFunc_GetMasterDataManager_IsValid) == 0x000020, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, CallFunc_GetMasterDataManager_ReturnValue) == 0x000028, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, CallFunc_BP_FindAestheShopPartsMasterByIconId_IsExists) == 0x000030, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::CallFunc_BP_FindAestheShopPartsMasterByIconId_IsExists' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId, CallFunc_BP_FindAestheShopPartsMasterByIconId_ReturnValue) == 0x000038, "Member 'BP_UI_AestheShopFunctionLibrary_C_GetAesthePartsSortId::CallFunc_BP_FindAestheShopPartsMasterByIconId_ReturnValue' has a wrong offset!");

// Function BP_UI_AestheShopFunctionLibrary.BP_UI_AestheShopFunctionLibrary_C.SortAesthePartsIconInfo
// 0x01A0 (0x01A0 - 0x0000)
struct BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo final
{
public:
	TArray<struct FST_AestheShopPartsIconComplexInfo> InInfo;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FST_AestheShopPartsIconComplexInfo> OutSortedInfo;                                     // 0x0018(0x0010)(Parm, OutParm)
	TArray<class FString>                         NewLocalVar_0;                                     // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         TmpLoopId;                                         // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpLoopMax;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_AestheShopPartsIconComplexInfo     TmpSmallestInfo;                                   // 0x0040(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FST_AestheShopPartsIconComplexInfo> TmpSortedInfo;                                     // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<struct FST_AestheShopPartsIconComplexInfo> TmpInfo;                                           // 0x0090(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD9[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_AestheShopPartsIconComplexInfo     CallFunc_Array_Get_Item;                           // 0x00A8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDA[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDB[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDC[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_AestheShopPartsIconComplexInfo     CallFunc_Array_Get_Item_1;                         // 0x0108(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDD[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_AestheShopPartsIconComplexInfo     CallFunc_Array_Get_Item_2;                         // 0x0150(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDE[0x2];                                     // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo) == 0x000008, "Wrong alignment on BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo");
static_assert(sizeof(BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo) == 0x0001A0, "Wrong size on BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo, InInfo) == 0x000000, "Member 'BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo::InInfo' has a wrong offset!");
static_assert(offsetof(BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo, __WorldContext) == 0x000010, "Member 'BP_UI_AestheShopFunctionLibrary_C_SortAesthePartsIconInfo::__WorldContext' has a wrong offset!");
