#pragma once

 

// Package: BP_WeaponCustomCreateBlueprintFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_WeaponCustomCreateBlueprintFunctionLibrary.BP_WeaponCustomCreateBlueprintFunctionLibrary_C.CreateWeaponCustomMenuSynthe
// 0x0030 (0x0030 - 0x0000)
struct BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWeapon_Synthe;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthe_C*                        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe) == 0x000008, "Wrong alignment on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe");
static_assert(sizeof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe) == 0x000030, "Wrong size on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe, Param_Class) == 0x000000, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe::Param_Class' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe, __WorldContext) == 0x000008, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe, Widget) == 0x000010, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe::Widget' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe, K2Node_ClassDynamicCast_AsWeapon_Synthe) == 0x000018, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe::K2Node_ClassDynamicCast_AsWeapon_Synthe' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuSynthe::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_WeaponCustomCreateBlueprintFunctionLibrary.BP_WeaponCustomCreateBlueprintFunctionLibrary_C.CreateWeaponCustomMenuExtender
// 0x0030 (0x0030 - 0x0000)
struct BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWeapon_Extender;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1F[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponExtender_C*                      CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender) == 0x000008, "Wrong alignment on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender");
static_assert(sizeof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender) == 0x000030, "Wrong size on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender, Param_Class) == 0x000000, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender::Param_Class' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender, __WorldContext) == 0x000008, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender, Widget) == 0x000010, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender::Widget' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender, K2Node_ClassDynamicCast_AsWeapon_Extender) == 0x000018, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender::K2Node_ClassDynamicCast_AsWeapon_Extender' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuExtender::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_WeaponCustomCreateBlueprintFunctionLibrary.BP_WeaponCustomCreateBlueprintFunctionLibrary_C.CreateWeaponCustomMenuTuning
// 0x0030 (0x0030 - 0x0000)
struct BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWeapon_Rebuilder;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B20[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponRebuilder_C*                     CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning) == 0x000008, "Wrong alignment on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning");
static_assert(sizeof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning) == 0x000030, "Wrong size on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning, Param_Class) == 0x000000, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning::Param_Class' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning, __WorldContext) == 0x000008, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning, Widget) == 0x000010, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning::Widget' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning, K2Node_ClassDynamicCast_AsWeapon_Rebuilder) == 0x000018, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning::K2Node_ClassDynamicCast_AsWeapon_Rebuilder' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuTuning::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_WeaponCustomCreateBlueprintFunctionLibrary.BP_WeaponCustomCreateBlueprintFunctionLibrary_C.CreateWeaponCustomMenuRemove
// 0x0030 (0x0030 - 0x0000)
struct BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove final
{
public:
	class UClass*                                 Param_Class;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsWeapon_Ability_Remover;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B21[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponAbilityRemover_C*                CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove) == 0x000008, "Wrong alignment on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove");
static_assert(sizeof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove) == 0x000030, "Wrong size on BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove, Param_Class) == 0x000000, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove::Param_Class' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove, __WorldContext) == 0x000008, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove, Widget) == 0x000010, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove::Widget' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove, K2Node_ClassDynamicCast_AsWeapon_Ability_Remover) == 0x000018, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove::K2Node_ClassDynamicCast_AsWeapon_Ability_Remover' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove, K2Node_ClassDynamicCast_bSuccess) == 0x000020, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove, CallFunc_Create_ReturnValue) == 0x000028, "Member 'BP_WeaponCustomCreateBlueprintFunctionLibrary_C_CreateWeaponCustomMenuRemove::CallFunc_Create_ReturnValue' has a wrong offset!");

}

