#pragma once

 

// Package: CategoryList_Type1_Group

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.ExecuteUbergraph_CategoryList_Type1_Group
// 0x0070 (0x0070 - 0x0000)
struct CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UExpandableArea*                        K2Node_ComponentBoundEvent_Area;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsExpanded;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9C[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExpandableArea*                        K2Node_ComponentBoundEvent_Area_1;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsExpanded_1;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9E[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9F[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default_1;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group");
static_assert(sizeof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group) == 0x000070, "Wrong size on CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, EntryPoint) == 0x000000, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::EntryPoint' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, K2Node_ComponentBoundEvent_Area) == 0x000008, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::K2Node_ComponentBoundEvent_Area' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, K2Node_ComponentBoundEvent_bIsExpanded) == 0x000010, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::K2Node_ComponentBoundEvent_bIsExpanded' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, Temp_bool_Variable) == 0x000011, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, Temp_object_Variable) == 0x000018, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, Temp_object_Variable_1) == 0x000020, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, Temp_bool_Variable_1) == 0x000028, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, Temp_object_Variable_2) == 0x000030, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, Temp_object_Variable_3) == 0x000038, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, K2Node_ComponentBoundEvent_Area_1) == 0x000040, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::K2Node_ComponentBoundEvent_Area_1' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, K2Node_ComponentBoundEvent_bIsExpanded_1) == 0x000048, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::K2Node_ComponentBoundEvent_bIsExpanded_1' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, K2Node_Select_Default) == 0x000050, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, CallFunc_PlaySE_ReturnValue) == 0x000058, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, K2Node_Select_Default_1) == 0x000060, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group, CallFunc_PlaySE_ReturnValue_1) == 0x000068, "Member 'CategoryList_Type1_Group_C_ExecuteUbergraph_CategoryList_Type1_Group::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature final
{
public:
	class UExpandableArea*                        Area;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExpanded;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature");
static_assert(sizeof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature) == 0x000010, "Wrong size on CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature");
static_assert(offsetof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature, Area) == 0x000000, "Member 'CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature::Area' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature, bIsExpanded) == 0x000008, "Member 'CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_K2Node_ComponentBoundEvent_1_OnExpandableAreaExpansionChanged__DelegateSignature::bIsExpanded' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature final
{
public:
	class UExpandableArea*                        Area;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExpanded;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature");
static_assert(sizeof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature) == 0x000010, "Wrong size on CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature");
static_assert(offsetof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature, Area) == 0x000000, "Member 'CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature::Area' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature, bIsExpanded) == 0x000008, "Member 'CategoryList_Type1_Group_C_BndEvt__CategoryList_Type1_Group_ExpandableArea_64_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature::bIsExpanded' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.SetGroupNameText
// 0x0028 (0x0028 - 0x0000)
struct CategoryList_Type1_Group_C_SetGroupNameText final
{
public:
	class FText                                   NameText;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryList_Type1_Group_C_SetGroupNameText) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_SetGroupNameText");
static_assert(sizeof(CategoryList_Type1_Group_C_SetGroupNameText) == 0x000028, "Wrong size on CategoryList_Type1_Group_C_SetGroupNameText");
static_assert(offsetof(CategoryList_Type1_Group_C_SetGroupNameText, NameText) == 0x000000, "Member 'CategoryList_Type1_Group_C_SetGroupNameText::NameText' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetGroupNameText, Temp_int_Variable) == 0x000018, "Member 'CategoryList_Type1_Group_C_SetGroupNameText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetGroupNameText, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00001C, "Member 'CategoryList_Type1_Group_C_SetGroupNameText::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetGroupNameText, K2Node_Select_Default) == 0x000020, "Member 'CategoryList_Type1_Group_C_SetGroupNameText::K2Node_Select_Default' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.AddListItem
// 0x0048 (0x0048 - 0x0000)
struct CategoryList_Type1_Group_C_AddListItem final
{
public:
	class UCategoryList_Type1_Item_C*             ListItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DA0[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBox*                           K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DA1[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryList_Type1_Group_C_AddListItem) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_AddListItem");
static_assert(sizeof(CategoryList_Type1_Group_C_AddListItem) == 0x000048, "Wrong size on CategoryList_Type1_Group_C_AddListItem");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, ListItem) == 0x000000, "Member 'CategoryList_Type1_Group_C_AddListItem::ListItem' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, ID) == 0x000008, "Member 'CategoryList_Type1_Group_C_AddListItem::ID' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, Temp_int_Variable) == 0x00000C, "Member 'CategoryList_Type1_Group_C_AddListItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, K2Node_MakeStruct_Margin) == 0x000010, "Member 'CategoryList_Type1_Group_C_AddListItem::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000020, "Member 'CategoryList_Type1_Group_C_AddListItem::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, K2Node_Select_Default) == 0x000028, "Member 'CategoryList_Type1_Group_C_AddListItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'CategoryList_Type1_Group_C_AddListItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000038, "Member 'CategoryList_Type1_Group_C_AddListItem::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_AddListItem, CallFunc_Array_Add_ReturnValue_1) == 0x000040, "Member 'CategoryList_Type1_Group_C_AddListItem::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.SetButtonSelected
// 0x0020 (0x0020 - 0x0000)
struct CategoryList_Type1_Group_C_SetButtonSelected final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA3[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCategoryList_Type1_Item_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryList_Type1_Group_C_SetButtonSelected) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_SetButtonSelected");
static_assert(sizeof(CategoryList_Type1_Group_C_SetButtonSelected) == 0x000020, "Wrong size on CategoryList_Type1_Group_C_SetButtonSelected");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelected, ID) == 0x000000, "Member 'CategoryList_Type1_Group_C_SetButtonSelected::ID' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelected, Selected) == 0x000004, "Member 'CategoryList_Type1_Group_C_SetButtonSelected::Selected' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelected, TargetIndex) == 0x000008, "Member 'CategoryList_Type1_Group_C_SetButtonSelected::TargetIndex' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelected, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'CategoryList_Type1_Group_C_SetButtonSelected::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelected, CallFunc_Array_Get_Item) == 0x000010, "Member 'CategoryList_Type1_Group_C_SetButtonSelected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelected, CallFunc_Array_Find_ReturnValue) == 0x000018, "Member 'CategoryList_Type1_Group_C_SetButtonSelected::CallFunc_Array_Find_ReturnValue' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.CheckListNewIconVisible
// 0x0028 (0x0028 - 0x0000)
struct CategoryList_Type1_Group_C_CheckListNewIconVisible final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RetValue;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA4[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA5[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DA6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCategoryList_Type1_Item_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryList_Type1_Group_C_CheckListNewIconVisible) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_CheckListNewIconVisible");
static_assert(sizeof(CategoryList_Type1_Group_C_CheckListNewIconVisible) == 0x000028, "Wrong size on CategoryList_Type1_Group_C_CheckListNewIconVisible");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, Result) == 0x000000, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::Result' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, RetValue) == 0x000001, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::RetValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, CallFunc_Array_Get_Item) == 0x000018, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_CheckListNewIconVisible, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'CategoryList_Type1_Group_C_CheckListNewIconVisible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.SetButtonSelectIndex
// 0x0020 (0x0020 - 0x0000)
struct CategoryList_Type1_Group_C_SetButtonSelectIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA7[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetIndex;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DA8[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCategoryList_Type1_Item_C*             CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryList_Type1_Group_C_SetButtonSelectIndex) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_SetButtonSelectIndex");
static_assert(sizeof(CategoryList_Type1_Group_C_SetButtonSelectIndex) == 0x000020, "Wrong size on CategoryList_Type1_Group_C_SetButtonSelectIndex");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelectIndex, Param_Index) == 0x000000, "Member 'CategoryList_Type1_Group_C_SetButtonSelectIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelectIndex, Selected) == 0x000004, "Member 'CategoryList_Type1_Group_C_SetButtonSelectIndex::Selected' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelectIndex, TargetIndex) == 0x000008, "Member 'CategoryList_Type1_Group_C_SetButtonSelectIndex::TargetIndex' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelectIndex, CallFunc_Array_Get_Item) == 0x000010, "Member 'CategoryList_Type1_Group_C_SetButtonSelectIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetButtonSelectIndex, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'CategoryList_Type1_Group_C_SetButtonSelectIndex::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.SetNewIcon
// 0x0010 (0x0010 - 0x0000)
struct CategoryList_Type1_Group_C_SetNewIcon final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsActive;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DA9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCategoryList_Type1_Item_C*             CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CategoryList_Type1_Group_C_SetNewIcon) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_SetNewIcon");
static_assert(sizeof(CategoryList_Type1_Group_C_SetNewIcon) == 0x000010, "Wrong size on CategoryList_Type1_Group_C_SetNewIcon");
static_assert(offsetof(CategoryList_Type1_Group_C_SetNewIcon, InId) == 0x000000, "Member 'CategoryList_Type1_Group_C_SetNewIcon::InId' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetNewIcon, InIsActive) == 0x000004, "Member 'CategoryList_Type1_Group_C_SetNewIcon::InIsActive' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetNewIcon, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000005, "Member 'CategoryList_Type1_Group_C_SetNewIcon::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetNewIcon, CallFunc_Array_Get_Item) == 0x000008, "Member 'CategoryList_Type1_Group_C_SetNewIcon::CallFunc_Array_Get_Item' has a wrong offset!");

// Function CategoryList_Type1_Group.CategoryList_Type1_Group_C.SetAllNewIcon
// 0x0028 (0x0028 - 0x0000)
struct CategoryList_Type1_Group_C_SetAllNewIcon final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DAA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DAB[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCategoryList_Type1_Item_C*             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryList_Type1_Group_C_SetAllNewIcon) == 0x000008, "Wrong alignment on CategoryList_Type1_Group_C_SetAllNewIcon");
static_assert(sizeof(CategoryList_Type1_Group_C_SetAllNewIcon) == 0x000028, "Wrong size on CategoryList_Type1_Group_C_SetAllNewIcon");
static_assert(offsetof(CategoryList_Type1_Group_C_SetAllNewIcon, InIsActive) == 0x000000, "Member 'CategoryList_Type1_Group_C_SetAllNewIcon::InIsActive' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetAllNewIcon, Temp_int_Array_Index_Variable) == 0x000004, "Member 'CategoryList_Type1_Group_C_SetAllNewIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CategoryList_Type1_Group_C_SetAllNewIcon, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'CategoryList_Type1_Group_C_SetAllNewIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
