#pragma once

 

// Package: CharaCreate_DressVisibilitySwitchOn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CharaCreate_DressVisibilitySwitchOn.CharaCreate_DressVisibilitySwitchOn_C.ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn
// 0x00B0 (0x00B0 - 0x0000)
struct CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_892E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0028)()
};
static_assert(alignof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn) == 0x000008, "Wrong alignment on CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn");
static_assert(sizeof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn) == 0x0000B0, "Wrong size on CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, EntryPoint) == 0x000000, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, CallFunc_PlaySE_ReturnValue) == 0x000004, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, CallFunc_PlaySE_ReturnValue_1) == 0x000008, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'CharaCreate_DressVisibilitySwitchOn_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOn::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

