#pragma once

 

// Package: CharaCreate_DressVisibilitySwitchOff

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CharaCreate_DressVisibilitySwitchOff.CharaCreate_DressVisibilitySwitchOff_C.ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff
// 0x00B0 (0x00B0 - 0x0000)
struct CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_892F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0028)()
};
static_assert(alignof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff) == 0x000008, "Wrong alignment on CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff");
static_assert(sizeof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff) == 0x0000B0, "Wrong size on CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, EntryPoint) == 0x000000, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, CallFunc_PlaySE_ReturnValue) == 0x000004, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, CallFunc_PlaySE_ReturnValue_1) == 0x000008, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'CharaCreate_DressVisibilitySwitchOff_C_ExecuteUbergraph_CharaCreate_DressVisibilitySwitchOff::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

