#pragma once

 

// Package: ChatHUD

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "E_ChatWindowChatType_structs.hpp"


namespace SDK::Params
{

// Function ChatHUD.ChatHUD_C.ExecuteUbergraph_ChatHUD
// 0x0640 (0x0640 - 0x0000)
struct ChatHUD_C_ExecuteUbergraph_ChatHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F72[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatSettingWindow_C*                   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonToolTipDetail_Fixed_C*       CallFunc_Create_ReturnValue_1;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F73[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleChatType_result;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTextInputFocus_Resurl;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F74[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F75[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     K2Node_CustomEvent_InOtherPC;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_1;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F76[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAdminComponent*                CallFunc_GetSBPlayerAdminComponent_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F77[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipText_Variable_C*      CallFunc_Create_ReturnValue_2;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBAdminCommandCallbackRequest                K2Node_CustomEvent_Request;                        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F78[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAdminComponent*                CallFunc_GetSBPlayerAdminComponent_ReturnValue_1;  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAdminComponent*                CallFunc_GetSBPlayerAdminComponent_ReturnValue_2;  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBAdminBookmarkMisc*                   CallFunc_GetSBAdminBookmarkMisc_ReturnValue;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F79[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_OpenGotoBookmarkWindow_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_AdminGotoBookmarkWindow_C*         K2Node_DynamicCast_AsUMG_Admin_Goto_Bookmark_Window; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F7A[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBAdminBookmarkMisc*                   CallFunc_GetSBAdminBookmarkMisc_ReturnValue_1;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAdminComponent*                CallFunc_GetSBPlayerAdminComponent_ReturnValue_3;  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBChatLogWindowSlot                          K2Node_CustomEvent_RequestSlot_2;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBChatLogWindowSlot                          K2Node_CustomEvent_SlotType;                       // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F7B[0x1];                                     // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F7C[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ChatLogWindow_C*                   CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBChatMessage*                         K2Node_CustomEvent_Message_1;                      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerId;                       // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x00F8(0x0018)()
	class FString                                 K2Node_CustomEvent_CharacterId;                    // 0x0110(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	ESBPrivilegeType                              K2Node_CustomEvent_PrivilegeType;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F7D[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBDirectChatSenderLogData             K2Node_MakeStruct_SBDirectChatSenderLogData;       // 0x0138(0x0038)()
	class UWBP_CommonToolTipText_Variable_C*      CallFunc_Create_ReturnValue_3;                     // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F7E[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBChatLogWindowSlot                          K2Node_CustomEvent_RequestSlot_1;                  // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBChatLogWindowSlot                          K2Node_CustomEvent_RequestSlot;                    // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F7F[0x1];                                     // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InFilterType;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InDetailFilterType;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F80[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F81[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ChatLogWindow_C*                   CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate;              // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Flag;                           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F82[0x2];                                     // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	E_ChatWindowChatType                          CallFunc_GetChatType_ChatType;                     // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F83[0x2];                                     // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0200(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F84[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0230(0x0018)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F85[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ChatLogWindow_C*                   CallFunc_Array_Get_Item_2;                         // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMovable_C*                             CallFunc_Array_Get_Item_3;                         // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetWidget_CreatedUserWidget;              // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChatLogWindowTempList_C*               K2Node_DynamicCast_AsChat_Log_Window_Temp_List;    // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F86[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0288(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x02B0(0x0018)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  CallFunc_Get_Log_Window_Visible_Status_List_IsVisibleStatusList; // 0x02D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F87[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorialHelpDialogBox_C*               CallFunc_Create_ReturnValue_4;                     // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F88[0x3];                                     // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4F89[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ChatLogWindow_C*                   CallFunc_Array_Get_Item_4;                         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F8A[0x1];                                     // 0x0327(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F8B[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue;         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBUIType                                     K2Node_CustomEvent_InUIType;                       // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisibility;                  // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInInstantly;                   // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F8C[0x1];                                     // 0x035B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x036E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F8D[0x1];                                     // 0x036F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBChatMessage*                   K2Node_CustomEvent_Message;                        // 0x0378(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBChatUIMessage                       K2Node_CustomEvent_Mess;                           // 0x0380(0x0070)(ConstParm)
	class USBGameInstance*                        K2Node_DynamicCast_AsSBGame_Instance;              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F8E[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckReceivedMessageSound_Result;         // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F8F[0x5];                                     // 0x0413(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBDirectChatSenderLogData             K2Node_MakeStruct_SBDirectChatSenderLogData_1;     // 0x0428(0x0038)()
	TDelegate<void(ESBUIType InUIType, bool bInVisibility, bool bInInstantly)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0460(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class USBChatMessage* Message, struct FSBChatUIMessage& Mess)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_Dungeon*                   K2Node_DynamicCast_AsSBGame_State_Dungeon;         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F90[0x6];                                     // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USBChatMessage* Message, struct FSBChatUIMessage& Mess)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x04A0(0x0010)(ZeroConstructor, NoDestructor)
	class USBGameInstance*                        K2Node_DynamicCast_AsSBGame_Instance_1;            // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F91[0x7];                                     // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue_1;       // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBUIType InUIType, bool bInVisibility, bool bInInstantly)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x04C8(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_Dungeon*                   K2Node_DynamicCast_AsSBGame_State_Dungeon_1;       // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUIManager_IsValid_1;                   // 0x04EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F92[0x5];                                     // 0x04EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue_1;               // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F93[0x4];                                     // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F94[0x7];                                     // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_2;        // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_CheckUnlock;                    // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F95[0x6];                                     // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_3;        // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F96[0x7];                                     // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharactersLogComponent*              CallFunc_GetCharacterLogComponent_ReturnValue;     // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBAdminCommandCallbackRequest Request)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockTutorialHelp_ReturnValue;         // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F97[0x7];                                     // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_4;        // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F98[0x7];                                     // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_5;        // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F99[0x7];                                     // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_6;        // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9A[0x7];                                     // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_7;        // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9B[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_8;        // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9C[0x7];                                     // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_9;        // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9D[0x7];                                     // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_10;       // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9E[0x7];                                     // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_11;       // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9F[0x2];                                     // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x05F4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4FA0[0x4];                                     // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_12;       // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMainMenuOpen_ReturnValue;               // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FA1[0x2];                                     // 0x061A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0620(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatHUD_C_ExecuteUbergraph_ChatHUD) == 0x000008, "Wrong alignment on ChatHUD_C_ExecuteUbergraph_ChatHUD");
static_assert(sizeof(ChatHUD_C_ExecuteUbergraph_ChatHUD) == 0x000640, "Wrong size on ChatHUD_C_ExecuteUbergraph_ChatHUD");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, EntryPoint) == 0x000000, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Create_ReturnValue_1) == 0x000020, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetIsEnabled_ReturnValue) == 0x000028, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsVisibleChatType_result) == 0x000030, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsVisibleChatType_result' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsTextInputFocus_Resurl) == 0x000031, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsTextInputFocus_Resurl' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetIsEnabled_ReturnValue_1) == 0x000032, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000033, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsInputKeyDown_ReturnValue) == 0x000041, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsInputKeyDown_ReturnValue_1) == 0x000042, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsInputKeyDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_InOtherPC) == 0x000048, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_InOtherPC' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsAnyAnimationPlaying_ReturnValue_1) == 0x000050, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsAnyAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetSBPlayerAdminComponent_ReturnValue) == 0x000058, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetSBPlayerAdminComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Create_ReturnValue_2) == 0x000068, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_Request) == 0x000070, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_Request' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetSBPlayerAdminComponent_ReturnValue_1) == 0x000078, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetSBPlayerAdminComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetSBPlayerAdminComponent_ReturnValue_2) == 0x000080, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetSBPlayerAdminComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetSBAdminBookmarkMisc_ReturnValue) == 0x000088, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetSBAdminBookmarkMisc_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_OpenGotoBookmarkWindow_ReturnValue) == 0x000098, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_OpenGotoBookmarkWindow_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_DynamicCast_AsUMG_Admin_Goto_Bookmark_Window) == 0x0000A0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_DynamicCast_AsUMG_Admin_Goto_Bookmark_Window' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetSBAdminBookmarkMisc_ReturnValue_1) == 0x0000B0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetSBAdminBookmarkMisc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetSBPlayerAdminComponent_ReturnValue_3) == 0x0000B8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetSBPlayerAdminComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Add_ReturnValue) == 0x0000C0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Add_ReturnValue_1) == 0x0000C4, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Add_ReturnValue_2) == 0x0000C8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_RequestSlot_2) == 0x0000CC, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_RequestSlot_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_SlotType) == 0x0000CD, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_SlotType' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000CE, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000D0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_Message_1) == 0x0000E0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_Message_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_PlayerId) == 0x0000E8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_PlayerId' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_Name) == 0x0000F8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_CharacterId) == 0x000110, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_CharacterId' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_PrivilegeType) == 0x000120, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_PrivilegeType' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_TextToString_ReturnValue) == 0x000128, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_MakeStruct_SBDirectChatSenderLogData) == 0x000138, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_MakeStruct_SBDirectChatSenderLogData' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Create_ReturnValue_3) == 0x000170, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Length_ReturnValue) == 0x000178, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetUIManager_IsValid) == 0x00017C, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetUIManager_IsValid' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetUIManager_ReturnValue) == 0x000180, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Less_IntInt_ReturnValue) == 0x000188, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_RequestSlot_1) == 0x000189, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_RequestSlot_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_RequestSlot) == 0x00018A, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_RequestSlot' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_InFilterType) == 0x00018C, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_InFilterType' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_InDetailFilterType) == 0x000190, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_InDetailFilterType' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000194, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000198, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CreateDelegate_OutputDelegate) == 0x0001A8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001B8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x0001C0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CustomEvent_Flag) == 0x0001C9, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CustomEvent_Flag' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001CC, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetChatType_ChatType) == 0x0001DC, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetChatType_ChatType' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001DD, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001E0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetTextFromAsset_ReturnValue) == 0x0001F0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_StringToText_ReturnValue) == 0x000200, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsValid_ReturnValue_3) == 0x000218, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000220, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000230, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, Temp_int_Array_Index_Variable_1) == 0x000248, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Get_Item_2) == 0x000250, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Get_Item_3) == 0x000258, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetWidget_CreatedUserWidget) == 0x000260, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetWidget_CreatedUserWidget' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_DynamicCast_AsChat_Log_Window_Temp_List) == 0x000268, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_DynamicCast_AsChat_Log_Window_Temp_List' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_DynamicCast_bSuccess_2) == 0x000270, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x000278, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000288, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_GetTextFromAsset_ReturnValue_3) == 0x0002A0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_GetTextFromAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0002B0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_AddChild_ReturnValue) == 0x0002C8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Get_Log_Window_Visible_Status_List_IsVisibleStatusList) == 0x0002D0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Get_Log_Window_Visible_Status_List_IsVisibleStatusList' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsValid_ReturnValue_4) == 0x0002E0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Create_ReturnValue_4) == 0x0002E8, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_IsValid_ReturnValue_5) == 0x0002F0, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002F4, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, K2Node_CreateDelegate_OutputDelegate_4) == 0x000304, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Get_Item_4) == 0x000318, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Array_Length_ReturnValue_1) == 0x000320, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, CallFunc_Less_IntInt_ReturnValue_1) == 0x000324, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, Temp_byte_Variable) == 0x000325, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChatHUD_C_ExecuteUbergraph_ChatHUD, Temp_byte_Variable_1) == 0x000326, "Member 'ChatHUD_C_ExecuteUbergraph_ChatHUD::Temp_byte_Variable_1' has a wrong offset!");
