#pragma once

 

// Package: ChatLogWindowList

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChatLogWindowList.ChatLogWindowList_C.OnChangeFilterType__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ChatLogWindowList_C_OnChangeFilterType__DelegateSignature final
{
public:
	int32                                         InType;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDetailType;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatLogWindowList_C_OnChangeFilterType__DelegateSignature) == 0x000004, "Wrong alignment on ChatLogWindowList_C_OnChangeFilterType__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_OnChangeFilterType__DelegateSignature) == 0x000008, "Wrong size on ChatLogWindowList_C_OnChangeFilterType__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_OnChangeFilterType__DelegateSignature, InType) == 0x000000, "Member 'ChatLogWindowList_C_OnChangeFilterType__DelegateSignature::InType' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_OnChangeFilterType__DelegateSignature, InDetailType) == 0x000004, "Member 'ChatLogWindowList_C_OnChangeFilterType__DelegateSignature::InDetailType' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.OnChatLogTabCloseRequest__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature final
{
public:
	ESBChatLogWindowSlot                          RequestSlot;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature, RequestSlot) == 0x000000, "Member 'ChatLogWindowList_C_OnChatLogTabCloseRequest__DelegateSignature::RequestSlot' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.OnChangeChatUnreadNotify__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature final
{
public:
	bool                                          Param_IsChatUnreadNotify;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature, Param_IsChatUnreadNotify) == 0x000000, "Member 'ChatLogWindowList_C_OnChangeChatUnreadNotify__DelegateSignature::Param_IsChatUnreadNotify' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.OnChangeUnreadVisible__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature, Param_IsVisible) == 0x000000, "Member 'ChatLogWindowList_C_OnChangeUnreadVisible__DelegateSignature::Param_IsVisible' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.ExecuteUbergraph_ChatLogWindowList
// 0x00C0 (0x00C0 - 0x0000)
struct ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4737[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_12;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_11;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_10;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_9;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_8;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_7;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_6;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_5;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_4;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_3;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_2;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsChecked;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4738[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBChatUIMessage                       K2Node_CustomEvent_InMess;                         // 0x0020(0x0070)()
	bool                                          K2Node_CustomEvent_bRecieve;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsScrollEndListView_Ret;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4739[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_473A[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCreateChat_ReturnValue;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsScrollEndListView_Ret_1;                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBChatLogWindowSlot                          CallFunc_Get_Tab_Type_to_Slot_Slot;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList) == 0x000008, "Wrong alignment on ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList");
static_assert(sizeof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList) == 0x0000C0, "Wrong size on ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, EntryPoint) == 0x000000, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_12) == 0x00000C, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_12' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_11) == 0x00000D, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_11' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_10) == 0x00000E, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_10' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_9) == 0x00000F, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_9' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_8) == 0x000010, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_8' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_7) == 0x000011, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_7' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_6) == 0x000012, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_6' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_5) == 0x000013, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_5' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_4) == 0x000014, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_4' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_3) == 0x000015, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_3' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_2) == 0x000016, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_2' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_IsVisible_ReturnValue) == 0x000017, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked_1) == 0x000018, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_IsChecked) == 0x000019, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_IsChecked' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_CustomEvent_InMess) == 0x000020, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_CustomEvent_InMess' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_CustomEvent_bRecieve) == 0x000090, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_CustomEvent_bRecieve' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_IsScrollEndListView_Ret) == 0x000091, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_IsScrollEndListView_Ret' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_GetPlayerId_ReturnValue) == 0x000098, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0000A8, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, K2Node_ComponentBoundEvent_Widget) == 0x0000B0, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_IsCreateChat_ReturnValue) == 0x0000B8, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_IsCreateChat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_BooleanOR_ReturnValue) == 0x0000B9, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_IsScrollEndListView_Ret_1) == 0x0000BA, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_IsScrollEndListView_Ret_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000BB, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList, CallFunc_Get_Tab_Type_to_Slot_Slot) == 0x0000BC, "Member 'ChatLogWindowList_C_ExecuteUbergraph_ChatLogWindowList::CallFunc_Get_Tab_Type_to_Slot_Slot' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature) == 0x000008, "Wrong size on ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature, Widget) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__LogListView_K2Node_ComponentBoundEvent_0_OnListEntryGeneratedDynamic__DelegateSignature::Widget' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.OnReciveMessage
// 0x0078 (0x0078 - 0x0000)
struct ChatLogWindowList_C_OnReciveMessage final
{
public:
	struct FSBChatUIMessage                       InMess;                                            // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bRecieve;                                          // 0x0070(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_OnReciveMessage) == 0x000008, "Wrong alignment on ChatLogWindowList_C_OnReciveMessage");
static_assert(sizeof(ChatLogWindowList_C_OnReciveMessage) == 0x000078, "Wrong size on ChatLogWindowList_C_OnReciveMessage");
static_assert(offsetof(ChatLogWindowList_C_OnReciveMessage, InMess) == 0x000000, "Member 'ChatLogWindowList_C_OnReciveMessage::InMess' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_OnReciveMessage, bRecieve) == 0x000070, "Member 'ChatLogWindowList_C_OnReciveMessage::bRecieve' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_2_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogWindowList_ChatLogFilterBattle_1_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_2_K2Node_ComponentBoundEvent_5_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_1_K2Node_ComponentBoundEvent_4_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterSystem_0_K2Node_ComponentBoundEvent_3_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_1_K2Node_ComponentBoundEvent_2_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterCommunication_0_K2Node_ComponentBoundEvent_1_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterBattle_0_K2Node_ComponentBoundEvent_0_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterItem_4_K2Node_ComponentBoundEvent_539_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterItem_3_K2Node_ComponentBoundEvent_523_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterItem_2_K2Node_ComponentBoundEvent_508_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterItem_1_K2Node_ComponentBoundEvent_494_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature");
static_assert(sizeof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature");
static_assert(offsetof(ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'ChatLogWindowList_C_BndEvt__ChatLogFilterItem_0_K2Node_ComponentBoundEvent_493_EventCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.Init
// 0x0018 (0x0018 - 0x0000)
struct ChatLogWindowList_C_Init final
{
public:
	class UUMG_ChatLogWindow_C*                   InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InFilterType;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDetailFilterType;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBChatLogTabType                             InTabType;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewLocalVar_0;                                     // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_Init) == 0x000008, "Wrong alignment on ChatLogWindowList_C_Init");
static_assert(sizeof(ChatLogWindowList_C_Init) == 0x000018, "Wrong size on ChatLogWindowList_C_Init");
static_assert(offsetof(ChatLogWindowList_C_Init, InWidget) == 0x000000, "Member 'ChatLogWindowList_C_Init::InWidget' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_Init, InFilterType) == 0x000008, "Member 'ChatLogWindowList_C_Init::InFilterType' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_Init, InDetailFilterType) == 0x00000C, "Member 'ChatLogWindowList_C_Init::InDetailFilterType' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_Init, InTabType) == 0x000010, "Member 'ChatLogWindowList_C_Init::InTabType' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_Init, NewLocalVar_0) == 0x000011, "Member 'ChatLogWindowList_C_Init::NewLocalVar_0' has a wrong offset!");

// Function ChatLogWindowList.ChatLogWindowList_C.InitFilterCheckBox
// 0x00C0 (0x00C0 - 0x0000)
struct ChatLogWindowList_C_InitFilterCheckBox final
{
public:
	TArray<class UChatLogFilterItem_C*>           SystemLogDetailList;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Cnt;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_473B[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_473C[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_473D[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_473E[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_473F[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4740[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4741[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4742[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4743[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UChatLogFilterItem_C*>           K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4744[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatLogFilterItem_C*                   CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4745[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4746[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4747[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatLogFilterItem_C*                   K2Node_DynamicCast_AsChat_Log_Filter_Item;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatLogWindowList_C_InitFilterCheckBox) == 0x000008, "Wrong alignment on ChatLogWindowList_C_InitFilterCheckBox");
static_assert(sizeof(ChatLogWindowList_C_InitFilterCheckBox) == 0x0000C0, "Wrong size on ChatLogWindowList_C_InitFilterCheckBox");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, SystemLogDetailList) == 0x000000, "Member 'ChatLogWindowList_C_InitFilterCheckBox::SystemLogDetailList' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, Cnt) == 0x000010, "Member 'ChatLogWindowList_C_InitFilterCheckBox::Cnt' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, Temp_int_Variable) == 0x000014, "Member 'ChatLogWindowList_C_InitFilterCheckBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, Temp_int_Variable_1) == 0x000018, "Member 'ChatLogWindowList_C_InitFilterCheckBox::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001C, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_GetValidValue_ReturnValue) == 0x000024, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000025, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00002C, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, K2Node_SwitchEnum_CmpSuccess) == 0x00002D, "Member 'ChatLogWindowList_C_InitFilterCheckBox::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000030, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_MakeLiteralInt_ReturnValue) == 0x000034, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, Temp_int_Variable_2) == 0x000038, "Member 'ChatLogWindowList_C_InitFilterCheckBox::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, Temp_int_Variable_3) == 0x00003C, "Member 'ChatLogWindowList_C_InitFilterCheckBox::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x000040, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_GetValidValue_ReturnValue_1) == 0x000048, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x000049, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00004C, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1) == 0x000050, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, K2Node_SwitchEnum_CmpSuccess_1) == 0x000051, "Member 'ChatLogWindowList_C_InitFilterCheckBox::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000054, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x00005C, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Less_IntInt_ReturnValue_2) == 0x000068, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, K2Node_MakeArray_Array) == 0x000070, "Member 'ChatLogWindowList_C_InitFilterCheckBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Array_Get_Item) == 0x000088, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_And_IntInt_ReturnValue) == 0x000094, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000098, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_Add_IntInt_ReturnValue_3) == 0x00009C, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_GetChildAt_ReturnValue) == 0x0000A0, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatLogWindowList_C_InitFilterCheckBox, CallFunc_And_IntInt_ReturnValue_1) == 0x0000A8, "Member 'ChatLogWindowList_C_InitFilterCheckBox::CallFunc_And_IntInt_ReturnValue_1' has a wrong offset!");
