#pragma once

 

// Package: ChatSettingRadioBtn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.OnChange__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ChatSettingRadioBtn_C_OnChange__DelegateSignature final
{
public:
	int32                                         InSelectBtnId;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatSettingRadioBtn_C_OnChange__DelegateSignature) == 0x000004, "Wrong alignment on ChatSettingRadioBtn_C_OnChange__DelegateSignature");
static_assert(sizeof(ChatSettingRadioBtn_C_OnChange__DelegateSignature) == 0x000004, "Wrong size on ChatSettingRadioBtn_C_OnChange__DelegateSignature");
static_assert(offsetof(ChatSettingRadioBtn_C_OnChange__DelegateSignature, InSelectBtnId) == 0x000000, "Member 'ChatSettingRadioBtn_C_OnChange__DelegateSignature::InSelectBtnId' has a wrong offset!");

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.ExecuteUbergraph_ChatSettingRadioBtn
// 0x0068 (0x0068 - 0x0000)
struct ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_4;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_5;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_6;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_7;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4626[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default_1;                           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue;              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_1;            // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4627[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4628[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCanvasPanel*>                   K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCanvasPanel*                           CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default_4;                           // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                K2Node_Select_Default_5;                           // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_2;            // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue_3;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn) == 0x000008, "Wrong alignment on ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn");
static_assert(sizeof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn) == 0x000068, "Wrong size on ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, EntryPoint) == 0x000000, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable) == 0x000005, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable) == 0x000006, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_1) == 0x000007, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_1) == 0x000008, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_2) == 0x000009, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_3) == 0x00000A, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_2) == 0x00000B, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000D, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_3) == 0x00000E, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_4) == 0x00000F, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_5) == 0x000010, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_4) == 0x000011, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_6) == 0x000012, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_byte_Variable_7) == 0x000013, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_5) == 0x000014, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_int_Array_Index_Variable) == 0x000018, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000024, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000025, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_6) == 0x000026, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000027, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_7) == 0x000028, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000029, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_ComponentBoundEvent_bIsChecked_3) == 0x00002A, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_ComponentBoundEvent_bIsChecked_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x00002B, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default) == 0x00002C, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_1) == 0x00002D, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_GetCheckedState_ReturnValue) == 0x00002E, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_GetCheckedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_GetCheckedState_ReturnValue_1) == 0x00002F, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_GetCheckedState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000031, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_2) == 0x000032, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000033, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, Temp_bool_Variable_8) == 0x000034, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_Array_Get_Item) == 0x000035, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_MakeArray_Array) == 0x000040, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000058, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000059, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_3) == 0x00005A, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_4) == 0x00005B, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_ComponentBoundEvent_bIsChecked) == 0x00005C, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_5) == 0x00005D, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_GetCheckedState_ReturnValue_2) == 0x00005E, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_GetCheckedState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00005F, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_GetCheckedState_ReturnValue_3) == 0x000060, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_GetCheckedState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000061, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_6) == 0x000062, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_7) == 0x000063, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000064, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn, K2Node_Select_Default_8) == 0x000065, "Member 'ChatSettingRadioBtn_C_ExecuteUbergraph_ChatSettingRadioBtn::K2Node_Select_Default_8' has a wrong offset!");

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_3_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'ChatSettingRadioBtn_C_BndEvt__ChatSettingRadioBtn_RadioBtn_2_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_OFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'ChatSettingRadioBtn_C_BndEvt__UnreadNotifyRadioBtn_RadioBtn_ON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function ChatSettingRadioBtn.ChatSettingRadioBtn_C.InitBtnSetting
// 0x001C (0x001C - 0x0000)
struct ChatSettingRadioBtn_C_InitBtnSetting final
{
public:
	int32                                         BtnId;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InEnable;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_4;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                K2Node_Select_Default_1;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_5;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_6;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default_2;                           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_7;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                K2Node_Select_Default_3;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChatSettingRadioBtn_C_InitBtnSetting) == 0x000004, "Wrong alignment on ChatSettingRadioBtn_C_InitBtnSetting");
static_assert(sizeof(ChatSettingRadioBtn_C_InitBtnSetting) == 0x00001C, "Wrong size on ChatSettingRadioBtn_C_InitBtnSetting");
static_assert(offsetof(ChatSettingRadioBtn_C_InitBtnSetting, BtnId) == 0x000000, "Member 'ChatSettingRadioBtn_C_InitBtnSetting::BtnId' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_InitBtnSetting, InEnable) == 0x000004, "Member 'ChatSettingRadioBtn_C_InitBtnSetting::InEnable' has a wrong offset!");
static_assert(offsetof(ChatSettingRadioBtn_C_InitBtnSetting, Temp_byte_Variable) == 0x000005, "Member 'ChatSettingRadioBtn_C_InitBtnSetting::Temp_byte_Variable' has a wrong offset!");
