#pragma once

 

// Package: ClassAbilityInfoForBattleSetTop

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.OnClassAbilityIconClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature final
{
public:
	int32                                         InSkillSlotId;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSkillId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature) == 0x000004, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature) == 0x000008, "Wrong size on ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature, InSkillSlotId) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature::InSkillSlotId' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature, InSkillId) == 0x000004, "Member 'ClassAbilityInfoForBattleSetTop_C_OnClassAbilityIconClicked__DelegateSignature::InSkillId' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.ExecuteUbergraph_ClassAbilityInfoForBattleSetTop
// 0x0018 (0x0018 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_InClassAbilityId;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_823E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_InClassAbilityId_3;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_InClassAbilityId_2;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_InClassAbilityId_1;     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop) == 0x000004, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop) == 0x000018, "Wrong size on ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop, EntryPoint) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop, K2Node_ComponentBoundEvent_InClassAbilityId) == 0x000004, "Member 'ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop::K2Node_ComponentBoundEvent_InClassAbilityId' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop, K2Node_Event_IsDesignTime) == 0x000008, "Member 'ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop, K2Node_ComponentBoundEvent_InClassAbilityId_3) == 0x00000C, "Member 'ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop::K2Node_ComponentBoundEvent_InClassAbilityId_3' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop, K2Node_ComponentBoundEvent_InClassAbilityId_2) == 0x000010, "Member 'ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop::K2Node_ComponentBoundEvent_InClassAbilityId_2' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop, K2Node_ComponentBoundEvent_InClassAbilityId_1) == 0x000014, "Member 'ClassAbilityInfoForBattleSetTop_C_ExecuteUbergraph_ClassAbilityInfoForBattleSetTop::K2Node_ComponentBoundEvent_InClassAbilityId_1' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature final
{
public:
	int32                                         InClassAbilityId;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature) == 0x000004, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature) == 0x000004, "Wrong size on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature, InClassAbilityId) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon2_K2Node_ComponentBoundEvent_4_OnIconClicked__DelegateSignature::InClassAbilityId' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature final
{
public:
	int32                                         InClassAbilityId;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature) == 0x000004, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature) == 0x000004, "Wrong size on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature, InClassAbilityId) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassCommonAbilityIcon1_K2Node_ComponentBoundEvent_3_OnIconClicked__DelegateSignature::InClassAbilityId' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature final
{
public:
	int32                                         InClassAbilityId;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature) == 0x000004, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature) == 0x000004, "Wrong size on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature, InClassAbilityId) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon2_K2Node_ComponentBoundEvent_2_OnIconClicked__DelegateSignature::InClassAbilityId' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature final
{
public:
	int32                                         InClassAbilityId;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature) == 0x000004, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature) == 0x000004, "Wrong size on ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature, InClassAbilityId) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_BndEvt__MyCharaMenu_ClassAbilityInfoForBattleSet_ClassUniqueAbilityIcon1_K2Node_ComponentBoundEvent_1_OnIconClicked__DelegateSignature::InClassAbilityId' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_PreConstruct) == 0x000001, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_PreConstruct");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_PreConstruct) == 0x000001, "Wrong size on ClassAbilityInfoForBattleSetTop_C_PreConstruct");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.Const
// 0x0010 (0x0010 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_Const final
{
public:
	TArray<class UMyCharaMenu_ClassAbilityIconBtnForBattleSet_C*> K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_Const) == 0x000008, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_Const");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_Const) == 0x000010, "Wrong size on ClassAbilityInfoForBattleSetTop_C_Const");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_Const, K2Node_MakeArray_Array) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_Const::K2Node_MakeArray_Array' has a wrong offset!");

// Function ClassAbilityInfoForBattleSetTop.ClassAbilityInfoForBattleSetTop_C.SetupClassAbilityInfo
// 0x0120 (0x0120 - 0x0000)
struct ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo final
{
public:
	int32                                         LocalClassSharedAbilityUsableSlotNum;              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillLevel;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillId;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_823F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   LocalMasterDataManager;                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillIconCnt;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  LocalClassType;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8240[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalClassLevel;                                   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8241[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8242[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassSharedAbilitySlotUsableLevel_ReturnValue; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClassSharedAbilitySlotUsableLevel_ReturnValue_1; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetPlayerClassType_ClassType;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8243[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassSharedAbilityUsableSlotNum_ReturnValue; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8244[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetClassLevel_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8245[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentSkillLevel_ReturnValue;         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8246[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableConditionSkill_Enable;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillMasteryParam_IsExists;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8247[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillMasteryParam                   CallFunc_GetSkillMasteryParam_ReturnValue;         // 0x007C(0x0008)(NoDestructor)
	bool                                          CallFunc_FindSkillDataDataBySkillId_IsExists;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8248[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataDataBySkillId_ReturnValue;   // 0x0088(0x0058)()
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_1;           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8249[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_2;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_3;           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_824A[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_ClassAbilityIconBtnForBattleSet_C* CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824B[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_ClassAbilityIconBtnForBattleSet_C* CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_824C[0x2];                                     // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo) == 0x000008, "Wrong alignment on ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo");
static_assert(sizeof(ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo) == 0x000120, "Wrong size on ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo, LocalClassSharedAbilityUsableSlotNum) == 0x000000, "Member 'ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo::LocalClassSharedAbilityUsableSlotNum' has a wrong offset!");
static_assert(offsetof(ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo, LocalSkillLevel) == 0x000004, "Member 'ClassAbilityInfoForBattleSetTop_C_SetupClassAbilityInfo::LocalSkillLevel' has a wrong offset!");
