#pragma once

 

// Package: CmnAlertIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function CmnAlertIcon.CmnAlertIcon_C.ExecuteUbergraph_CmnAlertIcon
// 0x0008 (0x0008 - 0x0000)
struct CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon) == 0x000004, "Wrong alignment on CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon");
static_assert(sizeof(CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon) == 0x000008, "Wrong size on CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon");
static_assert(offsetof(CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon, EntryPoint) == 0x000000, "Member 'CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CmnAlertIcon_C_ExecuteUbergraph_CmnAlertIcon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CmnAlertIcon.CmnAlertIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CmnAlertIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnAlertIcon_C_PreConstruct) == 0x000001, "Wrong alignment on CmnAlertIcon_C_PreConstruct");
static_assert(sizeof(CmnAlertIcon_C_PreConstruct) == 0x000001, "Wrong size on CmnAlertIcon_C_PreConstruct");
static_assert(offsetof(CmnAlertIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CmnAlertIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CmnAlertIcon.CmnAlertIcon_C.ResetIconToDefault
// 0x0001 (0x0001 - 0x0000)
struct CmnAlertIcon_C_ResetIconToDefault final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnAlertIcon_C_ResetIconToDefault) == 0x000001, "Wrong alignment on CmnAlertIcon_C_ResetIconToDefault");
static_assert(sizeof(CmnAlertIcon_C_ResetIconToDefault) == 0x000001, "Wrong size on CmnAlertIcon_C_ResetIconToDefault");
static_assert(offsetof(CmnAlertIcon_C_ResetIconToDefault, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CmnAlertIcon_C_ResetIconToDefault::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CmnAlertIcon.CmnAlertIcon_C.SetAlertType
// 0x0001 (0x0001 - 0x0000)
struct CmnAlertIcon_C_SetAlertType final
{
public:
	bool                                          Param_IsYellow;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnAlertIcon_C_SetAlertType) == 0x000001, "Wrong alignment on CmnAlertIcon_C_SetAlertType");
static_assert(sizeof(CmnAlertIcon_C_SetAlertType) == 0x000001, "Wrong size on CmnAlertIcon_C_SetAlertType");
static_assert(offsetof(CmnAlertIcon_C_SetAlertType, Param_IsYellow) == 0x000000, "Member 'CmnAlertIcon_C_SetAlertType::Param_IsYellow' has a wrong offset!");

// Function CmnAlertIcon.CmnAlertIcon_C.SetAlertTypeYellow
// 0x0001 (0x0001 - 0x0000)
struct CmnAlertIcon_C_SetAlertTypeYellow final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnAlertIcon_C_SetAlertTypeYellow) == 0x000001, "Wrong alignment on CmnAlertIcon_C_SetAlertTypeYellow");
static_assert(sizeof(CmnAlertIcon_C_SetAlertTypeYellow) == 0x000001, "Wrong size on CmnAlertIcon_C_SetAlertTypeYellow");
static_assert(offsetof(CmnAlertIcon_C_SetAlertTypeYellow, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CmnAlertIcon_C_SetAlertTypeYellow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CmnAlertIcon.CmnAlertIcon_C.SetAlertTypeRed
// 0x0001 (0x0001 - 0x0000)
struct CmnAlertIcon_C_SetAlertTypeRed final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnAlertIcon_C_SetAlertTypeRed) == 0x000001, "Wrong alignment on CmnAlertIcon_C_SetAlertTypeRed");
static_assert(sizeof(CmnAlertIcon_C_SetAlertTypeRed) == 0x000001, "Wrong size on CmnAlertIcon_C_SetAlertTypeRed");
static_assert(offsetof(CmnAlertIcon_C_SetAlertTypeRed, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CmnAlertIcon_C_SetAlertTypeRed::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

