#pragma once

 

// Package: CmnExpOverflowRewardIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function CmnExpOverflowRewardIcon.CmnExpOverflowRewardIcon_C.ExecuteUbergraph_CmnExpOverflowRewardIcon
// 0x0004 (0x0004 - 0x0000)
struct CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon) == 0x000004, "Wrong alignment on CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon");
static_assert(sizeof(CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon) == 0x000004, "Wrong size on CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon, EntryPoint) == 0x000000, "Member 'CmnExpOverflowRewardIcon_C_ExecuteUbergraph_CmnExpOverflowRewardIcon::EntryPoint' has a wrong offset!");

// Function CmnExpOverflowRewardIcon.CmnExpOverflowRewardIcon_C.SetIconType
// 0x000F (0x000F - 0x0000)
struct CmnExpOverflowRewardIcon_C_SetIconType final
{
public:
	bool                                          bInIsClassLevelCounterStop;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInIsClassLevelLimit;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInIsClassLevelLimitSmallerThanCounterStop;        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInIsNoTooltip;                                    // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalIsNoTooltip;                                 // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalUpdateTooltip;                               // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalNewClassLevelLimit;                          // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalNewClassLevelCounterStop;                    // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnExpOverflowRewardIcon_C_SetIconType) == 0x000001, "Wrong alignment on CmnExpOverflowRewardIcon_C_SetIconType");
static_assert(sizeof(CmnExpOverflowRewardIcon_C_SetIconType) == 0x00000F, "Wrong size on CmnExpOverflowRewardIcon_C_SetIconType");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bInIsClassLevelCounterStop) == 0x000000, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bInIsClassLevelCounterStop' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bInIsClassLevelLimit) == 0x000001, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bInIsClassLevelLimit' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bInIsClassLevelLimitSmallerThanCounterStop) == 0x000002, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bInIsClassLevelLimitSmallerThanCounterStop' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bInIsNoTooltip) == 0x000003, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bInIsNoTooltip' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bLocalIsNoTooltip) == 0x000004, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bLocalIsNoTooltip' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bLocalUpdateTooltip) == 0x000005, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bLocalUpdateTooltip' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bLocalNewClassLevelLimit) == 0x000006, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bLocalNewClassLevelLimit' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, bLocalNewClassLevelCounterStop) == 0x000007, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::bLocalNewClassLevelCounterStop' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_Not_PreBool_ReturnValue_1) == 0x00000A, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00000B, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x00000C, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_SetIconType, CallFunc_IsValid_ReturnValue) == 0x00000E, "Member 'CmnExpOverflowRewardIcon_C_SetIconType::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CmnExpOverflowRewardIcon.CmnExpOverflowRewardIcon_C.CreateTooltip
// 0x0028 (0x0028 - 0x0000)
struct CmnExpOverflowRewardIcon_C_CreateTooltip final
{
public:
	bool                                          bInUpdateTooltip;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInIsNoTooltip;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalUpdateTooltip;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_766D[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipDetail_Variable_C*    K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Detail_Variable; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_766E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipDetail_Variable_C*    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CmnExpOverflowRewardIcon_C_CreateTooltip) == 0x000008, "Wrong alignment on CmnExpOverflowRewardIcon_C_CreateTooltip");
static_assert(sizeof(CmnExpOverflowRewardIcon_C_CreateTooltip) == 0x000028, "Wrong size on CmnExpOverflowRewardIcon_C_CreateTooltip");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, bInUpdateTooltip) == 0x000000, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::bInUpdateTooltip' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, bInIsNoTooltip) == 0x000001, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::bInIsNoTooltip' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, bLocalUpdateTooltip) == 0x000002, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::bLocalUpdateTooltip' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, CallFunc_Not_PreBool_ReturnValue_1) == 0x000004, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Detail_Variable) == 0x000008, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Detail_Variable' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CmnExpOverflowRewardIcon_C_CreateTooltip, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CmnExpOverflowRewardIcon_C_CreateTooltip::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

