#pragma once

 

// Package: CommonIconToolTipContent_Weapon

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.ExecuteUbergraph_CommonIconToolTipContent_Weapon
// 0x0008 (0x0008 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon) == 0x000004, "Wrong alignment on CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon) == 0x000008, "Wrong size on CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon, EntryPoint) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon, K2Node_Event_IsDesignTime) == 0x000005, "Member 'CommonIconToolTipContent_Weapon_C_ExecuteUbergraph_CommonIconToolTipContent_Weapon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_PreConstruct) == 0x000001, "Wrong alignment on CommonIconToolTipContent_Weapon_C_PreConstruct");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_PreConstruct) == 0x000001, "Wrong size on CommonIconToolTipContent_Weapon_C_PreConstruct");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.SetToolTipWeapon
// 0x0238 (0x0238 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_SetToolTipWeapon final
{
public:
	struct FSBWeaponMasterData                    InWeaponMasterData;                                // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 InItemUniqueId;                                    // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InStorageId;                                       // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEffectiveDisplay;                                // 0x00C4(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InForceLevelSyncOff;                               // 0x00C5(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9448[0x2];                                     // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBCharacterWeaponPerkData>     LocalPerkList;                                     // 0x00C8(0x0010)(Edit, BlueprintVisible)
	struct FSBWeaponItemData                      LocalWeaponData;                                   // 0x00D8(0x0050)(Edit, BlueprintVisible)
	bool                                          bLocalForceLevelSyncOff;                           // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalIsEffectiveDisplay;                          // 0x0129(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9449[0x2];                                     // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalStorageNumber;                                // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBWeaponMasterData                    LocalWeaponMasterData;                             // 0x0130(0x00B0)(Edit, BlueprintVisible)
	struct FSBWeaponItemData                      CallFunc_GetFindWeaponData_WeaponData;             // 0x01E0(0x0050)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon) == 0x000008, "Wrong alignment on CommonIconToolTipContent_Weapon_C_SetToolTipWeapon");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon) == 0x000238, "Wrong size on CommonIconToolTipContent_Weapon_C_SetToolTipWeapon");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, InWeaponMasterData) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::InWeaponMasterData' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, InItemUniqueId) == 0x0000B0, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::InItemUniqueId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, InStorageId) == 0x0000C0, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::InStorageId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, IsEffectiveDisplay) == 0x0000C4, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::IsEffectiveDisplay' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, InForceLevelSyncOff) == 0x0000C5, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::InForceLevelSyncOff' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, LocalPerkList) == 0x0000C8, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::LocalPerkList' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, LocalWeaponData) == 0x0000D8, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::LocalWeaponData' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, bLocalForceLevelSyncOff) == 0x000128, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::bLocalForceLevelSyncOff' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, bLocalIsEffectiveDisplay) == 0x000129, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::bLocalIsEffectiveDisplay' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, LocalStorageNumber) == 0x00012C, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::LocalStorageNumber' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, LocalWeaponMasterData) == 0x000130, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::LocalWeaponMasterData' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, CallFunc_GetFindWeaponData_WeaponData) == 0x0001E0, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::CallFunc_GetFindWeaponData_WeaponData' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetToolTipWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x000230, "Member 'CommonIconToolTipContent_Weapon_C_SetToolTipWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.SetLevelSync
// 0x05A0 (0x05A0 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_SetLevelSync final
{
public:
	class FString                                 InUniqueId;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESBClassType                                  LocalWeaponClassType;                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  LocalCurrPlayerClassType;                          // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_944A[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalFinalWeaponLevel;                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsWeaponInStorage;                            // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_944B[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           LocalOwnItemInfo;                                  // 0x0020(0x0118)(Edit, BlueprintVisible)
	struct FSlateColor                            LocalTextColor;                                    // 0x0138(0x0028)(Edit, BlueprintVisible)
	class FString                                 TmpUniqueId;                                       // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_944C[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponManager_IsValid;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_944D[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWeaponManager*                       CallFunc_GetWeaponManager_ReturnValue;             // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_944E[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponManager_IsValid_1;               // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_944F[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWeaponManager*                       CallFunc_GetWeaponManager_ReturnValue_1;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBStackBEnableType                           CallFunc_GetStackBEnableType_OutStackBEnableType;  // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9450[0x2];                                     // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue_1; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9451[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01C0(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9452[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9453[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponClassTypeByUniqueId_OutIsValid;  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetWeaponClassTypeByUniqueId_OutClassType; // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9454[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevelSyncTarget_ReturnValue;           // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelSyncApplied_ReturnValue;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_1;            // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9455[0x5];                                     // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0210(0x0018)()
	int32                                         CallFunc_GetClassLevelFromClassType_ReturnValue;   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9456[0x3];                                     // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassLevel_ReturnValue;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9457[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0238(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync;       // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9458[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync_1;     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync_2;     // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync_3;     // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync_4;     // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync_5;     // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x026E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x026F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default_1;                           // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9459[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue_1;        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945A[0x5];                                     // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x0288(0x0118)(ConstParm)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945B[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945C[0x7];                                     // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue_1;            // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponMasterData_IsExists;             // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945D[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_GetWeaponMasterData_ReturnValue;          // 0x03D0(0x00B0)()
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist_1;       // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945E[0x6];                                     // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1;     // 0x0488(0x0118)(ConstParm)
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_SetLevelSync) == 0x000008, "Wrong alignment on CommonIconToolTipContent_Weapon_C_SetLevelSync");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_SetLevelSync) == 0x0005A0, "Wrong size on CommonIconToolTipContent_Weapon_C_SetLevelSync");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, InUniqueId) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::InUniqueId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, LocalWeaponClassType) == 0x000010, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::LocalWeaponClassType' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, LocalCurrPlayerClassType) == 0x000011, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::LocalCurrPlayerClassType' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, LocalFinalWeaponLevel) == 0x000014, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::LocalFinalWeaponLevel' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, LocalIsWeaponInStorage) == 0x000018, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::LocalIsWeaponInStorage' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, LocalOwnItemInfo) == 0x000020, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::LocalOwnItemInfo' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, LocalTextColor) == 0x000138, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::LocalTextColor' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, TmpUniqueId) == 0x000160, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::TmpUniqueId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_MakeLiteralByte_ReturnValue) == 0x000172, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000173, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetPlayerController_ReturnValue) == 0x000178, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponManager_IsValid) == 0x000180, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponManager_IsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponManager_ReturnValue) == 0x000188, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_MakeLiteralBool_ReturnValue) == 0x000190, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetPlayerController_ReturnValue_1) == 0x000198, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponManager_IsValid_1) == 0x0001A0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponManager_IsValid_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponManager_ReturnValue_1) == 0x0001A8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue) == 0x0001B0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_2) == 0x0001B4, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetStackBEnableType_OutStackBEnableType) == 0x0001B5, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetStackBEnableType_OutStackBEnableType' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue_1) == 0x0001B8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_3) == 0x0001BC, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_Conv_IntToText_ReturnValue) == 0x0001C0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0001D8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_4) == 0x0001D9, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_5) == 0x0001DA, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0001DB, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetEquipmentBag_ReturnValue) == 0x0001E0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetClassType_ReturnValue) == 0x0001E8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetCharacterStorage_ReturnValue) == 0x0001F0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetCharacterStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetSBPlayerCharacter_ReturnValue) == 0x0001F8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetSBPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponClassTypeByUniqueId_OutIsValid) == 0x000200, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponClassTypeByUniqueId_OutIsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponClassTypeByUniqueId_OutClassType) == 0x000201, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponClassTypeByUniqueId_OutClassType' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetLevelSyncTarget_ReturnValue) == 0x000204, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetLevelSyncTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsLevelSyncApplied_ReturnValue) == 0x000208, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsLevelSyncApplied_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_6) == 0x000209, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_MakeLiteralBool_ReturnValue_1) == 0x00020A, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_MakeLiteralBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000210, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetClassLevelFromClassType_ReturnValue) == 0x000228, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetClassLevelFromClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, Temp_bool_Variable) == 0x00022C, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetClassLevel_ReturnValue) == 0x000230, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetClassLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetText_ReturnValue) == 0x000238, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_Conv_TextToString_ReturnValue) == 0x000250, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_ChangeWeaponLevelSync_bIsLevelSync) == 0x000260, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_ChangeWeaponLevelSync_bIsLevelSync' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_Conv_StringToInt_ReturnValue) == 0x000264, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_ChangeWeaponLevelSync_bIsLevelSync_1) == 0x000268, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_ChangeWeaponLevelSync_bIsLevelSync_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_ChangeWeaponLevelSync_bIsLevelSync_2) == 0x000269, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_ChangeWeaponLevelSync_bIsLevelSync_2' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_ChangeWeaponLevelSync_bIsLevelSync_3) == 0x00026A, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_ChangeWeaponLevelSync_bIsLevelSync_3' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, K2Node_Select_Default) == 0x00026B, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_ChangeWeaponLevelSync_bIsLevelSync_4) == 0x00026C, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_ChangeWeaponLevelSync_bIsLevelSync_4' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_ChangeWeaponLevelSync_bIsLevelSync_5) == 0x00026D, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_ChangeWeaponLevelSync_bIsLevelSync_5' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, Temp_bool_Variable_1) == 0x00026E, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00026F, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, K2Node_Select_Default_1) == 0x000270, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, Temp_bool_Variable_2) == 0x000274, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetCharacterStorage_ReturnValue_1) == 0x000278, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetCharacterStorage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, K2Node_Select_Default_2) == 0x000280, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_7) == 0x000281, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x000282, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x000288, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetNetworkDataCache_IsValid) == 0x0003A0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetNetworkDataCache_IsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetNetworkDataCache_ReturnValue) == 0x0003A8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetMasterDataManager_IsValid) == 0x0003B0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetMasterDataManager_ReturnValue) == 0x0003B8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetEquipmentBag_ReturnValue_1) == 0x0003C0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetEquipmentBag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponMasterData_IsExists) == 0x0003C8, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_GetWeaponMasterData_ReturnValue) == 0x0003D0, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_GetWeaponMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_IsValid_ReturnValue_8) == 0x000480, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_BP_FindItem_ByUniqueId_bOutExist_1) == 0x000481, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_BP_FindItem_ByUniqueId_bOutExist_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetLevelSync, CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1) == 0x000488, "Member 'CommonIconToolTipContent_Weapon_C_SetLevelSync::CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.SetAttributePower
// 0x0020 (0x0020 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_SetAttributePower final
{
public:
	int32                                         InAttributePower;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_945F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_SetAttributePower) == 0x000008, "Wrong alignment on CommonIconToolTipContent_Weapon_C_SetAttributePower");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_SetAttributePower) == 0x000020, "Wrong size on CommonIconToolTipContent_Weapon_C_SetAttributePower");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetAttributePower, InAttributePower) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_SetAttributePower::InAttributePower' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetAttributePower, CallFunc_MakeLiteralBool_ReturnValue) == 0x000004, "Member 'CommonIconToolTipContent_Weapon_C_SetAttributePower::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetAttributePower, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'CommonIconToolTipContent_Weapon_C_SetAttributePower::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetAttributePower, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'CommonIconToolTipContent_Weapon_C_SetAttributePower::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.ResetToDefaultTextColor
// 0x0090 (0x0090 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor final
{
public:
	struct FSlateColor                            LocalTextColor;                                    // 0x0000(0x0028)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9460[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9461[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9462[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9463[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0068(0x0028)()
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor) == 0x000008, "Wrong alignment on CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor) == 0x000090, "Wrong size on CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, LocalTextColor) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::LocalTextColor' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, Temp_int_Array_Index_Variable) == 0x000028, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, K2Node_MakeArray_Array) == 0x000038, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, CallFunc_Array_Get_Item) == 0x000050, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor, K2Node_MakeStruct_SlateColor) == 0x000068, "Member 'CommonIconToolTipContent_Weapon_C_ResetToDefaultTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.SetPlayerProfileWeaponData
// 0x0050 (0x0050 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData final
{
public:
	struct FSBWeaponItemData                      Param_PlayerProfileWeaponData;                     // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData) == 0x000008, "Wrong alignment on CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData");
static_assert(sizeof(CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData) == 0x000050, "Wrong size on CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData");
static_assert(offsetof(CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData, Param_PlayerProfileWeaponData) == 0x000000, "Member 'CommonIconToolTipContent_Weapon_C_SetPlayerProfileWeaponData::Param_PlayerProfileWeaponData' has a wrong offset!");

// Function CommonIconToolTipContent_Weapon.CommonIconToolTipContent_Weapon_C.SetPlayerProfileToolTipWeapon
// 0x05B0 (0x05B0 - 0x0000)
struct CommonIconToolTipContent_Weapon_C_SetPlayerProfileToolTipWeapon final
{
public:
	struct FSBWeaponMasterData                    InWeaponMasterData;                                // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 InItemUniqueId;                                    // 0x00B0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InStorageId;                                       // 0x00C0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEffectiveDisplay;                                // 0x00C4(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InForceLevelSyncOff;                               // 0x00C5(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalForceLevelSyncOff;                            // 0x00C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9464[0x1];                                     // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStackBWeaponParam                   LocalStackBWeaponParam;                            // 0x00C8(0x0030)(Edit, BlueprintVisible)
	int32                                         LocalArrayId;                                      // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9465[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  LocalValueStackBFlagArray;                         // 0x0100(0x0010)(Edit, BlueprintVisible)
	TArray<class UTextBlock*>                     LocalValueTextObjArray;                            // 0x0110(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          LocalAPStackB;                                     // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9466[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalAP;                                           // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBStackBEnableType                           LocalStackBEnableType;                             // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9467[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalStackBNum;                                    // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOwnItemInfo                           LocalOwnItemInfo;                                  // 0x0130(0x0118)(Edit, BlueprintVisible)
	int32                                         StorageNumber;                                     // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsTermLimitVisible;                           // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsWeaponAbilityVisible;                       // 0x024D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9468[0x2];                                     // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponItemData                      WeaponData;                                        // 0x0250(0x0050)(Edit, BlueprintVisible)
	struct FSBWeaponMasterData                    WeaponMasterData;                                  // 0x02A0(0x00B0)(Edit, BlueprintVisible)
	int32                                         TmpDescTextId;                                     // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpNameTextId;                                     // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TmpTextTableName;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9469[0x6];                                     // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStackBWeaponParamByWeaponId_IsValid;   // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_946A[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStackBWeaponParam                   CallFunc_GetStackBWeaponParamByWeaponId_ReturnValue; // 0x0378(0x0030)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item;                           // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWeaponManager_IsValid;                 // 0x03AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_946B[0x1];                                     // 0x03AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWeaponManager*                       CallFunc_GetWeaponManager_ReturnValue;             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_946C[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item_1;                         // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_946D[0x3];                                     // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
