#pragma once

 

// Package: CommonImagineAbilityEfficacyDescPopup

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup
// 0x00C8 (0x00C8 - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922A[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922B[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922C[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_CustomEvent_InAnchorWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InArrowUp;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetUIPosition_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToViewport_PixelPosition;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToViewport_ViewportPosition;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_922E[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup) == 0x000008, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup) == 0x0000C8, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, EntryPoint) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, Temp_bool_Variable) == 0x000004, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, Temp_float_Variable) == 0x000008, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, Temp_float_Variable_1) == 0x00000C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, Temp_bool_Variable_1) == 0x000010, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, Temp_float_Variable_2) == 0x000014, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, Temp_float_Variable_3) == 0x000018, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, K2Node_Event_IsDesignTime) == 0x00001D, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, K2Node_CustomEvent_InAnchorWidget) == 0x000020, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::K2Node_CustomEvent_InAnchorWidget' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, K2Node_CustomEvent_InArrowUp) == 0x000028, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::K2Node_CustomEvent_InArrowUp' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, K2Node_Select_Default) == 0x000038, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, K2Node_Select_Default_1) == 0x00003C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000040, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_GetUIPosition_ReturnValue) == 0x000048, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_GetUIPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_GetSize_ReturnValue) == 0x000050, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_AbsoluteToViewport_PixelPosition) == 0x000058, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_AbsoluteToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_AbsoluteToViewport_ViewportPosition) == 0x000060, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_AbsoluteToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_BreakVector2D_X) == 0x000068, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_BreakVector2D_Y) == 0x00006C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000070, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000078, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_GetViewportScale_ReturnValue) == 0x000080, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_GetAlignment_ReturnValue) == 0x000084, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x00008C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_BreakVector2D_X_1) == 0x000094, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_BreakVector2D_Y_1) == 0x000098, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_BreakVector2D_X_2) == 0x00009C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_BreakVector2D_Y_2) == 0x0000A0, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_MakeVector2D_ReturnValue) == 0x0000A4, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000AC, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B0, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'CommonImagineAbilityEfficacyDescPopup_C_ExecuteUbergraph_CommonImagineAbilityEfficacyDescPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.SetPopupPosition
// 0x0010 (0x0010 - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition final
{
public:
	class UWidget*                                InAnchorWidget;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InArrowUp;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition) == 0x000008, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition) == 0x000010, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition, InAnchorWidget) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition::InAnchorWidget' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition, InArrowUp) == 0x000008, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetPopupPosition::InArrowUp' has a wrong offset!");

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_PreConstruct) == 0x000001, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_PreConstruct");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_PreConstruct) == 0x000001, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_PreConstruct");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.Setup
// 0x0008 (0x0008 - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_Setup final
{
public:
	int32                                         InAbilityEffectId;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_Setup) == 0x000004, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_Setup");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_Setup) == 0x000008, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_Setup");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_Setup, InAbilityEffectId) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_Setup::InAbilityEffectId' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_Setup, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'CommonImagineAbilityEfficacyDescPopup_C_Setup::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.SetArrowVisibility
// 0x0050 (0x0050 - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility final
{
public:
	bool                                          InIsVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_922F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USizeBox*>                       LocalSizeBoxes;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9230[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USizeBox*                               CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9231[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9232[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9233[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USizeBox*>                       K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility) == 0x000008, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility) == 0x000050, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, InIsVisible) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::InIsVisible' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, LocalSizeBoxes) == 0x000008, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::LocalSizeBoxes' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, Temp_int_Array_Index_Variable) == 0x000018, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, CallFunc_Array_Get_Item) == 0x000020, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility, K2Node_MakeArray_Array) == 0x000040, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowVisibility::K2Node_MakeArray_Array' has a wrong offset!");

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.SetArrowType
// 0x000B (0x000B - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_SetArrowType final
{
public:
	bool                                          InArrowUp;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType) == 0x000001, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_SetArrowType");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType) == 0x00000B, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_SetArrowType");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, InArrowUp) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::InArrowUp' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, Temp_byte_Variable) == 0x000001, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, Temp_byte_Variable_1) == 0x000002, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, Temp_bool_Variable) == 0x000003, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, Temp_byte_Variable_2) == 0x000004, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, Temp_byte_Variable_3) == 0x000005, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, Temp_bool_Variable_1) == 0x000006, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, CallFunc_IsValid_ReturnValue_1) == 0x000008, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, K2Node_Select_Default) == 0x000009, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetArrowType, K2Node_Select_Default_1) == 0x00000A, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetArrowType::K2Node_Select_Default_1' has a wrong offset!");

// Function CommonImagineAbilityEfficacyDescPopup.CommonImagineAbilityEfficacyDescPopup_C.SetupByUniqueId
// 0x0180 (0x0180 - 0x0000)
struct CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId final
{
public:
	class FString                                 UniqueId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9234[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9235[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9236[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x0068(0x0118)(ConstParm)
};
static_assert(alignof(CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId) == 0x000008, "Wrong alignment on CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId");
static_assert(sizeof(CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId) == 0x000180, "Wrong size on CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId, UniqueId) == 0x000000, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId::UniqueId' has a wrong offset!");
static_assert(offsetof(CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId, K2Node_MakeArray_Array) == 0x000010, "Member 'CommonImagineAbilityEfficacyDescPopup_C_SetupByUniqueId::K2Node_MakeArray_Array' has a wrong offset!");
