#pragma once

 

// Package: CommonIconToolTip

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_ToolTipInfo_structs.hpp"


namespace SDK::Params
{

// Function CommonIconToolTip.CommonIconToolTip_C.ExecuteUbergraph_CommonIconToolTip
// 0x0038 (0x0038 - 0x0000)
struct CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C3D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C3E[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip) == 0x000008, "Wrong alignment on CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip");
static_assert(sizeof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip) == 0x000038, "Wrong size on CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, EntryPoint) == 0x000000, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::EntryPoint' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, Temp_int_Array_Index_Variable) == 0x000018, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, CallFunc_Array_Get_Item) == 0x000020, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_ExecuteUbergraph_CommonIconToolTip::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateContentsInfo
// 0x0080 (0x0080 - 0x0000)
struct CommonIconToolTip_C_CreateContentsInfo final
{
public:
	struct FST_ToolTipInfo                        InToolTipInfo;                                     // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonIconToolTip_C_CreateContentsInfo) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateContentsInfo");
static_assert(sizeof(CommonIconToolTip_C_CreateContentsInfo) == 0x000080, "Wrong size on CommonIconToolTip_C_CreateContentsInfo");
static_assert(offsetof(CommonIconToolTip_C_CreateContentsInfo, InToolTipInfo) == 0x000000, "Member 'CommonIconToolTip_C_CreateContentsInfo::InToolTipInfo' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateContentsInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'CommonIconToolTip_C_CreateContentsInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipItem
// 0x0038 (0x0038 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipItem final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUnidentified;                                     // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C3F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Item_C*       Swap;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Item_C*       K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C40[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Item_C*       CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipItem) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipItem");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipItem) == 0x000038, "Wrong size on CommonIconToolTip_C_CreateToolTipItem");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, InItemIndex) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipItem::InItemIndex' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, bUnidentified) == 0x000004, "Member 'CommonIconToolTip_C_CreateToolTipItem::bUnidentified' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, Swap) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipItem::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'CommonIconToolTip_C_CreateToolTipItem::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipItem::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'CommonIconToolTip_C_CreateToolTipItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, CallFunc_Create_ReturnValue) == 0x000028, "Member 'CommonIconToolTip_C_CreateToolTipItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipItem, CallFunc_AddChildToCanvas_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipItem::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipWeapon
// 0x0050 (0x0050 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipWeapon final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C41[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InUniqueId;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InStorageNumber;                                   // 0x0018(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C42[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Item_C*       Swap;                                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Item_C*       CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Item_C*       K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C43[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipWeapon) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipWeapon");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipWeapon) == 0x000050, "Wrong size on CommonIconToolTip_C_CreateToolTipWeapon");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, InItemIndex) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::InItemIndex' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, InUniqueId) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::InUniqueId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, InStorageNumber) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::InStorageNumber' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, Swap) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, CallFunc_Create_ReturnValue) == 0x000028, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item) == 0x000038, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon, CallFunc_AddChildToCanvas_ReturnValue) == 0x000048, "Member 'CommonIconToolTip_C_CreateToolTipWeapon::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipWeapon_Details
// 0x0110 (0x0110 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipWeapon_Details final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C44[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InItemUniqueId;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InStorageId;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEffectiveDisplay;                                // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InForceLevelSyncOff;                               // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C45[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Weapon_C*     Swap;                                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Weapon_C*     CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Weapon_C*     K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Weapon; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C46[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponMasterData_IsExists;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C47[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_GetWeaponMasterData_ReturnValue;          // 0x0060(0x00B0)()
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipWeapon_Details) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipWeapon_Details");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipWeapon_Details) == 0x000110, "Wrong size on CommonIconToolTip_C_CreateToolTipWeapon_Details");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, InItemIndex) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::InItemIndex' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, InItemUniqueId) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::InItemUniqueId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, InStorageId) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::InStorageId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, IsEffectiveDisplay) == 0x00001C, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::IsEffectiveDisplay' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, InForceLevelSyncOff) == 0x00001D, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::InForceLevelSyncOff' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, Swap) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_Create_ReturnValue) == 0x000028, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Weapon) == 0x000038, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Weapon' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_GetMasterDataManager_IsValid) == 0x000042, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_GetMasterDataManager_ReturnValue) == 0x000048, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_AddChildToCanvas_ReturnValue) == 0x000050, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_GetWeaponMasterData_IsExists) == 0x000058, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_GetWeaponMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipWeapon_Details, CallFunc_GetWeaponMasterData_ReturnValue) == 0x000060, "Member 'CommonIconToolTip_C_CreateToolTipWeapon_Details::CallFunc_GetWeaponMasterData_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipCostume
// 0x0038 (0x0038 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipCostume final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C48[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Item_C*       Swap;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Item_C*       CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Item_C*       K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C49[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipCostume) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipCostume");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipCostume) == 0x000038, "Wrong size on CommonIconToolTip_C_CreateToolTipCostume");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, InItemIndex) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipCostume::InItemIndex' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, Swap) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipCostume::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'CommonIconToolTip_C_CreateToolTipCostume::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipCostume::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipCostume::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CommonIconToolTip_C_CreateToolTipCostume::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'CommonIconToolTip_C_CreateToolTipCostume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipCostume, CallFunc_AddChildToCanvas_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipCostume::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipMoney
// 0x0068 (0x0068 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipMoney final
{
public:
	int32                                         InAmount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InAmountText;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonIconToolTipContent_Money_C*      Swap;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Money_C*      K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Money; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C4B[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Money_C*      CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipMoney) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipMoney");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipMoney) == 0x000068, "Wrong size on CommonIconToolTip_C_CreateToolTipMoney");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, InAmount) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipMoney::InAmount' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, OptionText) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipMoney::OptionText' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, InAmountText) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipMoney::InAmountText' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, Swap) == 0x000038, "Member 'CommonIconToolTip_C_CreateToolTipMoney::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'CommonIconToolTip_C_CreateToolTipMoney::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Money) == 0x000048, "Member 'CommonIconToolTip_C_CreateToolTipMoney::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Money' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CommonIconToolTip_C_CreateToolTipMoney::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'CommonIconToolTip_C_CreateToolTipMoney::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, CallFunc_Create_ReturnValue) == 0x000058, "Member 'CommonIconToolTip_C_CreateToolTipMoney::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipMoney, CallFunc_AddChildToCanvas_ReturnValue) == 0x000060, "Member 'CommonIconToolTip_C_CreateToolTipMoney::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipEmotion
// 0x00A0 (0x00A0 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipEmotion final
{
public:
	class FName                                   InId;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIndex;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipText_Variable_C*      Swap;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidStampEmoteTermUpdate_ReturnValue;    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindEmoteMaster_bIsValid;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C4D[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEmoteMasterData                     CallFunc_FindEmoteMaster_EmoteMaster;              // 0x0020(0x0028)()
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetEventTermEndTime_OutEndTime;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEventTermEndTime_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C4E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipText_Variable_C*      CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C4F[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipText_Variable_C*      K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Text_Variable; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C50[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Select_Default;                             // 0x0088(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C51[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipEmotion) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipEmotion");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipEmotion) == 0x0000A0, "Wrong size on CommonIconToolTip_C_CreateToolTipEmotion");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, InId) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::InId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, InIndex) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::InIndex' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, Swap) == 0x000010, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_ValidStampEmoteTermUpdate_ReturnValue) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_ValidStampEmoteTermUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_FindEmoteMaster_bIsValid) == 0x000019, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_FindEmoteMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_FindEmoteMaster_EmoteMaster) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_FindEmoteMaster_EmoteMaster' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_DateTimeMinValue_ReturnValue) == 0x000048, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_GetEventTermEndTime_OutEndTime) == 0x000050, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_GetEventTermEndTime_OutEndTime' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_GetEventTermEndTime_ReturnValue) == 0x000058, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_GetEventTermEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_Create_ReturnValue) == 0x000060, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_GetChildAt_ReturnValue) == 0x000068, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, Temp_bool_Variable) == 0x000070, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Text_Variable) == 0x000078, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Text_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, K2Node_Select_Default) == 0x000088, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipEmotion, CallFunc_AddChildToCanvas_ReturnValue) == 0x000098, "Member 'CommonIconToolTip_C_CreateToolTipEmotion::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipStamp
// 0x00C0 (0x00C0 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipStamp final
{
public:
	int32                                         InStampId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C52[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipText_Variable_C*      Swap;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonToolTipText_Variable_C*      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetStampIDToCategoryNameAndStampI_ReturnValue; // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C53[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStampDataByStampId_IsExists;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C54[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStampMasterData                     CallFunc_FindStampDataByStampId_ReturnValue;       // 0x0068(0x0020)()
	struct FDateTime                              CallFunc_GetEventTermEndTime_OutEndTime;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEventTermEndTime_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ValidStampEmoteTermUpdate_ReturnValue;    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C55[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_Select_Default;                             // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonToolTipText_Variable_C*      K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Text_Variable; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C56[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipStamp) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipStamp");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipStamp) == 0x0000C0, "Wrong size on CommonIconToolTip_C_CreateToolTipStamp");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, InStampId) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipStamp::InStampId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, Swap) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipStamp::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_Create_ReturnValue) == 0x000010, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_GetStampIDToCategoryNameAndStampI_ReturnValue) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_GetStampIDToCategoryNameAndStampI_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_GetMasterDataManager_IsValid) == 0x000048, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_GetMasterDataManager_ReturnValue) == 0x000050, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_DateTimeMinValue_ReturnValue) == 0x000058, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_FindStampDataByStampId_IsExists) == 0x000060, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_FindStampDataByStampId_IsExists' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_FindStampDataByStampId_ReturnValue) == 0x000068, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_FindStampDataByStampId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_GetEventTermEndTime_OutEndTime) == 0x000088, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_GetEventTermEndTime_OutEndTime' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_GetEventTermEndTime_ReturnValue) == 0x000090, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_GetEventTermEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_ValidStampEmoteTermUpdate_ReturnValue) == 0x000091, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_ValidStampEmoteTermUpdate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, Temp_bool_Variable) == 0x000092, "Member 'CommonIconToolTip_C_CreateToolTipStamp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, K2Node_Select_Default) == 0x000098, "Member 'CommonIconToolTip_C_CreateToolTipStamp::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_GetChildAt_ReturnValue) == 0x0000A0, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Text_Variable) == 0x0000A8, "Member 'CommonIconToolTip_C_CreateToolTipStamp::K2Node_DynamicCast_AsWBP_Common_Tool_Tip_Text_Variable' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'CommonIconToolTip_C_CreateToolTipStamp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_IsValid_ReturnValue) == 0x0000B1, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipStamp, CallFunc_AddChildToCanvas_ReturnValue) == 0x0000B8, "Member 'CommonIconToolTip_C_CreateToolTipStamp::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipContributionPoint
// 0x0038 (0x0038 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipContributionPoint final
{
public:
	int32                                         InAmount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C57[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Single_C*     Swap;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Single_C*     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Single_C*     K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Single; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C58[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipContributionPoint) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipContributionPoint");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipContributionPoint) == 0x000038, "Wrong size on CommonIconToolTip_C_CreateToolTipContributionPoint");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, InAmount) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::InAmount' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, Swap) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, CallFunc_Create_ReturnValue) == 0x000010, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Single) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Single' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipContributionPoint, CallFunc_AddChildToCanvas_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipContributionPoint::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipImagine
// 0x0058 (0x0058 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipImagine final
{
public:
	int32                                         InImagineItemId;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C59[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InUniqueId;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InStorageNumber;                                   // 0x0018(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C5A[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Item_C*       Swap;                                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_Item_C*       K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C5B[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIconToolTipContent_Item_C*       CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CommonIconToolTip_C_CreateToolTipImagine) == 0x000008, "Wrong alignment on CommonIconToolTip_C_CreateToolTipImagine");
static_assert(sizeof(CommonIconToolTip_C_CreateToolTipImagine) == 0x000058, "Wrong size on CommonIconToolTip_C_CreateToolTipImagine");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, InImagineItemId) == 0x000000, "Member 'CommonIconToolTip_C_CreateToolTipImagine::InImagineItemId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, InUniqueId) == 0x000008, "Member 'CommonIconToolTip_C_CreateToolTipImagine::InUniqueId' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, InStorageNumber) == 0x000018, "Member 'CommonIconToolTip_C_CreateToolTipImagine::InStorageNumber' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, Swap) == 0x000020, "Member 'CommonIconToolTip_C_CreateToolTipImagine::Swap' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, Widget) == 0x000028, "Member 'CommonIconToolTip_C_CreateToolTipImagine::Widget' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'CommonIconToolTip_C_CreateToolTipImagine::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item) == 0x000038, "Member 'CommonIconToolTip_C_CreateToolTipImagine::K2Node_DynamicCast_AsCommon_Icon_Tool_Tip_Content_Item' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CommonIconToolTip_C_CreateToolTipImagine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'CommonIconToolTip_C_CreateToolTipImagine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, CallFunc_Create_ReturnValue) == 0x000048, "Member 'CommonIconToolTip_C_CreateToolTipImagine::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonIconToolTip_C_CreateToolTipImagine, CallFunc_AddChildToCanvas_ReturnValue) == 0x000050, "Member 'CommonIconToolTip_C_CreateToolTipImagine::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function CommonIconToolTip.CommonIconToolTip_C.CreateToolTipImagine_AcDetails
// 0x0118 (0x0118 - 0x0000)
struct CommonIconToolTip_C_CreateToolTipImagine_AcDetails final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C5C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InUniqueId;                                        // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bInIsImageIconActive;                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
