#pragma once

 

// Package: CommonEquipmentBasicStatusParts

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InventoryData_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InventoryItemData_structs.hpp"


namespace SDK::Params
{

// Function CommonEquipmentBasicStatusParts.CommonEquipmentBasicStatusParts_C.SetupByOwnItemInfo
// 0x0240 (0x0240 - 0x0000)
struct CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo final
{
public:
	struct FOwnItemInfo                           InOwnItemInfo;                                     // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          InIsForStorage;                                    // 0x0118(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsForStorage;                                 // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8117[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           LocalOwnItemInfo;                                  // 0x0120(0x0118)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo) == 0x000008, "Wrong alignment on CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo");
static_assert(sizeof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo) == 0x000240, "Wrong size on CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo, InOwnItemInfo) == 0x000000, "Member 'CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo::InOwnItemInfo' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo, InIsForStorage) == 0x000118, "Member 'CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo::InIsForStorage' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo, LocalIsForStorage) == 0x000119, "Member 'CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo::LocalIsForStorage' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo, LocalOwnItemInfo) == 0x000120, "Member 'CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo::LocalOwnItemInfo' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000238, "Member 'CommonEquipmentBasicStatusParts_C_SetupByOwnItemInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function CommonEquipmentBasicStatusParts.CommonEquipmentBasicStatusParts_C.SetupWeaponStatusByOwnItemInfo
// 0x08A0 (0x08A0 - 0x0000)
struct CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo final
{
public:
	struct FOwnItemInfo                           InOwnItemInfo;                                     // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          InIsForStorage;                                    // 0x0118(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsStatusValueStackB;                          // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8118[0x6];                                     // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStackBWeaponParam                   LocaStackBWeaponParam;                             // 0x0120(0x0030)(Edit, BlueprintVisible)
	bool                                          LocalIsStackB;                                     // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8119[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalStackBNum;                                    // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBStackBEnableType                           LocalStackBEnableType;                             // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsLevelSync;                                  // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsWeaponInStorage;                            // 0x015A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811A[0x5];                                     // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LocalSPEffectValue;                                // 0x0160(0x0018)(Edit, BlueprintVisible)
	class FText                                   LocalSPEffectName;                                 // 0x0178(0x0018)(Edit, BlueprintVisible)
	class FString                                 LocalWeaponUniqueId;                               // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UGenericStatusItemForBattleSet_C*       LocalStatusItem;                                   // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             LocalStatusValueTxt;                               // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalWeaponStatusValue;                            // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBWeaponStatus                               LocalWeaponStatus;                                 // 0x01B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811B[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWeaponManager*                       LocalWeaponManager;                                // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsTermLimited;                                // 0x01C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBAttribute                                  LocalWeaponAttribute;                              // 0x01C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811C[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    LocalWeaponMaster;                                 // 0x01C8(0x00B0)(Edit, BlueprintVisible)
	struct FInventoryItemData                     LocalInventoryItemData;                            // 0x0278(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSBWeaponItemData                      LocalWeaponData;                                   // 0x02D8(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x032F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811D[0x2];                                     // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811E[0x6];                                     // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStackBWeaponParamByWeaponId_IsValid;   // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811F[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStackBWeaponParam                   CallFunc_GetStackBWeaponParamByWeaponId_ReturnValue; // 0x0358(0x0030)(ConstParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStackBEnableColor_OutIsStackBEnableFull; // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetStackBNum_ReturnValue;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBStackBEnableType                           CallFunc_GetStackBEnableType_OutStackBEnableType;  // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItemLevelSyncWeaponStorageItem_ReturnValue; // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItemLevelSyncWeapon_ReturnValue;     // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0397(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x039B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8120[0x3];                                     // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGenericStatusItemForBattleSet_C*       Temp_object_Variable;                              // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8121[0x5];                                     // 0x03AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8122[0x7];                                     // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x03C8(0x0118)(ConstParm)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist_1;       // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8123[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1;     // 0x04E8(0x0118)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8124[0x6];                                     // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0608(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_1;            // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8125[0x6];                                     // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGenericStatusItemForBattleSet_C*       Temp_object_Variable_1;                            // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGenericStatusItemForBattleSet_C*       Temp_object_Variable_2;                            // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGenericStatusItemForBattleSet_C*       Temp_object_Variable_3;                            // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGenericStatusItemForBattleSet_C*       Temp_object_Variable_4;                            // 0x0640(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBWeaponStatus                               Temp_byte_Variable_2;                              // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x064D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8126[0x2];                                     // 0x064E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBWeaponStatus                               Temp_byte_Variable_3;                              // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0655(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8127[0x2];                                     // 0x0656(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8128[0x3];                                     // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0660(0x0018)()
	class FText                                   CallFunc_Add_Plus_Text_Return;                     // 0x0678(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8129[0x7];                                     // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SetSpecialEffectText_SpecialName;         // 0x0698(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SetSpecialEffectText_SpecialValue;        // 0x06A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x06C0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x06DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x06DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812A[0x4];                                     // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x06E0(0x0018)()
	class UGenericStatusItemForBattleSet_C*       K2Node_Select_Default_3;                           // 0x06F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0701(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeWeaponLevelSync_bIsLevelSync;       // 0x0702(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0703(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0704(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0705(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0706(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue;                  // 0x0707(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_2;            // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812B[0x7];                                     // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0710(0x0018)()
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812C[0x3];                                     // 0x072D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue; // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponManager_IsValid;                 // 0x073C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812D[0x3];                                     // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWeaponManager*                       CallFunc_GetWeaponManager_ReturnValue;             // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x074A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsedItem_bUse;                          // 0x074B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindWeaponMaster_bIsValid;                // 0x074D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812E[0x2];                                     // 0x074E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_FindWeaponMaster_WeaponMaster;            // 0x0750(0x00B0)()
	struct FInventoryData                         CallFunc_CreateInventoryData_InventoryData;        // 0x0800(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_CreateInventoryData_IsSuccess;            // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo) == 0x000008, "Wrong alignment on CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo");
static_assert(sizeof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo) == 0x0008A0, "Wrong size on CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, InOwnItemInfo) == 0x000000, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::InOwnItemInfo' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, InIsForStorage) == 0x000118, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::InIsForStorage' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalIsStatusValueStackB) == 0x000119, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalIsStatusValueStackB' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocaStackBWeaponParam) == 0x000120, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocaStackBWeaponParam' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalIsStackB) == 0x000150, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalIsStackB' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalStackBNum) == 0x000154, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalStackBNum' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalStackBEnableType) == 0x000158, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalStackBEnableType' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalIsLevelSync) == 0x000159, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalIsLevelSync' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalIsWeaponInStorage) == 0x00015A, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalIsWeaponInStorage' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalSPEffectValue) == 0x000160, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalSPEffectValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalSPEffectName) == 0x000178, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalSPEffectName' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponUniqueId) == 0x000190, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponUniqueId' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalStatusItem) == 0x0001A0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalStatusItem' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalStatusValueTxt) == 0x0001A8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalStatusValueTxt' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponStatusValue) == 0x0001B0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponStatusValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponStatus) == 0x0001B4, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponStatus' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponManager) == 0x0001B8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponManager' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalIsTermLimited) == 0x0001C0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalIsTermLimited' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponAttribute) == 0x0001C1, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponAttribute' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponMaster) == 0x0001C8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponMaster' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalInventoryItemData) == 0x000278, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalInventoryItemData' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, LocalWeaponData) == 0x0002D8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::LocalWeaponData' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_int_Variable) == 0x000328, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_IntToByte_ReturnValue) == 0x00032C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetValidValue_ReturnValue) == 0x00032D, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00032E, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_SwitchEnum_CmpSuccess) == 0x00032F, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_int_Variable_1) == 0x000330, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000334, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000338, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000339, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00033C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_bool_Variable) == 0x000340, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetMasterDataManager_IsValid) == 0x000341, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetMasterDataManager_ReturnValue) == 0x000348, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetStackBWeaponParamByWeaponId_IsValid) == 0x000350, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetStackBWeaponParamByWeaponId_IsValid' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetStackBWeaponParamByWeaponId_ReturnValue) == 0x000358, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetStackBWeaponParamByWeaponId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000388, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_SetStackBEnableColor_OutIsStackBEnableFull) == 0x000389, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_SetStackBEnableColor_OutIsStackBEnableFull' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_BooleanAND_ReturnValue) == 0x00038A, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x00038B, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetStackBNum_ReturnValue) == 0x00038C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetStackBNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetStackBEnableType_OutStackBEnableType) == 0x000390, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetStackBEnableType_OutStackBEnableType' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue) == 0x000391, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_CheckItemLevelSyncWeaponStorageItem_ReturnValue) == 0x000392, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_CheckItemLevelSyncWeaponStorageItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_CheckItemLevelSyncWeapon_ReturnValue) == 0x000393, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_CheckItemLevelSyncWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000394, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Not_PreBool_ReturnValue_1) == 0x000395, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_Select_Default) == 0x000396, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000397, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_1) == 0x000398, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_byte_Variable) == 0x000399, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00039A, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_byte_Variable_1) == 0x00039B, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_bool_Variable_1) == 0x00039C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_object_Variable) == 0x0003A0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x0003A8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0003A9, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_2) == 0x0003AA, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetCharacterStorage_ReturnValue) == 0x0003B0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetCharacterStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetEquipmentBag_ReturnValue) == 0x0003B8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x0003C0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x0003C8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_BP_FindItem_ByUniqueId_bOutExist_1) == 0x0004E0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_BP_FindItem_ByUniqueId_bOutExist_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1) == 0x0004E8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Not_PreBool_ReturnValue_2) == 0x000600, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_MakeLiteralBool_ReturnValue) == 0x000601, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000608, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000620, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_MakeLiteralBool_ReturnValue_1) == 0x000621, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_MakeLiteralBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_object_Variable_1) == 0x000628, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_object_Variable_2) == 0x000630, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_object_Variable_3) == 0x000638, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_object_Variable_4) == 0x000640, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_int_Variable_2) == 0x000648, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_byte_Variable_2) == 0x00064C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_3) == 0x00064D, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_int_Variable_3) == 0x000650, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_byte_Variable_3) == 0x000654, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_4) == 0x000655, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_Select_Default_1) == 0x000658, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00065C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000660, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Add_Plus_Text_Return) == 0x000678, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Add_Plus_Text_Return' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_5) == 0x000690, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_SetSpecialEffectText_SpecialName) == 0x000698, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_SetSpecialEffectText_SpecialName' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_SetSpecialEffectText_SpecialValue) == 0x0006A8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_SetSpecialEffectText_SpecialValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0006C0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_6) == 0x0006D8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_7) == 0x0006D9, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, Temp_bool_Variable_2) == 0x0006DA, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_8) == 0x0006DB, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_Select_Default_2) == 0x0006E0, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_Select_Default_3) == 0x0006F8, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_9) == 0x000700, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_SwitchEnum_CmpSuccess_1) == 0x000701, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_ChangeWeaponLevelSync_bIsLevelSync) == 0x000702, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_ChangeWeaponLevelSync_bIsLevelSync' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_10) == 0x000703, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, K2Node_Select_Default_4) == 0x000704, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_11) == 0x000705, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_12) == 0x000706, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_SetDateTime_ReturnValue) == 0x000707, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_SetDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_MakeLiteralBool_ReturnValue_2) == 0x000708, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_MakeLiteralBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000710, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_MakeLiteralInt_ReturnValue) == 0x000728, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00072C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetPlayerController_ReturnValue) == 0x000730, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue) == 0x000738, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetWeaponLevelStatusByUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetWeaponManager_IsValid) == 0x00073C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetWeaponManager_IsValid' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_GetWeaponManager_ReturnValue) == 0x000740, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_GetWeaponManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_13) == 0x000748, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_14) == 0x000749, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_15) == 0x00074A, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsUsedItem_bUse) == 0x00074B, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsUsedItem_bUse' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_IsValid_ReturnValue_16) == 0x00074C, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_FindWeaponMaster_bIsValid) == 0x00074D, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_FindWeaponMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_FindWeaponMaster_WeaponMaster) == 0x000750, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_FindWeaponMaster_WeaponMaster' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_CreateInventoryData_InventoryData) == 0x000800, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_CreateInventoryData_InventoryData' has a wrong offset!");
static_assert(offsetof(CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo, CallFunc_CreateInventoryData_IsSuccess) == 0x000898, "Member 'CommonEquipmentBasicStatusParts_C_SetupWeaponStatusByOwnItemInfo::CallFunc_CreateInventoryData_IsSuccess' has a wrong offset!");

// Function CommonEquipmentBasicStatusParts.CommonEquipmentBasicStatusParts_C.SetupImagineStatusByOwnItemInfo
// 0x09C8 (0x09C8 - 0x0000)
struct CommonEquipmentBasicStatusParts_C_SetupImagineStatusByOwnItemInfo final
{
public:
	struct FOwnItemInfo                           InOwnItemInfo;                                     // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          InIsForStorage;                                    // 0x0118(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsStatusValueStackB;                          // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsIntStackB;                                  // 0x011A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
