#pragma once

 

// Package: Config_GraphicsCS

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "GraphicsSetting_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GraphicsSliderSetting_structs.hpp"


namespace SDK::Params
{

// Function Config_GraphicsCS.Config_GraphicsCS_C.On_Cmb_ViewLimit_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0");
static_assert(sizeof(Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0) == 0x000038, "Wrong size on Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0");
static_assert(offsetof(Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0, Item) == 0x000000, "Member 'Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'Config_GraphicsCS_C_On_Cmb_ViewLimit_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.On_Preset_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct Config_GraphicsCS_C_On_Preset_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(Config_GraphicsCS_C_On_Preset_GenerateWidget_0) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_On_Preset_GenerateWidget_0");
static_assert(sizeof(Config_GraphicsCS_C_On_Preset_GenerateWidget_0) == 0x000038, "Wrong size on Config_GraphicsCS_C_On_Preset_GenerateWidget_0");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_0, Item) == 0x000000, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.InitializePlayerSave
// 0x0070 (0x0070 - 0x0000)
struct Config_GraphicsCS_C_InitializePlayerSave final
{
public:
	class USBConfigureSaveManager*                Manager;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerId;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUltimateSkillPerformance_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_857C[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlwaysShowFieldHUD_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleImagineCutinPerformance_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowOtherNamePlate_ReturnValue;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowPartyNamePlate_ReturnValue;         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBConfigSaveDataResult                       CallFunc_LoadGraphicsConfigData_Result;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_857D[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBConfigureSaveData_Graphics          CallFunc_LoadGraphicsConfigData_ReturnValue;       // 0x0030(0x002C)(NoDestructor)
	bool                                          CallFunc_IsLoadedGraphicsConfigData_ReturnValue;   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_857E[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_GraphicsCS_C_InitializePlayerSave) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_InitializePlayerSave");
static_assert(sizeof(Config_GraphicsCS_C_InitializePlayerSave) == 0x000070, "Wrong size on Config_GraphicsCS_C_InitializePlayerSave");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, Manager) == 0x000000, "Member 'Config_GraphicsCS_C_InitializePlayerSave::Manager' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, PlayerId) == 0x000008, "Member 'Config_GraphicsCS_C_InitializePlayerSave::PlayerId' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_IsUltimateSkillPerformance_ReturnValue) == 0x000018, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_IsUltimateSkillPerformance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_GetConfigSaveManager_IsValid) == 0x000019, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000020, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_IsAlwaysShowFieldHUD_ReturnValue) == 0x000028, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_IsAlwaysShowFieldHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_IsBattleImagineCutinPerformance_ReturnValue) == 0x000029, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_IsBattleImagineCutinPerformance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_IsShowOtherNamePlate_ReturnValue) == 0x00002A, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_IsShowOtherNamePlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_IsShowPartyNamePlate_ReturnValue) == 0x00002B, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_IsShowPartyNamePlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_LoadGraphicsConfigData_Result) == 0x00002C, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_LoadGraphicsConfigData_Result' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_LoadGraphicsConfigData_ReturnValue) == 0x000030, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_LoadGraphicsConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_IsLoadedGraphicsConfigData_ReturnValue) == 0x00005C, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_IsLoadedGraphicsConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_InitializePlayerSave, CallFunc_GetPlayerId_ReturnValue) == 0x000060, "Member 'Config_GraphicsCS_C_InitializePlayerSave::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.FindPresetData
// 0x00C0 (0x00C0 - 0x0000)
struct Config_GraphicsCS_C_FindPresetData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGraphicsSetting                       K2Node_MakeStruct_GraphicsSetting;                 // 0x001C(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_857F[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8580[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8581[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8582[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGraphicsSetting                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_FindPresetData) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_FindPresetData");
static_assert(sizeof(Config_GraphicsCS_C_FindPresetData) == 0x0000C0, "Wrong size on Config_GraphicsCS_C_FindPresetData");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, Key) == 0x000000, "Member 'Config_GraphicsCS_C_FindPresetData::Key' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Config_GraphicsCS_C_FindPresetData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Config_GraphicsCS_C_FindPresetData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, K2Node_MakeStruct_GraphicsSetting) == 0x00001C, "Member 'Config_GraphicsCS_C_FindPresetData::K2Node_MakeStruct_GraphicsSetting' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Array_Get_Item) == 0x000060, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Map_Find_Value) == 0x000074, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_Map_Find_ReturnValue) == 0x00007C, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A8, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000AA, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000AB, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000AC, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0000AD, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x0000AE, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x0000AF, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x0000B0, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x0000B1, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B3, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_2) == 0x0000B4, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_3) == 0x0000B5, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_4) == 0x0000B6, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_5) == 0x0000B7, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_6) == 0x0000B8, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_7) == 0x0000B9, "Member 'Config_GraphicsCS_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.On_Preset_GenerateWidget_1
// 0x0038 (0x0038 - 0x0000)
struct Config_GraphicsCS_C_On_Preset_GenerateWidget_1 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(Config_GraphicsCS_C_On_Preset_GenerateWidget_1) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_On_Preset_GenerateWidget_1");
static_assert(sizeof(Config_GraphicsCS_C_On_Preset_GenerateWidget_1) == 0x000038, "Wrong size on Config_GraphicsCS_C_On_Preset_GenerateWidget_1");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_1, Item) == 0x000000, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_1::Item' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_1, ReturnValue) == 0x000010, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_1, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_1::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_On_Preset_GenerateWidget_1, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'Config_GraphicsCS_C_On_Preset_GenerateWidget_1::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_PreConstruct) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_PreConstruct");
static_assert(sizeof(Config_GraphicsCS_C_PreConstruct) == 0x000001, "Wrong size on Config_GraphicsCS_C_PreConstruct");
static_assert(offsetof(Config_GraphicsCS_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Config_GraphicsCS_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.SelectPreset
// 0x0018 (0x0018 - 0x0000)
struct Config_GraphicsCS_C_SelectPreset final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_GraphicsCS_C_SelectPreset) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_SelectPreset");
static_assert(sizeof(Config_GraphicsCS_C_SelectPreset) == 0x000018, "Wrong size on Config_GraphicsCS_C_SelectPreset");
static_assert(offsetof(Config_GraphicsCS_C_SelectPreset, SelectedItem) == 0x000000, "Member 'Config_GraphicsCS_C_SelectPreset::SelectedItem' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_SelectPreset, SelectionType) == 0x000010, "Member 'Config_GraphicsCS_C_SelectPreset::SelectionType' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.OnChangeGraphicsSlider
// 0x000C (0x000C - 0x0000)
struct Config_GraphicsCS_C_OnChangeGraphicsSlider final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsSliderSetting                        Type;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_GraphicsCS_C_OnChangeGraphicsSlider) == 0x000004, "Wrong alignment on Config_GraphicsCS_C_OnChangeGraphicsSlider");
static_assert(sizeof(Config_GraphicsCS_C_OnChangeGraphicsSlider) == 0x00000C, "Wrong size on Config_GraphicsCS_C_OnChangeGraphicsSlider");
static_assert(offsetof(Config_GraphicsCS_C_OnChangeGraphicsSlider, Value) == 0x000000, "Member 'Config_GraphicsCS_C_OnChangeGraphicsSlider::Value' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_OnChangeGraphicsSlider, Ratio) == 0x000004, "Member 'Config_GraphicsCS_C_OnChangeGraphicsSlider::Ratio' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_OnChangeGraphicsSlider, Type) == 0x000008, "Member 'Config_GraphicsCS_C_OnChangeGraphicsSlider::Type' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Config_GraphicsCS_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_GraphicsCS_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_GraphicsCS.Config_GraphicsCS_C.ExecuteUbergraph_Config_GraphicsCS
// 0x06E0 (0x06E0 - 0x0000)
struct Config_GraphicsCS_C_ExecuteUbergraph_Config_GraphicsCS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8583[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8584[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBFrameRateLimitType                         Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8585[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x002C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8586[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_7;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1; // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8587[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerVisibleLimit                         Temp_byte_Variable_1;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8588[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_8;                               // 0x0060(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x006C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x0070(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0074(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0078(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8589[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EGraphicsSliderSetting                        Temp_byte_Variable_2;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_858A[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_15;                              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_4;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_2; // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_858B[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_5;             // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default_2;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_858C[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_858D[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00E0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_858E[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_858F[0x2];                                     // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8590[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGraphicsSetting                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x011C(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8591[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBConfigureSaveData_Graphics          K2Node_MakeStruct_SBConfigureSaveData_Graphics;    // 0x0148(0x002C)(NoDestructor)
	int32                                         K2Node_CustomEvent_Value;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Ratio;                          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsSliderSetting                        K2Node_CustomEvent_Type;                           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8592[0x1];                                     // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGraphicsConfigData_bIsLoaded;          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8593[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBConfigureSaveData_Graphics          CallFunc_GetGraphicsConfigData_ReturnValue;        // 0x018C(0x002C)(ConstParm, NoDestructor)
	ESBConfigSaveDataResult                       CallFunc_LoadGraphicsConfigData_Result;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8594[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBConfigureSaveData_Graphics          CallFunc_LoadGraphicsConfigData_ReturnValue;       // 0x01BC(0x002C)(NoDestructor)
	bool                                          CallFunc_IsLoadedGraphicsConfigData_ReturnValue;   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8595[0x6];                                     // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Values_Values;                        // 0x01F0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGraphicsSetting                       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x020C(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8596[0x3];                                     // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x023C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGraphicsSetting                       CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0244(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8597[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGraphicsSetting                       K2Node_MakeStruct_GraphicsSetting;                 // 0x0280(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
