#pragma once

 

// Package: Config_Graphics

#include "Basic.hpp"

#include "GraphicsSetting_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GraphicsSliderSetting_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function Config_Graphics.Config_Graphics_C.On_Cmb_ViewLimit_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0) == 0x000008, "Wrong alignment on Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0");
static_assert(sizeof(Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0) == 0x000038, "Wrong size on Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0");
static_assert(offsetof(Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0, Item) == 0x000000, "Member 'Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'Config_Graphics_C_On_Cmb_ViewLimit_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.On_Preset_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct Config_Graphics_C_On_Preset_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(Config_Graphics_C_On_Preset_GenerateWidget_0) == 0x000008, "Wrong alignment on Config_Graphics_C_On_Preset_GenerateWidget_0");
static_assert(sizeof(Config_Graphics_C_On_Preset_GenerateWidget_0) == 0x000038, "Wrong size on Config_Graphics_C_On_Preset_GenerateWidget_0");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_0, Item) == 0x000000, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.InitializePlayerSave
// 0x0050 (0x0050 - 0x0000)
struct Config_Graphics_C_InitializePlayerSave final
{
public:
	class USBConfigureSaveManager*                Manager;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerId;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerImagineAlpha_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68B9[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerVisibleVFXValue_ReturnValue;     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPartyImagineAlpha_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68BA[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyVisibleVFXValue_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOtherPCVisibleVFXValue_ReturnValue;    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOtherPCImagineAlpha_ReturnValue;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBattleImagineCutinPerformance_ReturnValue; // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUltimateSkillPerformance_ReturnValue;   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVsync_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlwaysShowFieldHUD_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowOtherNamePlate_ReturnValue;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowPartyNamePlate_ReturnValue;         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68BB[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_InitializePlayerSave) == 0x000008, "Wrong alignment on Config_Graphics_C_InitializePlayerSave");
static_assert(sizeof(Config_Graphics_C_InitializePlayerSave) == 0x000050, "Wrong size on Config_Graphics_C_InitializePlayerSave");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, Manager) == 0x000000, "Member 'Config_Graphics_C_InitializePlayerSave::Manager' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, PlayerId) == 0x000008, "Member 'Config_Graphics_C_InitializePlayerSave::PlayerId' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsPlayerImagineAlpha_ReturnValue) == 0x000018, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsPlayerImagineAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_GetPlayerVisibleVFXValue_ReturnValue) == 0x00001C, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_GetPlayerVisibleVFXValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsPartyImagineAlpha_ReturnValue) == 0x000020, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsPartyImagineAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_GetPartyVisibleVFXValue_ReturnValue) == 0x000024, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_GetPartyVisibleVFXValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_GetOtherPCVisibleVFXValue_ReturnValue) == 0x000028, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_GetOtherPCVisibleVFXValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsOtherPCImagineAlpha_ReturnValue) == 0x00002C, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsOtherPCImagineAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsBattleImagineCutinPerformance_ReturnValue) == 0x00002D, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsBattleImagineCutinPerformance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsUltimateSkillPerformance_ReturnValue) == 0x00002E, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsUltimateSkillPerformance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_GetConfigSaveManager_IsValid) == 0x00002F, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000030, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsVsync_ReturnValue) == 0x000038, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsVsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsAlwaysShowFieldHUD_ReturnValue) == 0x000039, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsAlwaysShowFieldHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsShowOtherNamePlate_ReturnValue) == 0x00003A, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsShowOtherNamePlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_IsShowPartyNamePlate_ReturnValue) == 0x00003B, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_IsShowPartyNamePlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_InitializePlayerSave, CallFunc_GetPlayerId_ReturnValue) == 0x000040, "Member 'Config_Graphics_C_InitializePlayerSave::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.FindPresetData
// 0x00C0 (0x00C0 - 0x0000)
struct Config_Graphics_C_FindPresetData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGraphicsSetting                       K2Node_MakeStruct_GraphicsSetting;                 // 0x001C(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68BC[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68BD[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68BE[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68BF[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGraphicsSetting                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0028)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_FindPresetData) == 0x000008, "Wrong alignment on Config_Graphics_C_FindPresetData");
static_assert(sizeof(Config_Graphics_C_FindPresetData) == 0x0000C0, "Wrong size on Config_Graphics_C_FindPresetData");
static_assert(offsetof(Config_Graphics_C_FindPresetData, Key) == 0x000000, "Member 'Config_Graphics_C_FindPresetData::Key' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'Config_Graphics_C_FindPresetData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Config_Graphics_C_FindPresetData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, K2Node_MakeStruct_GraphicsSetting) == 0x00001C, "Member 'Config_Graphics_C_FindPresetData::K2Node_MakeStruct_GraphicsSetting' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Array_Get_Item) == 0x000060, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Map_Find_Value) == 0x000074, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_Map_Find_ReturnValue) == 0x00007C, "Member 'Config_Graphics_C_FindPresetData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'Config_Graphics_C_FindPresetData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A8, "Member 'Config_Graphics_C_FindPresetData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000AA, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000AB, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000AC, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0000AD, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_5) == 0x0000AE, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_6) == 0x0000AF, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_7) == 0x0000B0, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_EqualEqual_IntInt_ReturnValue_8) == 0x0000B1, "Member 'Config_Graphics_C_FindPresetData::CallFunc_EqualEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_1) == 0x0000B3, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_2) == 0x0000B4, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_3) == 0x0000B5, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_4) == 0x0000B6, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_5) == 0x0000B7, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_6) == 0x0000B8, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_FindPresetData, CallFunc_BooleanAND_ReturnValue_7) == 0x0000B9, "Member 'Config_Graphics_C_FindPresetData::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.On_Preset_GenerateWidget_1
// 0x0038 (0x0038 - 0x0000)
struct Config_Graphics_C_On_Preset_GenerateWidget_1 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(Config_Graphics_C_On_Preset_GenerateWidget_1) == 0x000008, "Wrong alignment on Config_Graphics_C_On_Preset_GenerateWidget_1");
static_assert(sizeof(Config_Graphics_C_On_Preset_GenerateWidget_1) == 0x000038, "Wrong size on Config_Graphics_C_On_Preset_GenerateWidget_1");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_1, Item) == 0x000000, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_1::Item' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_1, ReturnValue) == 0x000010, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_1, CallFunc_Create_ReturnValue) == 0x000018, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_1::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_On_Preset_GenerateWidget_1, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'Config_Graphics_C_On_Preset_GenerateWidget_1::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.SelectPreset
// 0x0018 (0x0018 - 0x0000)
struct Config_Graphics_C_SelectPreset final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_SelectPreset) == 0x000008, "Wrong alignment on Config_Graphics_C_SelectPreset");
static_assert(sizeof(Config_Graphics_C_SelectPreset) == 0x000018, "Wrong size on Config_Graphics_C_SelectPreset");
static_assert(offsetof(Config_Graphics_C_SelectPreset, SelectedItem) == 0x000000, "Member 'Config_Graphics_C_SelectPreset::SelectedItem' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_SelectPreset, SelectionType) == 0x000010, "Member 'Config_Graphics_C_SelectPreset::SelectionType' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.OnChangeGraphicsSlider
// 0x000C (0x000C - 0x0000)
struct Config_Graphics_C_OnChangeGraphicsSlider final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGraphicsSliderSetting                        Type;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_OnChangeGraphicsSlider) == 0x000004, "Wrong alignment on Config_Graphics_C_OnChangeGraphicsSlider");
static_assert(sizeof(Config_Graphics_C_OnChangeGraphicsSlider) == 0x00000C, "Wrong size on Config_Graphics_C_OnChangeGraphicsSlider");
static_assert(offsetof(Config_Graphics_C_OnChangeGraphicsSlider, Value) == 0x000000, "Member 'Config_Graphics_C_OnChangeGraphicsSlider::Value' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_OnChangeGraphicsSlider, Ratio) == 0x000004, "Member 'Config_Graphics_C_OnChangeGraphicsSlider::Ratio' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_OnChangeGraphicsSlider, Type) == 0x000008, "Member 'Config_Graphics_C_OnChangeGraphicsSlider::Type' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CheckBoxShowFPS_K2Node_ComponentBoundEvent_27_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Config_Graphics_C_BndEvt__Cmb_FPSLimit_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CB_LowGPUMode_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CB_NamePlateParty_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CB_NamePlateOther_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CB_AlwaysShowHUD_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Config_Graphics_C_BndEvt__Cmb_ViewLimit_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CheckBoxVSync_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__CB_NamePlateTeamTag_K2Node_ComponentBoundEvent_9_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_162_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_SBCheckBoxCmnCheckBox01_C_866_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature final
{
public:
	int32                                         New_Value;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature) == 0x000004, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature) == 0x00000C, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature, New_Value) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature::New_Value' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature, Ratio) == 0x000004, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature::Ratio' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature, Param_Index) == 0x000008, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_OtherPCVFXView_K2Node_ComponentBoundEvent_11_OnGraphicsChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.SetTitleMode
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_SetTitleMode final
{
public:
	bool                                          bTitle;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_SetTitleMode) == 0x000001, "Wrong alignment on Config_Graphics_C_SetTitleMode");
static_assert(sizeof(Config_Graphics_C_SetTitleMode) == 0x000001, "Wrong size on Config_Graphics_C_SetTitleMode");
static_assert(offsetof(Config_Graphics_C_SetTitleMode, bTitle) == 0x000000, "Member 'Config_Graphics_C_SetTitleMode::bTitle' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature final
{
public:
	int32                                         New_Value;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature) == 0x000004, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature) == 0x00000C, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature, New_Value) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature::New_Value' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature, Ratio) == 0x000004, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature::Ratio' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature, Param_Index) == 0x000008, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PartyVFXView_K2Node_ComponentBoundEvent_14_OnGraphicsChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPlayerImajin_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature final
{
public:
	int32                                         New_Value;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature) == 0x000004, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature) == 0x00000C, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature, New_Value) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature::New_Value' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature, Ratio) == 0x000004, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature::Ratio' has a wrong offset!");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature, Param_Index) == 0x000008, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_GSlider_PlayerVFXView_K2Node_ComponentBoundEvent_12_OnGraphicsChanged__DelegateSignature::Param_Index' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaOtherPCImajin_K2Node_ComponentBoundEvent_10_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function Config_Graphics.Config_Graphics_C.BndEvt__Config_Graphics_CB_AlphaPartyImajin_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPartyImajin_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPartyImajin_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on Config_Graphics_C_BndEvt__Config_Graphics_CB_AlphaPartyImajin_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature");
