#pragma once

 

// Package: CraftList

#include "Basic.hpp"

#include "CraftRecepiSortType_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ItemListData_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CraftList.CraftList_C.SelectRecepi__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CraftList_C_SelectRecepi__DelegateSignature final
{
public:
	struct FCharacterCraftRecepi                  Recepi;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CraftList_C_SelectRecepi__DelegateSignature) == 0x000004, "Wrong alignment on CraftList_C_SelectRecepi__DelegateSignature");
static_assert(sizeof(CraftList_C_SelectRecepi__DelegateSignature) == 0x000008, "Wrong size on CraftList_C_SelectRecepi__DelegateSignature");
static_assert(offsetof(CraftList_C_SelectRecepi__DelegateSignature, Recepi) == 0x000000, "Member 'CraftList_C_SelectRecepi__DelegateSignature::Recepi' has a wrong offset!");

// Function CraftList.CraftList_C.ShowNpcCraftBtn__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CraftList_C_ShowNpcCraftBtn__DelegateSignature final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CraftList_C_ShowNpcCraftBtn__DelegateSignature) == 0x000001, "Wrong alignment on CraftList_C_ShowNpcCraftBtn__DelegateSignature");
static_assert(sizeof(CraftList_C_ShowNpcCraftBtn__DelegateSignature) == 0x000001, "Wrong size on CraftList_C_ShowNpcCraftBtn__DelegateSignature");
static_assert(offsetof(CraftList_C_ShowNpcCraftBtn__DelegateSignature, bShow) == 0x000000, "Member 'CraftList_C_ShowNpcCraftBtn__DelegateSignature::bShow' has a wrong offset!");

// Function CraftList.CraftList_C.SetCancelLock__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CraftList_C_SetCancelLock__DelegateSignature final
{
public:
	bool                                          LockInput;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CraftList_C_SetCancelLock__DelegateSignature) == 0x000001, "Wrong alignment on CraftList_C_SetCancelLock__DelegateSignature");
static_assert(sizeof(CraftList_C_SetCancelLock__DelegateSignature) == 0x000001, "Wrong size on CraftList_C_SetCancelLock__DelegateSignature");
static_assert(offsetof(CraftList_C_SetCancelLock__DelegateSignature, LockInput) == 0x000000, "Member 'CraftList_C_SetCancelLock__DelegateSignature::LockInput' has a wrong offset!");

// Function CraftList.CraftList_C.SetColorChangeMoney__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct CraftList_C_SetColorChangeMoney__DelegateSignature final
{
public:
	bool                                          WhiteColor;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CraftList_C_SetColorChangeMoney__DelegateSignature) == 0x000001, "Wrong alignment on CraftList_C_SetColorChangeMoney__DelegateSignature");
static_assert(sizeof(CraftList_C_SetColorChangeMoney__DelegateSignature) == 0x000001, "Wrong size on CraftList_C_SetColorChangeMoney__DelegateSignature");
static_assert(offsetof(CraftList_C_SetColorChangeMoney__DelegateSignature, WhiteColor) == 0x000000, "Member 'CraftList_C_SetColorChangeMoney__DelegateSignature::WhiteColor' has a wrong offset!");

// Function CraftList.CraftList_C.ExecuteUbergraph_CraftList
// 0x09F0 (0x09F0 - 0x0000)
struct CraftList_C_ExecuteUbergraph_CraftList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5266[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCharacterCraftRecepi>          K2Node_CustomEvent_InputPin;                       // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
	struct FCharacterCraftRecepi                  K2Node_CustomEvent_SelectRecepi;                   // 0x0068(0x0008)(NoDestructor)
	class UCraftRecepiItem_C*                     K2Node_CustomEvent_SelectedItem_1;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindCraftMaster_bIsValid;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5267[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CallFunc_FindCraftMaster_CraftMaster;              // 0x0080(0x0088)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindCraftMaster_bIsValid_1;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5268[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CallFunc_FindCraftMaster_CraftMaster_1;            // 0x0110(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5269[0x3];                                     // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate;              // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_526A[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_526B[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_526C[0x4];                                     // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_526D[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCraftComponent*                CallFunc_GetCraftComponent_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isRecepiMaterialLocked_OutIsLocked;       // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_5;                       // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_526E[0x5];                                     // 0x020B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_ShowRedayCheckYesNoDialog_OutIsDialog;    // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_526F[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue;                       // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMoney_ReturnValue;                     // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5270[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5271[0x3];                                     // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_3;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	ESBWeaponType                                 CallFunc_Map_Find_Value;                           // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5272[0x2];                                     // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Now;                    // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCraftable_bIsCraftable;                 // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5273[0x1];                                     // 0x025F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_IsUseToken_UseToken;                      // 0x0260(0x0010)(ReferenceParm)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECraftRecepiSortType                          CallFunc_Map_Find_Value_1;                         // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5274[0x6];                                     // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCraftComponent*                CallFunc_GetCraftComponent_ReturnValue_1;          // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCharacterCraftRecepi>          CallFunc_GetPlayerRecepi_ReturnValue;              // 0x0288(0x0010)(ReferenceParm)
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x0298(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAdminHide_ReturnValue;                  // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5275[0x2];                                     // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalclateMoney_ReturnValue;                // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalclateMoney_bIsDiscount;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCraftable_bIsCraftable_1;               // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5276[0x3];                                     // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_2;      // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5277[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCraftComponent*                CallFunc_GetCraftComponent_ReturnValue_2;          // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerCraftComponent*                CallFunc_GetCraftComponent_ReturnValue_3;          // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorCode_1;                    // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSuccess;                      // 0x02F4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_isCritical_1;                   // 0x02F5(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5278[0x2];                                     // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ItemUniqueId;                   // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalAmount_1;                  // 0x0308(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SaleAmount_1;                   // 0x030C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SaleProfits_1;                  // 0x0310(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ErrorCode;                      // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isCritical;                     // 0x0318(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5279[0x7];                                     // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_CustomEvent_ItemUniqueids;                  // 0x0320(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_CriticalNum;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_isFail;                         // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527A[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TotalAmount;                    // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_527B[0x4];                                     // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  K2Node_CustomEvent_Criticals;                      // 0x0340(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_SaleAmount;                     // 0x0350(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SaleProfits;                    // 0x0354(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527C[0x5];                                     // 0x035B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_527D[0x3];                                     // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Selected;                       // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isItemRecepi_IsItem;                      // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527E[0x2];                                     // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMoney_ReturnValue_1;                   // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMeetDemand_MeetDemand;                  // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_527F[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_4;            // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03A0(0x0018)()
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_2;                     // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogResult                                 K2Node_CustomEvent_Result_4;                       // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5280[0x2];                                     // 0x03C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x03C4(0x0010)(ZeroConstructor, NoDestructor)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5281[0x3];                                     // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentDiffDialog_C*                 CallFunc_Create_ReturnValue_3;                     // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCraftMaster_bIsValid_2;               // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5282[0x7];                                     // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CallFunc_FindCraftMaster_CraftMaster_2;            // 0x03E8(0x0088)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogResult                                 K2Node_CustomEvent_Result_3;                       // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5283[0x1];                                     // 0x0473(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0474(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5284[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplay_C*                  CallFunc_Create_ReturnValue_4;                     // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InRetCode)>              K2Node_CreateDelegate_OutputDelegate_7;            // 0x0490(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_2;                              // 0x04B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5285[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x04B8(0x0018)()
	EItemType                                     Temp_byte_Variable_3;                              // 0x04D0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5286[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x04E8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5287[0x3];                                     // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalclateMoney_ReturnValue_1;              // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalclateMoney_bIsDiscount_1;              // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5288[0x6];                                     // 0x050A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5289[0x7];                                     // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_5;                     // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemType                                     K2Node_Select_Default_1;                           // 0x052D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_528A[0x2];                                     // 0x052E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSlackNum_ReturnValue;                  // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0535(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_528B[0x2];                                     // 0x0536(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_6;                     // 0x0538(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_528C[0x4];                                     // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0558(0x0018)()
	bool                                          CallFunc_FindWeaponMaster_bIsValid;                // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_528D[0x7];                                     // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_FindWeaponMaster_WeaponMaster;            // 0x0578(0x00B0)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_528E[0x2];                                     // 0x0632(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMoney_ReturnValue_2;                   // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0638(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalclateMoney_ReturnValue_2;              // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalclateMoney_bIsDiscount_2;              // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_528F[0x3];                                     // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0662(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5290[0x5];                                     // 0x0663(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_3;      // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBConfigSaveDataResult                       CallFunc_SaveCommonSaveData_ReturnValue;           // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5291[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerRewardBoostComponent*          CallFunc_GetRewardBoostComponent_ReturnValue;      // 0x0680(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InRetCode;                      // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCraftMaster_bIsValid_3;               // 0x068E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5292[0x1];                                     // 0x068F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CallFunc_FindCraftMaster_CraftMaster_3;            // 0x0690(0x0088)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0718(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0740(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0768(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_9;            // 0x0778(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_7;                     // 0x0788(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0790(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0791(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindCharacterEquipmentItem_bIsValid;      // 0x0792(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5293[0x5];                                     // 0x0793(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_FindCharacterEquipmentItem_ReturnValue;   // 0x0798(0x0118)(ConstParm)
	int32                                         CallFunc_GetSelectStorageNo_StorageNo;             // 0x08B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x08B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x08B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5294[0x2];                                     // 0x08B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_10;           // 0x08B8(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x08C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCraftRecepiDesc_C*                     CallFunc_Create_ReturnValue_8;                     // 0x08D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IfMeetDemand_MeetDemand;                  // 0x08D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x08DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogResult                                 K2Node_CustomEvent_Result_2;                       // 0x08DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5295[0x3];                                     // 0x08DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_9;                     // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x08E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x08F8(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetValue_SetedValue;                      // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x091C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x0921(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5296[0x2];                                     // 0x0922(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x0924(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogResult                                 K2Node_CustomEvent_Result_1;                       // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5297[0x3];                                     // 0x0929(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x092C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5298[0x7];                                     // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_5;           // 0x0938(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0948(0x0018)()
	int32                                         Temp_int_Variable_3;                               // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasConditionItem_ReturnValue;             // 0x0964(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0965(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5299[0x2];                                     // 0x0966(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_5;                           // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x096C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x096D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x096E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x096F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_6;           // 0x0970(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529A[0x7];                                     // 0x0981(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0988(0x0018)()
	EDialogResult                                 K2Node_CustomEvent_Result;                         // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x09A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x09A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x09A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidLimitedRecepi_ReturnValue;           // 0x09A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x09A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529B[0x2];                                     // 0x09A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ErrorCode, bool IsCritical, TArray<class FString>& ItemUniqueids, int32 CriticalNum, bool IsFail, int32 TotalAmount, TArray<bool>& Criticals, int32 SaleAmount, int32 SaleProfits)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x09A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_1;           // 0x09B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529C[0x6];                                     // 0x09BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_1;       // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ErrorCode, bool IsSuccess, bool IsCritical, const class FString& ItemUniqueId, int32 TotalAmount, int32 SaleAmount, int32 SaleProfits)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x09C8(0x0010)(ZeroConstructor, NoDestructor)
	ESBItemSortType                               CallFunc_ConvertSaveType_SaveType;                 // 0x09D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529D[0x7];                                     // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue_1;             // 0x09E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CraftList_C_ExecuteUbergraph_CraftList) == 0x000008, "Wrong alignment on CraftList_C_ExecuteUbergraph_CraftList");
static_assert(sizeof(CraftList_C_ExecuteUbergraph_CraftList) == 0x0009F0, "Wrong size on CraftList_C_ExecuteUbergraph_CraftList");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, EntryPoint) == 0x000000, "Member 'CraftList_C_ExecuteUbergraph_CraftList::EntryPoint' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CustomEvent_InputPin) == 0x000008, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CustomEvent_SelectRecepi) == 0x000068, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CustomEvent_SelectRecepi' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CustomEvent_SelectedItem_1) == 0x000070, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CustomEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_FindCraftMaster_bIsValid) == 0x000079, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_FindCraftMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_FindCraftMaster_CraftMaster) == 0x000080, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_FindCraftMaster_CraftMaster' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Not_PreBool_ReturnValue) == 0x000108, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_FindCraftMaster_bIsValid_1) == 0x000109, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_FindCraftMaster_bIsValid_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_FindCraftMaster_CraftMaster_1) == 0x000110, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_FindCraftMaster_CraftMaster_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsValid_ReturnValue_1) == 0x000198, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CreateDelegate_OutputDelegate) == 0x00019C, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsValid_ReturnValue_2) == 0x0001AC, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B0, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CustomEvent_SelectedItem) == 0x0001C0, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CustomEvent_SelectionType) == 0x0001D0, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001D4, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetPlayerController_ReturnValue) == 0x0001E8, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x0001F0, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetCraftComponent_ReturnValue) == 0x000200, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetCraftComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_MakeLiteralByte_ReturnValue) == 0x000208, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_isRecepiMaterialLocked_OutIsLocked) == 0x000209, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_isRecepiMaterialLocked_OutIsLocked' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CustomEvent_Result_5) == 0x00020A, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CustomEvent_Result_5' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_ShowRedayCheckYesNoDialog_OutIsDialog) == 0x000210, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_ShowRedayCheckYesNoDialog_OutIsDialog' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000218, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Create_ReturnValue) == 0x000220, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetMoney_ReturnValue) == 0x000228, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetMoney_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_ComponentBoundEvent_SelectedItem) == 0x000230, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_ComponentBoundEvent_SelectionType) == 0x000240, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_CreateDelegate_OutputDelegate_3) == 0x000244, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Map_Find_Value) == 0x000254, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Map_Find_ReturnValue) == 0x000255, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_ComponentBoundEvent_Now) == 0x000258, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_ComponentBoundEvent_Now' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Greater_IntInt_ReturnValue) == 0x00025C, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsCraftable_bIsCraftable) == 0x00025D, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsCraftable_bIsCraftable' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsValid_ReturnValue_3) == 0x00025E, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsUseToken_UseToken) == 0x000260, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsUseToken_UseToken' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetSBPlayerController_ReturnValue) == 0x000270, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Map_Find_Value_1) == 0x000278, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_Map_Find_ReturnValue_1) == 0x000279, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetCraftComponent_ReturnValue_1) == 0x000280, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetCraftComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetPlayerRecepi_ReturnValue) == 0x000288, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetPlayerRecepi_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_ComponentBoundEvent_Filters) == 0x000298, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0002A8, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_DynamicCast_AsSBPlayer_Character) == 0x0002B0, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, K2Node_DynamicCast_bSuccess_1) == 0x0002B8, "Member 'CraftList_C_ExecuteUbergraph_CraftList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CraftList_C_ExecuteUbergraph_CraftList, CallFunc_IsAdminHide_ReturnValue) == 0x0002B9, "Member 'CraftList_C_ExecuteUbergraph_CraftList::CallFunc_IsAdminHide_ReturnValue' has a wrong offset!");
