#pragma once

 

// Package: DebugCheckBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function DebugCheckBox.DebugCheckBox_C.ExecuteUbergraph_DebugCheckBox
// 0x00B0 (0x00B0 - 0x0000)
struct DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBDebugMenuType                              K2Node_CustomEvent_MenuType;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_513D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_RowName;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugFunction_IsValid;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_513E[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugFunction_IsValid_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_513F[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugFunction_IsValid_2;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5140[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_2;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugFunction_IsValid_3;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5141[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_3;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_isChecked;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugFunction_IsValid_4;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5142[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_4;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_2;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugFunction_IsValid_5;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5143[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_5;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5144[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDebugFunction_IsValid_6;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5145[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_6;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBool_ReturnValue;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDebugFunction_IsValid_7;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5146[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDebugFunction*                       CallFunc_GetDebugFunction_ReturnValue_7;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBDebugMenuType MenuType, class FName RowName)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox) == 0x000008, "Wrong alignment on DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox");
static_assert(sizeof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox) == 0x0000B0, "Wrong size on DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, EntryPoint) == 0x000000, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, K2Node_CustomEvent_MenuType) == 0x000004, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::K2Node_CustomEvent_MenuType' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, K2Node_CustomEvent_RowName) == 0x000008, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::K2Node_CustomEvent_RowName' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid) == 0x000010, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue) == 0x000018, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_NotEqual_NameName_ReturnValue) == 0x000020, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_1) == 0x000021, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_1' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_1) == 0x000028, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_IsChecked_ReturnValue) == 0x000030, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_2) == 0x000032, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_2' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_2) == 0x000038, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_3) == 0x000040, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_3' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_3) == 0x000048, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000050, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, K2Node_CustomEvent_isChecked) == 0x000051, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::K2Node_CustomEvent_isChecked' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_4) == 0x000052, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_4' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_4) == 0x000058, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_NotEqual_NameName_ReturnValue_2) == 0x000060, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_NotEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_5) == 0x000061, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_5' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_5) == 0x000068, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, K2Node_ComponentBoundEvent_bIsChecked) == 0x000070, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_IsVisible_ReturnValue) == 0x000071, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetPlayerController_ReturnValue) == 0x000078, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_6) == 0x000080, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_6' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_6) == 0x000088, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000090, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000091, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetBool_ReturnValue) == 0x000092, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_BooleanAND_ReturnValue) == 0x000093, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_IsValid_7) == 0x000094, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_IsValid_7' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, CallFunc_GetDebugFunction_ReturnValue_7) == 0x000098, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::CallFunc_GetDebugFunction_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'DebugCheckBox_C_ExecuteUbergraph_DebugCheckBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function DebugCheckBox.DebugCheckBox_C.OnChangedFlag
// 0x000C (0x000C - 0x0000)
struct DebugCheckBox_C_OnChangedFlag final
{
public:
	ESBDebugMenuType                              Param_MenuType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5147[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Param_RowName;                                     // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DebugCheckBox_C_OnChangedFlag) == 0x000004, "Wrong alignment on DebugCheckBox_C_OnChangedFlag");
static_assert(sizeof(DebugCheckBox_C_OnChangedFlag) == 0x00000C, "Wrong size on DebugCheckBox_C_OnChangedFlag");
static_assert(offsetof(DebugCheckBox_C_OnChangedFlag, Param_MenuType) == 0x000000, "Member 'DebugCheckBox_C_OnChangedFlag::Param_MenuType' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_OnChangedFlag, Param_RowName) == 0x000004, "Member 'DebugCheckBox_C_OnChangedFlag::Param_RowName' has a wrong offset!");

// Function DebugCheckBox.DebugCheckBox_C.ChangeCheckBoxState
// 0x0001 (0x0001 - 0x0000)
struct DebugCheckBox_C_ChangeCheckBoxState final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DebugCheckBox_C_ChangeCheckBoxState) == 0x000001, "Wrong alignment on DebugCheckBox_C_ChangeCheckBoxState");
static_assert(sizeof(DebugCheckBox_C_ChangeCheckBoxState) == 0x000001, "Wrong size on DebugCheckBox_C_ChangeCheckBoxState");
static_assert(offsetof(DebugCheckBox_C_ChangeCheckBoxState, IsChecked) == 0x000000, "Member 'DebugCheckBox_C_ChangeCheckBoxState::IsChecked' has a wrong offset!");

// Function DebugCheckBox.DebugCheckBox_C.BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'DebugCheckBox_C_BndEvt__CheckBox_K2Node_ComponentBoundEvent_174_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function DebugCheckBox.DebugCheckBox_C.GetBattleHUD
// 0x0030 (0x0030 - 0x0000)
struct DebugCheckBox_C_GetBattleHUD final
{
public:
	bool                                          IsSuccess;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5148[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5149[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleHUD_C*                        K2Node_DynamicCast_AsBP_Battle_HUD;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DebugCheckBox_C_GetBattleHUD) == 0x000008, "Wrong alignment on DebugCheckBox_C_GetBattleHUD");
static_assert(sizeof(DebugCheckBox_C_GetBattleHUD) == 0x000030, "Wrong size on DebugCheckBox_C_GetBattleHUD");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, IsSuccess) == 0x000000, "Member 'DebugCheckBox_C_GetBattleHUD::IsSuccess' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'DebugCheckBox_C_GetBattleHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'DebugCheckBox_C_GetBattleHUD::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, CallFunc_GetHUD_ReturnValue) == 0x000010, "Member 'DebugCheckBox_C_GetBattleHUD::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'DebugCheckBox_C_GetBattleHUD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, K2Node_DynamicCast_AsBP_Battle_HUD) == 0x000020, "Member 'DebugCheckBox_C_GetBattleHUD::K2Node_DynamicCast_AsBP_Battle_HUD' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DebugCheckBox_C_GetBattleHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_GetBattleHUD, CallFunc_IsValid_ReturnValue_2) == 0x000029, "Member 'DebugCheckBox_C_GetBattleHUD::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function DebugCheckBox.DebugCheckBox_C.Set Menu Focus
// 0x0058 (0x0058 - 0x0000)
struct DebugCheckBox_C_Set_Menu_Focus final
{
public:
	bool                                          bFocus;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_514A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
};
static_assert(alignof(DebugCheckBox_C_Set_Menu_Focus) == 0x000008, "Wrong alignment on DebugCheckBox_C_Set_Menu_Focus");
static_assert(sizeof(DebugCheckBox_C_Set_Menu_Focus) == 0x000058, "Wrong size on DebugCheckBox_C_Set_Menu_Focus");
static_assert(offsetof(DebugCheckBox_C_Set_Menu_Focus, bFocus) == 0x000000, "Member 'DebugCheckBox_C_Set_Menu_Focus::bFocus' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_Set_Menu_Focus, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'DebugCheckBox_C_Set_Menu_Focus::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(DebugCheckBox_C_Set_Menu_Focus, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'DebugCheckBox_C_Set_Menu_Focus::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

