#pragma once

 

// Package: DhcBattleTopSkillInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.ExecuteUbergraph_DhcBattleTopSkillInfo
// 0x0130 (0x0130 - 0x0000)
struct DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C7[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C8[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62C9[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62CA[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62CB[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62CC[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoIconForBattleImagine_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Battle_Imagine; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62CD[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette; // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsEnabled;                    // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62CE[0x1];                                     // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkillInfoIconForTacticalSkill_C*> K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkillInfoIconForTacticalSkill_C*> K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62CF[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D0[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UHorizontalBox*>                 K2Node_MakeArray_Array_2;                          // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UHorizontalBox*                         CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D1[0x2];                                     // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D2[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoIconForTacticalSkill_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill; // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D3[0x3];                                     // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo) == 0x000008, "Wrong alignment on DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo");
static_assert(sizeof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo) == 0x000130, "Wrong size on DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, EntryPoint) == 0x000000, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_int_Variable) == 0x000004, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_byte_Variable) == 0x000008, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_byte_Variable_1) == 0x000010, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_int_Variable_1) == 0x000014, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_int_Array_Index_Variable) == 0x000024, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_Event_IsDesignTime) == 0x000028, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_bool_Variable) == 0x000029, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetChildrenCount_ReturnValue) == 0x00002C, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_MakeStruct_Margin) == 0x000038, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetChildAt_ReturnValue) == 0x000050, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_DynamicCast_AsSkill_Info_Icon_for_Battle_Imagine) == 0x000060, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_DynamicCast_AsSkill_Info_Icon_for_Battle_Imagine' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetChildrenCount_ReturnValue_1) == 0x00006C, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000070, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000074, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette) == 0x000075, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_CustomEvent_InIsEnabled) == 0x000076, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_CustomEvent_InIsEnabled' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_Select_Default) == 0x000077, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_Event_Animation) == 0x000078, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000080, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000084, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000085, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_BooleanAND_ReturnValue) == 0x000086, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_MakeArray_Array) == 0x000088, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_MakeArray_Array_1) == 0x000098, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000A8, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetPosition_ReturnValue) == 0x0000B0, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000B8, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, Temp_int_Variable_2) == 0x0000C0, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetPosition_ReturnValue_1) == 0x0000C4, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x0000CC, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetChildAt_ReturnValue_1) == 0x0000D0, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x0000D8, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E0, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_IsValid_ReturnValue_3) == 0x0000E1, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000E4, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_MakeArray_Array_2) == 0x0000E8, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_IsValid_ReturnValue_4) == 0x000104, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000105, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetChildAt_ReturnValue_2) == 0x000108, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_GetChildrenCount_ReturnValue_2) == 0x000110, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_GetChildrenCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill) == 0x000118, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000124, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000128, "Member 'DhcBattleTopSkillInfo_C_ExecuteUbergraph_DhcBattleTopSkillInfo::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct DhcBattleTopSkillInfo_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DhcBattleTopSkillInfo_C_OnAnimationFinished) == 0x000008, "Wrong alignment on DhcBattleTopSkillInfo_C_OnAnimationFinished");
static_assert(sizeof(DhcBattleTopSkillInfo_C_OnAnimationFinished) == 0x000008, "Wrong size on DhcBattleTopSkillInfo_C_OnAnimationFinished");
static_assert(offsetof(DhcBattleTopSkillInfo_C_OnAnimationFinished, Animation) == 0x000000, "Member 'DhcBattleTopSkillInfo_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.SetUIBlockerMostFrontEnable
// 0x0001 (0x0001 - 0x0000)
struct DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable) == 0x000001, "Wrong alignment on DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable");
static_assert(sizeof(DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable) == 0x000001, "Wrong size on DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable");
static_assert(offsetof(DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable, InIsEnabled) == 0x000000, "Member 'DhcBattleTopSkillInfo_C_SetUIBlockerMostFrontEnable::InIsEnabled' has a wrong offset!");

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	bool                                          bInSwitchToSubSkillPalette;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000001, "Wrong alignment on DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000001, "Wrong size on DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, bInSwitchToSubSkillPalette) == 0x000000, "Member 'DhcBattleTopSkillInfo_C_BndEvt__DhcBattleTopSkillInfo_SkillPaletteGrpSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::bInSwitchToSubSkillPalette' has a wrong offset!");

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DhcBattleTopSkillInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopSkillInfo_C_PreConstruct) == 0x000001, "Wrong alignment on DhcBattleTopSkillInfo_C_PreConstruct");
static_assert(sizeof(DhcBattleTopSkillInfo_C_PreConstruct) == 0x000001, "Wrong size on DhcBattleTopSkillInfo_C_PreConstruct");
static_assert(offsetof(DhcBattleTopSkillInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DhcBattleTopSkillInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.Setup
// 0x0258 (0x0258 - 0x0000)
struct DhcBattleTopSkillInfo_C_Setup final
{
public:
	TArray<struct FSBDhcBattlePlayerEquipImagineInfo> InEquipBattleImagineInfo;                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSBDhcBattlePlayerEquipArtsInfo> InEquipArtsInfo;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESBClassType                                  InClassType;                                       // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D4[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InClassLevel;                                      // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBSkillDataMasterData                 LocalSkillDataMaster;                              // 0x0028(0x0058)(Edit, BlueprintVisible)
	int32                                         LocalSkillIdComparison;                            // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalClassLevel;                                   // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillId;                                      // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalTacticalSkillSlotMax;                         // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalRegularSkillSlotMax;                          // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSlotId;                                       // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalArrayId;                                      // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D5[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LocalGatheredSkillIds;                             // 0x00A0(0x0010)(Edit, BlueprintVisible)
	TArray<ESBSkillType>                          LocalRegularAndULTSkillTypes;                      // 0x00B0(0x0010)(Edit, BlueprintVisible)
	int32                                         LocalULTSkillId;                                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D6[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LocalRegularSkillIds;                              // 0x00C8(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LocalTacticalSkillIds;                             // 0x00D8(0x0010)(Edit, BlueprintVisible)
	ESBClassType                                  LocalClassType;                                    // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62D7[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBDhcBattlePlayerEquipArtsInfo> LocalEquipArtsInfo;                                // 0x00F0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSBDhcBattlePlayerEquipImagineInfo> LocalEquipBattleImagineInfos;                      // 0x0100(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ESBSkillType>                          K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindSkillDataMaster_bIsValid;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D8[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataMaster_SkillDataMaster;      // 0x0138(0x0058)()
	int32                                         CallFunc_Array_Get_Item;                           // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindSkillDataMaster_bIsValid_1;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62D9[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataMaster_SkillDataMaster_1;    // 0x01A8(0x0058)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DA[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DB[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DC[0x3];                                     // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSkillType                                  CallFunc_Array_Get_Item_2;                         // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62DD[0x3];                                     // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DE[0x2];                                     // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetSkillIdBySkillType_OutSkillIds;        // 0x0228(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62DF[0x3];                                     // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBDhcBattlePlayerEquipArtsInfo        CallFunc_Array_Get_Item_3;                         // 0x023C(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x024E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x024F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopSkillInfo_C_Setup) == 0x000008, "Wrong alignment on DhcBattleTopSkillInfo_C_Setup");
static_assert(sizeof(DhcBattleTopSkillInfo_C_Setup) == 0x000258, "Wrong size on DhcBattleTopSkillInfo_C_Setup");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, InEquipBattleImagineInfo) == 0x000000, "Member 'DhcBattleTopSkillInfo_C_Setup::InEquipBattleImagineInfo' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, InEquipArtsInfo) == 0x000010, "Member 'DhcBattleTopSkillInfo_C_Setup::InEquipArtsInfo' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, InClassType) == 0x000020, "Member 'DhcBattleTopSkillInfo_C_Setup::InClassType' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, InClassLevel) == 0x000024, "Member 'DhcBattleTopSkillInfo_C_Setup::InClassLevel' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalSkillDataMaster) == 0x000028, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalSkillDataMaster' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalSkillIdComparison) == 0x000080, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalSkillIdComparison' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalClassLevel) == 0x000084, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalClassLevel' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalSkillId) == 0x000088, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalSkillId' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalTacticalSkillSlotMax) == 0x00008C, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalTacticalSkillSlotMax' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalRegularSkillSlotMax) == 0x000090, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalRegularSkillSlotMax' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalSlotId) == 0x000094, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalSlotId' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalArrayId) == 0x000098, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalArrayId' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalGatheredSkillIds) == 0x0000A0, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalGatheredSkillIds' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalRegularAndULTSkillTypes) == 0x0000B0, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalRegularAndULTSkillTypes' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalULTSkillId) == 0x0000C0, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalULTSkillId' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalRegularSkillIds) == 0x0000C8, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalRegularSkillIds' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalTacticalSkillIds) == 0x0000D8, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalTacticalSkillIds' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalClassType) == 0x0000E8, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalClassType' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalEquipArtsInfo) == 0x0000F0, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalEquipArtsInfo' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, LocalEquipBattleImagineInfos) == 0x000100, "Member 'DhcBattleTopSkillInfo_C_Setup::LocalEquipBattleImagineInfos' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, Temp_int_Array_Index_Variable) == 0x000110, "Member 'DhcBattleTopSkillInfo_C_Setup::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, Temp_int_Loop_Counter_Variable) == 0x000114, "Member 'DhcBattleTopSkillInfo_C_Setup::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000118, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, Temp_int_Array_Index_Variable_1) == 0x00011C, "Member 'DhcBattleTopSkillInfo_C_Setup::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, K2Node_MakeArray_Array) == 0x000120, "Member 'DhcBattleTopSkillInfo_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_FindSkillDataMaster_bIsValid) == 0x000130, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_FindSkillDataMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_FindSkillDataMaster_SkillDataMaster) == 0x000138, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_FindSkillDataMaster_SkillDataMaster' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Get_Item) == 0x000190, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_MakeLiteralInt_ReturnValue) == 0x000194, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Get_Item_1) == 0x000198, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Subtract_IntInt_ReturnValue) == 0x00019C, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_FindSkillDataMaster_bIsValid_1) == 0x0001A0, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_FindSkillDataMaster_bIsValid_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_FindSkillDataMaster_SkillDataMaster_1) == 0x0001A8, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_FindSkillDataMaster_SkillDataMaster_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000200, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000201, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000204, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000208, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, Temp_int_Loop_Counter_Variable_1) == 0x00020C, "Member 'DhcBattleTopSkillInfo_C_Setup::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue_2) == 0x000214, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000218, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Get_Item_2) == 0x00021C, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Length_ReturnValue_2) == 0x000220, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, K2Node_SwitchEnum_CmpSuccess) == 0x000224, "Member 'DhcBattleTopSkillInfo_C_Setup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue_3) == 0x000225, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_GetSkillIdBySkillType_OutSkillIds) == 0x000228, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_GetSkillIdBySkillType_OutSkillIds' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000238, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Get_Item_3) == 0x00023C, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Array_Length_ReturnValue_3) == 0x000248, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue_4) == 0x00024C, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00024D, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00024E, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00024F, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000250, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopSkillInfo_C_Setup, CallFunc_BooleanOR_ReturnValue_1) == 0x000251, "Member 'DhcBattleTopSkillInfo_C_Setup::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function DhcBattleTopSkillInfo.DhcBattleTopSkillInfo_C.SetupTacticalSkill
// 0x0238 (0x0238 - 0x0000)
struct DhcBattleTopSkillInfo_C_SetupTacticalSkill final
{
public:
	TArray<int32>                                 InTacticalSkillIds;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESBClassType                                  InClassType;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E0[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InClassLevel;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsSkillMastery;                               // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E1[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalSkillLevel;                                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDirtySkillId;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 LocalSkillDataMasterData;                          // 0x0028(0x0058)(Edit, BlueprintVisible)
	int32                                         LocalSlotId;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalClassLevel;                                   // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  LocalClassType;                                    // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E3[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LocalTacticalSkillIds;                             // 0x0090(0x0010)(Edit, BlueprintVisible)
	class USkillInfoIconForTacticalSkill_C*       LocalSkillInfoIcon;                                // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillId;                                      // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62E4[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   LocalMasterDataManager;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E5[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62E6[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
