#pragma once

 

// Package: DhcBattleTopEnhanceImagineInfo

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function DhcBattleTopEnhanceImagineInfo.DhcBattleTopEnhanceImagineInfo_C.ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo
// 0x0008 (0x0008 - 0x0000)
struct DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo) == 0x000004, "Wrong alignment on DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo");
static_assert(sizeof(DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo) == 0x000008, "Wrong size on DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo, EntryPoint) == 0x000000, "Member 'DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo, K2Node_Event_IsDesignTime) == 0x000004, "Member 'DhcBattleTopEnhanceImagineInfo_C_ExecuteUbergraph_DhcBattleTopEnhanceImagineInfo::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function DhcBattleTopEnhanceImagineInfo.DhcBattleTopEnhanceImagineInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DhcBattleTopEnhanceImagineInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopEnhanceImagineInfo_C_PreConstruct) == 0x000001, "Wrong alignment on DhcBattleTopEnhanceImagineInfo_C_PreConstruct");
static_assert(sizeof(DhcBattleTopEnhanceImagineInfo_C_PreConstruct) == 0x000001, "Wrong size on DhcBattleTopEnhanceImagineInfo_C_PreConstruct");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DhcBattleTopEnhanceImagineInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function DhcBattleTopEnhanceImagineInfo.DhcBattleTopEnhanceImagineInfo_C.CreatePassiveImagineIconUnitList
// 0x0070 (0x0070 - 0x0000)
struct DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList final
{
public:
	class UPassiveImagineInfoUnitForBattleSet_C*  LocalWidget;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSlotTypeCnt;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_630E[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_630F[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassiveImagineInfoUnitForBattleSet_C*  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6310[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6311[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6312[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6313[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList) == 0x000008, "Wrong alignment on DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList");
static_assert(sizeof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList) == 0x000070, "Wrong size on DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, LocalWidget) == 0x000000, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::LocalWidget' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, LocalSlotTypeCnt) == 0x000008, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::LocalSlotTypeCnt' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, Temp_int_Variable) == 0x00000C, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, Temp_int_Variable_1) == 0x000010, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Conv_IntToByte_ReturnValue) == 0x000014, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_GetValidValue_ReturnValue) == 0x00001C, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00001D, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, K2Node_SwitchEnum_CmpSuccess) == 0x00001E, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001F, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Create_ReturnValue) == 0x000028, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, Temp_float_Variable) == 0x000030, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, Temp_float_Variable_1) == 0x000034, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, Temp_bool_Variable) == 0x000038, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_MakeLiteralInt_ReturnValue) == 0x00003C, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, K2Node_Select_Default) == 0x000044, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, K2Node_MakeStruct_Margin) == 0x000048, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_MakeLiteralBool_ReturnValue) == 0x00005C, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, Temp_int_Variable_2) == 0x000060, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000068, "Member 'DhcBattleTopEnhanceImagineInfo_C_CreatePassiveImagineIconUnitList::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function DhcBattleTopEnhanceImagineInfo.DhcBattleTopEnhanceImagineInfo_C.Setup
// 0x0478 (0x0478 - 0x0000)
struct DhcBattleTopEnhanceImagineInfo_C_Setup final
{
public:
	TArray<struct FSBDhcBattlePlayerEquipImagineInfo> InEquipEnhanceImagineInfo;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESBClassType                                  InClassType;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6314[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InClassLevel;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPassiveImagineInfoUnitForBattleSet_C*  LocalIconUnit;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOwnItemInfo                           LocalOwnItemInfo;                                  // 0x0020(0x0118)(Edit, BlueprintVisible)
	struct FSBDhcBattlePlayerEquipImagineInfo     LocalInfo;                                         // 0x0138(0x001C)(Edit, BlueprintVisible, NoDestructor)
	int32                                         LocalSlotCnt;                                      // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsAlertIconOn;                                // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsPassiveImagineIconEmpty;                    // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6315[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalImagineUniqueId;                              // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ESBPlayerPassiveImagineSlotType               LocalSlotType;                                     // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6316[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     LocalSBPC;                                         // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalClassLevel;                                   // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  LocalClassType;                                    // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6317[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBDhcBattlePlayerEquipImagineInfo> LocalImagineInfos;                                 // 0x0188(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6318[0x4];                                     // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6319[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631A[0x1];                                     // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBDhcBattlePlayerEquipImagineInfo     CallFunc_Array_Get_Item;                           // 0x01D0(0x001C)(NoDestructor)
	uint8                                         Pad_631B[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPassiveImagineIconUnit_IsValid;        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631C[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassiveImagineInfoUnitForBattleSet_C*  CallFunc_GetPassiveImagineIconUnit_OutImagineIconUnit; // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631D[0x3];                                     // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharacterStorageNumber_ReturnValue;    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631E[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631F[0x3];                                     // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6320[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x0230(0x0118)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist_1;       // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6321[0x5];                                     // 0x034B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1;     // 0x0350(0x0118)(ConstParm)
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopEnhanceImagineInfo_C_Setup) == 0x000008, "Wrong alignment on DhcBattleTopEnhanceImagineInfo_C_Setup");
static_assert(sizeof(DhcBattleTopEnhanceImagineInfo_C_Setup) == 0x000478, "Wrong size on DhcBattleTopEnhanceImagineInfo_C_Setup");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, InEquipEnhanceImagineInfo) == 0x000000, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::InEquipEnhanceImagineInfo' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, InClassType) == 0x000010, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::InClassType' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, InClassLevel) == 0x000014, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::InClassLevel' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalIconUnit) == 0x000018, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalIconUnit' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalOwnItemInfo) == 0x000020, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalOwnItemInfo' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalInfo) == 0x000138, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalInfo' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalSlotCnt) == 0x000154, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalSlotCnt' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalIsAlertIconOn) == 0x000158, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalIsAlertIconOn' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalIsPassiveImagineIconEmpty) == 0x000159, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalIsPassiveImagineIconEmpty' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalImagineUniqueId) == 0x000160, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalImagineUniqueId' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalSlotType) == 0x000170, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalSlotType' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalSBPC) == 0x000178, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalSBPC' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalClassLevel) == 0x000180, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalClassLevel' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalClassType) == 0x000184, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalClassType' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, LocalImagineInfos) == 0x000188, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::LocalImagineInfos' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_MakeLiteralInt_ReturnValue) == 0x000198, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Conv_NameToString_ReturnValue) == 0x0001A0, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001B0, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, Temp_int_Variable) == 0x0001B4, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x0001B8, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001BC, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x0001BD, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x0001BE, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001C0, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, Temp_int_Variable_1) == 0x0001C4, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0001C9, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetValidValue_ReturnValue) == 0x0001CA, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, K2Node_SwitchEnum_CmpSuccess) == 0x0001CB, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x0001CC, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetEquipmentBag_ReturnValue) == 0x0001F0, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetPassiveImagineIconUnit_IsValid) == 0x0001F8, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetPassiveImagineIconUnit_IsValid' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetPassiveImagineIconUnit_OutImagineIconUnit) == 0x000200, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetPassiveImagineIconUnit_OutImagineIconUnit' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_IsValid_ReturnValue_1) == 0x000208, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetCharacterStorageNumber_ReturnValue) == 0x00020C, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetCharacterStorageNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, Temp_int_Variable_2) == 0x000210, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetStorage_ReturnValue) == 0x000218, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_IsValid_ReturnValue_2) == 0x000220, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000224, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x000228, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x000230, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000348, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_MakeLiteralBool_ReturnValue) == 0x000349, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_BP_FindItem_ByUniqueId_bOutExist_1) == 0x00034A, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_BP_FindItem_ByUniqueId_bOutExist_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1) == 0x000350, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_GetSBPlayerCharacter_ReturnValue) == 0x000468, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_GetSBPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_Setup, CallFunc_IsValid_ReturnValue_3) == 0x000470, "Member 'DhcBattleTopEnhanceImagineInfo_C_Setup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function DhcBattleTopEnhanceImagineInfo.DhcBattleTopEnhanceImagineInfo_C.GetPassiveImagineIconUnit
// 0x0040 (0x0040 - 0x0000)
struct DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit final
{
public:
	ESBPlayerPassiveImagineSlotType               InPassiveImagineSlotType;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6322[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassiveImagineInfoUnitForBattleSet_C*  OutImagineIconUnit;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerPassiveImagineSlotType               LocalSlotType;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6323[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPassiveImagineInfoUnitForBattleSet_C*  K2Node_DynamicCast_AsPassive_Imagine_Info_Unit_for_Battle_Set; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBPlayerPassiveImagineSlotType               CallFunc_GetImagineSlotType_OutImagineSlotType;    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6324[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit) == 0x000008, "Wrong alignment on DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit");
static_assert(sizeof(DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit) == 0x000040, "Wrong size on DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit, InPassiveImagineSlotType) == 0x000000, "Member 'DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit::InPassiveImagineSlotType' has a wrong offset!");
static_assert(offsetof(DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit, IsValid) == 0x000001, "Member 'DhcBattleTopEnhanceImagineInfo_C_GetPassiveImagineIconUnit::IsValid' has a wrong offset!");
