#pragma once

 

// Package: EquipmentListForBattleSet

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "InventoryData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Filter_Type_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "E_BattleSetInfoType_structs.hpp"
#include "InventoryItemData_structs.hpp"
#include "Engine_structs.hpp"
#include "SortTypeCategory_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.OnListItemSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature final
{
public:
	class UItemIconBtn_C*                         InSelectedListItem;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature");
static_assert(sizeof(EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature) == 0x000008, "Wrong size on EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature");
static_assert(offsetof(EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature, InSelectedListItem) == 0x000000, "Member 'EquipmentListForBattleSet_C_OnListItemSelected__DelegateSignature::InSelectedListItem' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.OnEquipChangeBtnPressed__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature final
{
public:
	E_BattleSetInfoType                           InInfoType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8361[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InEquipmentUniqueId;                               // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature");
static_assert(sizeof(EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature) == 0x000018, "Wrong size on EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature");
static_assert(offsetof(EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature, InInfoType) == 0x000000, "Member 'EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature::InInfoType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature, InEquipmentUniqueId) == 0x000008, "Member 'EquipmentListForBattleSet_C_OnEquipChangeBtnPressed__DelegateSignature::InEquipmentUniqueId' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.OnSortTypeSelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature final
{
public:
	ESBItemSortType                               InSelectedSortType;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature) == 0x000001, "Wrong alignment on EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature");
static_assert(sizeof(EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature) == 0x000001, "Wrong size on EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature");
static_assert(offsetof(EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature, InSelectedSortType) == 0x000000, "Member 'EquipmentListForBattleSet_C_OnSortTypeSelected__DelegateSignature::InSelectedSortType' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.OnFilterBtnBagOrStoragePressed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature final
{
public:
	bool                                          InIsFilterBtnStoragePressed;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature) == 0x000001, "Wrong alignment on EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature");
static_assert(sizeof(EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature) == 0x000001, "Wrong size on EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature");
static_assert(offsetof(EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature, InIsFilterBtnStoragePressed) == 0x000000, "Member 'EquipmentListForBattleSet_C_OnFilterBtnBagOrStoragePressed__DelegateSignature::InIsFilterBtnStoragePressed' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.ExecuteUbergraph_EquipmentListForBattleSet
// 0x0080 (0x0080 - 0x0000)
struct EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBItemSortType                               K2Node_ComponentBoundEvent_SortType;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8362[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_CustomEvent_SelectItem;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectItemUniqueID_UniqueId;           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8363[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UItemIconBtn_C* SelectItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8364[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8365[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8366[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckIfSelectedEquipmentIsEquipped_OutIsEquipped; // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimInOutPlaying_OutIsPlaying;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet");
static_assert(sizeof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet) == 0x000080, "Wrong size on EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, EntryPoint) == 0x000000, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, K2Node_ComponentBoundEvent_SortType) == 0x000004, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::K2Node_ComponentBoundEvent_SortType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, K2Node_CustomEvent_SelectItem) == 0x000008, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::K2Node_CustomEvent_SelectItem' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_GetSelectItemUniqueID_UniqueId) == 0x000010, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_GetSelectItemUniqueID_UniqueId' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_GetChildrenCount_ReturnValue) == 0x000024, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_GetChildrenCount_ReturnValue_1) == 0x00002C, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, Temp_int_Variable) == 0x000044, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, K2Node_DynamicCast_AsItem_Icon_Btn) == 0x000058, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::K2Node_DynamicCast_AsItem_Icon_Btn' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000061, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, K2Node_ComponentBoundEvent_Filters) == 0x000068, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_CheckIfSelectedEquipmentIsEquipped_OutIsEquipped) == 0x000079, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_CheckIfSelectedEquipmentIsEquipped_OutIsEquipped' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_IsAnimInOutPlaying_OutIsPlaying) == 0x00007B, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_IsAnimInOutPlaying_OutIsPlaying' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_Not_PreBool_ReturnValue_1) == 0x00007C, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet, CallFunc_Not_PreBool_ReturnValue_2) == 0x00007D, "Member 'EquipmentListForBattleSet_C_ExecuteUbergraph_EquipmentListForBattleSet::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature final
{
public:
	TArray<struct FFilterGroup>                   Filters;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature");
static_assert(sizeof(EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature) == 0x000010, "Wrong size on EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature");
static_assert(offsetof(EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature, Filters) == 0x000000, "Member 'EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_FilterSelector_K2Node_ComponentBoundEvent_3_OnFilterApply__DelegateSignature::Filters' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.OnItemIconBtnSelected
// 0x0008 (0x0008 - 0x0000)
struct EquipmentListForBattleSet_C_OnItemIconBtnSelected final
{
public:
	class UItemIconBtn_C*                         SelectItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipmentListForBattleSet_C_OnItemIconBtnSelected) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_OnItemIconBtnSelected");
static_assert(sizeof(EquipmentListForBattleSet_C_OnItemIconBtnSelected) == 0x000008, "Wrong size on EquipmentListForBattleSet_C_OnItemIconBtnSelected");
static_assert(offsetof(EquipmentListForBattleSet_C_OnItemIconBtnSelected, SelectItem) == 0x000000, "Member 'EquipmentListForBattleSet_C_OnItemIconBtnSelected::SelectItem' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature final
{
public:
	ESBItemSortType                               Param_SortType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature) == 0x000001, "Wrong alignment on EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature");
static_assert(sizeof(EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature) == 0x000001, "Wrong size on EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature");
static_assert(offsetof(EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature, Param_SortType) == 0x000000, "Member 'EquipmentListForBattleSet_C_BndEvt__EquipmentListForBattleSet_SortBox_K2Node_ComponentBoundEvent_0_OnSelectSortType__DelegateSignature::Param_SortType' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.Init
// 0x0009 (0x0009 - 0x0000)
struct EquipmentListForBattleSet_C_Init final
{
public:
	E_BattleSetInfoType                           InBattleSetInfoType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             InEquipType;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsStorageMode;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsStorageMode;                                // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharaEquipType                             LocalEquipType;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EquipmentListForBattleSet_C_Init) == 0x000001, "Wrong alignment on EquipmentListForBattleSet_C_Init");
static_assert(sizeof(EquipmentListForBattleSet_C_Init) == 0x000009, "Wrong size on EquipmentListForBattleSet_C_Init");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, InBattleSetInfoType) == 0x000000, "Member 'EquipmentListForBattleSet_C_Init::InBattleSetInfoType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, InEquipType) == 0x000001, "Member 'EquipmentListForBattleSet_C_Init::InEquipType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, InIsStorageMode) == 0x000002, "Member 'EquipmentListForBattleSet_C_Init::InIsStorageMode' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, LocalIsStorageMode) == 0x000003, "Member 'EquipmentListForBattleSet_C_Init::LocalIsStorageMode' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, LocalEquipType) == 0x000004, "Member 'EquipmentListForBattleSet_C_Init::LocalEquipType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'EquipmentListForBattleSet_C_Init::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'EquipmentListForBattleSet_C_Init::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, Temp_bool_Variable) == 0x000007, "Member 'EquipmentListForBattleSet_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_Init, K2Node_Select_Default) == 0x000008, "Member 'EquipmentListForBattleSet_C_Init::K2Node_Select_Default' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.UpdateOwnItemListContainer
// 0x0030 (0x0030 - 0x0000)
struct EquipmentListForBattleSet_C_UpdateOwnItemListContainer final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8367[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                K2Node_Select_Default_1;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_UpdateOwnItemListContainer");
static_assert(sizeof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer) == 0x000030, "Wrong size on EquipmentListForBattleSet_C_UpdateOwnItemListContainer");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, Temp_bool_Variable) == 0x000000, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, Temp_bool_Variable_1) == 0x000001, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, CallFunc_GetCharacterStorage_ReturnValue) == 0x000008, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::CallFunc_GetCharacterStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, CallFunc_GetEquipmentBag_ReturnValue) == 0x000010, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, K2Node_Select_Default) == 0x000018, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, K2Node_Select_Default_1) == 0x000020, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_UpdateOwnItemListContainer, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'EquipmentListForBattleSet_C_UpdateOwnItemListContainer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.CreateList
// 0x00E0 (0x00E0 - 0x0000)
struct EquipmentListForBattleSet_C_CreateList final
{
public:
	E_BattleSetInfoType                           InInfoType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8368[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalColumn;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalRow;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalColumnNumMax;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemIconBtn_C*                         LocalItemIconBtn;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalLoopId;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalMarginLeft;                                   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalMarginTop;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalListNumMax;                                   // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalItemNum2;                                     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalItemNum1;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     LocalItemType;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BattleSetInfoType                           LocalInfoType;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8369[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_836A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_836B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_836C[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemTypeNum_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_836D[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_836E[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemTypeNum_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_836F[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8370[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UItemIconBtn_C* SelectItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00BC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8371[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentListForBattleSet_C_CreateList) == 0x000008, "Wrong alignment on EquipmentListForBattleSet_C_CreateList");
static_assert(sizeof(EquipmentListForBattleSet_C_CreateList) == 0x0000E0, "Wrong size on EquipmentListForBattleSet_C_CreateList");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, InInfoType) == 0x000000, "Member 'EquipmentListForBattleSet_C_CreateList::InInfoType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalColumn) == 0x000004, "Member 'EquipmentListForBattleSet_C_CreateList::LocalColumn' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalRow) == 0x000008, "Member 'EquipmentListForBattleSet_C_CreateList::LocalRow' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalColumnNumMax) == 0x00000C, "Member 'EquipmentListForBattleSet_C_CreateList::LocalColumnNumMax' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalItemIconBtn) == 0x000010, "Member 'EquipmentListForBattleSet_C_CreateList::LocalItemIconBtn' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalLoopId) == 0x000018, "Member 'EquipmentListForBattleSet_C_CreateList::LocalLoopId' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalMarginLeft) == 0x00001C, "Member 'EquipmentListForBattleSet_C_CreateList::LocalMarginLeft' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalMarginTop) == 0x000020, "Member 'EquipmentListForBattleSet_C_CreateList::LocalMarginTop' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalListNumMax) == 0x000024, "Member 'EquipmentListForBattleSet_C_CreateList::LocalListNumMax' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalItemNum2) == 0x000028, "Member 'EquipmentListForBattleSet_C_CreateList::LocalItemNum2' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalItemNum1) == 0x00002C, "Member 'EquipmentListForBattleSet_C_CreateList::LocalItemNum1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalItemType) == 0x000030, "Member 'EquipmentListForBattleSet_C_CreateList::LocalItemType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, LocalInfoType) == 0x000031, "Member 'EquipmentListForBattleSet_C_CreateList::LocalInfoType' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, Temp_int_Variable) == 0x000034, "Member 'EquipmentListForBattleSet_C_CreateList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, Temp_int_Variable_1) == 0x000038, "Member 'EquipmentListForBattleSet_C_CreateList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'EquipmentListForBattleSet_C_CreateList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Create_ReturnValue) == 0x000048, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, Temp_int_Variable_2) == 0x000050, "Member 'EquipmentListForBattleSet_C_CreateList::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_GetChildrenCount_ReturnValue) == 0x000054, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Greater_IntInt_ReturnValue) == 0x000058, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_GetCharacterStorage_ReturnValue) == 0x000060, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_GetCharacterStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Max_ReturnValue) == 0x000068, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_GetItemTypeNum_ReturnValue) == 0x000070, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_GetItemTypeNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_GetEquipmentBag_ReturnValue) == 0x000078, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_GetItemTypeNum_ReturnValue_1) == 0x000084, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_GetItemTypeNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, Temp_int_Variable_3) == 0x000088, "Member 'EquipmentListForBattleSet_C_CreateList::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, Temp_bool_Variable) == 0x000094, "Member 'EquipmentListForBattleSet_C_CreateList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_IsValid_ReturnValue_2) == 0x000095, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, Temp_bool_Variable_1) == 0x000096, "Member 'EquipmentListForBattleSet_C_CreateList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000097, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Percent_IntInt_ReturnValue) == 0x000098, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Divide_IntInt_ReturnValue) == 0x00009C, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, K2Node_Select_Default) == 0x0000A0, "Member 'EquipmentListForBattleSet_C_CreateList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, K2Node_Select_Default_1) == 0x0000A4, "Member 'EquipmentListForBattleSet_C_CreateList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, K2Node_CreateDelegate_OutputDelegate) == 0x0000AC, "Member 'EquipmentListForBattleSet_C_CreateList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, K2Node_MakeStruct_Margin) == 0x0000BC, "Member 'EquipmentListForBattleSet_C_CreateList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_AddChildToGrid_ReturnValue) == 0x0000D0, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentListForBattleSet_C_CreateList, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000D8, "Member 'EquipmentListForBattleSet_C_CreateList::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");

// Function EquipmentListForBattleSet.EquipmentListForBattleSet_C.InitListSetting
// 0x01D0 (0x01D0 - 0x0000)
struct EquipmentListForBattleSet_C_InitListSetting final
{
public:
	E_BattleSetInfoType                           InInfoType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIgnoreSortAndFilterInit;                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESortTypeCategory                             LocalSortTypeCategory;                             // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         LocalSortSaveType;                                 // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalEquipmentTextId;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIgnoreSortAndFilterInit;                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BattleSetInfoType                           LocalInfoType;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BattleSetInfoType                           Temp_byte_Variable_4;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_5;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_6;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_7;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_8;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_9;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_10;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_11;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_12;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BattleSetInfoType                           Temp_byte_Variable_13;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_14;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_15;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_16;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_17;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_18;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_19;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_20;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_21;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_22;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFilter_Type                                  K2Node_Select_Default;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         K2Node_Select_Default_1;                           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBItemSortType                               CallFunc_GetSortType_OutSortType;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_23;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBItemSortType                               CallFunc_GetSortType_OutSortType_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8372[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	ESortTypeCategory                             Temp_byte_Variable_24;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8373[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C8(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0108(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0160(0x0010)(ReferenceParm)
	E_BattleSetInfoType                           Temp_byte_Variable_25;                             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8374[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0188(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
