#pragma once

 

// Package: EventShopCheckList_Destination

#include "Basic.hpp"

#include "EventShopCheckList_DestType_structs.hpp"


namespace SDK::Params
{

// Function EventShopCheckList_Destination.EventShopCheckList_Destination_C.ExecuteUbergraph_EventShopCheckList_Destination
// 0x0040 (0x0040 - 0x0000)
struct EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EventShopCheckList_DestType                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EventShopCheckList_DestType                   Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D9[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination) == 0x000004, "Wrong alignment on EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination");
static_assert(sizeof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination) == 0x000040, "Wrong size on EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, EntryPoint) == 0x000000, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_byte_Variable) == 0x000004, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable) == 0x000008, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_1) == 0x00000C, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_2) == 0x000010, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_3) == 0x000014, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_4) == 0x000018, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_byte_Variable_1) == 0x00001C, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_5) == 0x000020, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_6) == 0x000024, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_7) == 0x000028, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_8) == 0x00002C, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, Temp_int_Variable_9) == 0x000030, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, K2Node_Select_Default) == 0x000034, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, K2Node_Select_Default_1) == 0x000038, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'EventShopCheckList_Destination_C_ExecuteUbergraph_EventShopCheckList_Destination::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

}

