#pragma once

 

// Package: EventShopCheckList

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "EventShopCheckList_ItemType_structs.hpp"
#include "EventShopCheckList_DestType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function EventShopCheckList.EventShopCheckList_C.ExecuteUbergraph_EventShopCheckList
// 0x0158 (0x0158 - 0x0000)
struct EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64EA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64EB[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64EC[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64ED[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64EE[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_2;     // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_3;     // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_2;                           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList) == 0x000008, "Wrong alignment on EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList");
static_assert(sizeof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList) == 0x000158, "Wrong size on EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, EntryPoint) == 0x000000, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, Temp_int_Variable) == 0x000008, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, Temp_int_Variable_1) == 0x00000C, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_GetValidValue_ReturnValue) == 0x000018, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000019, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001B, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, Temp_bool_Variable) == 0x000024, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, Temp_bool_Variable_1) == 0x000025, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, Temp_bool_Variable_2) == 0x000026, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, Temp_string_Variable) == 0x000028, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_PlaySE_ReturnValue) == 0x000038, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003D, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003E, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000040, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Concat_StrStr_ReturnValue) == 0x000058, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_GetTextFromAssetByName_ReturnValue_1) == 0x000068, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_GetTextFromAssetByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_GetTextFromAssetByName_ReturnValue_2) == 0x000078, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_GetTextFromAssetByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_MakeLiteralString_ReturnValue) == 0x000098, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, K2Node_Select_Default) == 0x0000A8, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, K2Node_Select_Default_1) == 0x0000B8, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_GetTextFromAssetByName_ReturnValue_3) == 0x0000C8, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_GetTextFromAssetByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E8, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_PlayAnimation_ReturnValue) == 0x0000F8, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, K2Node_Select_Default_2) == 0x000100, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000110, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000128, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_PlaySE_ReturnValue_1) == 0x000150, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList, CallFunc_Not_PreBool_ReturnValue_3) == 0x000154, "Member 'EventShopCheckList_C_ExecuteUbergraph_EventShopCheckList::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");

// Function EventShopCheckList.EventShopCheckList_C.Get Item Type
// 0x0008 (0x0008 - 0x0000)
struct EventShopCheckList_C_Get_Item_Type final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Type;                                              // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EventShopCheckList_C_Get_Item_Type) == 0x000004, "Wrong alignment on EventShopCheckList_C_Get_Item_Type");
static_assert(sizeof(EventShopCheckList_C_Get_Item_Type) == 0x000008, "Wrong size on EventShopCheckList_C_Get_Item_Type");
static_assert(offsetof(EventShopCheckList_C_Get_Item_Type, ID) == 0x000000, "Member 'EventShopCheckList_C_Get_Item_Type::ID' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Get_Item_Type, Type) == 0x000004, "Member 'EventShopCheckList_C_Get_Item_Type::Type' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Get_Item_Type, CallFunc_Conv_IntToByte_ReturnValue) == 0x000005, "Member 'EventShopCheckList_C_Get_Item_Type::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Get_Item_Type, CallFunc_GetValidValue_ReturnValue) == 0x000006, "Member 'EventShopCheckList_C_Get_Item_Type::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Get_Item_Type, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'EventShopCheckList_C_Get_Item_Type::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function EventShopCheckList.EventShopCheckList_C.Initialize
// 0x0078 (0x0078 - 0x0000)
struct EventShopCheckList_C_Initialize final
{
public:
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64EF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64F0[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBTemporallyStorage*                   CallFunc_GetTemporallyStorage_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetInventory_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   CallFunc_GetTemporallyStorage_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   CallFunc_GetTemporallyStorage_ReturnValue_2;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   CallFunc_GetTemporallyStorage_ReturnValue_3;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopCheckList_C_Initialize) == 0x000008, "Wrong alignment on EventShopCheckList_C_Initialize");
static_assert(sizeof(EventShopCheckList_C_Initialize) == 0x000078, "Wrong size on EventShopCheckList_C_Initialize");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetNetworkDataCache_IsValid) == 0x000000, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetNetworkDataCache_IsValid' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetNetworkDataCache_ReturnValue) == 0x000008, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'EventShopCheckList_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetStorage_ReturnValue) == 0x000028, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000030, "Member 'EventShopCheckList_C_Initialize::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'EventShopCheckList_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetTemporallyStorage_ReturnValue) == 0x000040, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetTemporallyStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetCharacterStorage_ReturnValue) == 0x000048, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetCharacterStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetInventory_ReturnValue) == 0x000050, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetTemporallyStorage_ReturnValue_1) == 0x000058, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetTemporallyStorage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetTemporallyStorage_ReturnValue_2) == 0x000060, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetTemporallyStorage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetStorage_ReturnValue_1) == 0x000068, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetStorage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_Initialize, CallFunc_GetTemporallyStorage_ReturnValue_3) == 0x000070, "Member 'EventShopCheckList_C_Initialize::CallFunc_GetTemporallyStorage_ReturnValue_3' has a wrong offset!");

// Function EventShopCheckList.EventShopCheckList_C.CreateIconList
// 0x01C8 (0x01C8 - 0x0000)
struct EventShopCheckList_C_CreateIconList final
{
public:
	bool                                          L_IsEquipmentGender;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64F1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_ItemName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EItemType                                     L_ItemType;                                        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             L_ItemRewardType;                                  // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F2[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_ItemId;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_SelectNum;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_AttarId;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBEventShopPurchaseItemInfo           L_ProductData;                                     // 0x0028(0x0030)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F3[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventShopCheckList_Icon_C*             CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64F4[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            CallFunc_GetPlayerGender_OutGender;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64F5[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x0080(0x0088)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64F6[0x5];                                     // 0x010B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventShopPurchaseItemInfo           CallFunc_Array_Get_Item;                           // 0x0110(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable;                                // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F7[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64F8[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable_1;                              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64F9[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_1;           // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64FA[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_1;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_GetEventShopItemSetMasterById_IsExists; // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64FB[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventShopItemSetMasterData          CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue; // 0x0184(0x0034)(NoDestructor)
	EEquipableGender                              Temp_byte_Variable_2;                              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            K2Node_Select_Default;                             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     CallFunc_Get_Item_Type_Type;                       // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FC[0x2];                                     // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopCheckList_C_CreateIconList) == 0x000008, "Wrong alignment on EventShopCheckList_C_CreateIconList");
static_assert(sizeof(EventShopCheckList_C_CreateIconList) == 0x0001C8, "Wrong size on EventShopCheckList_C_CreateIconList");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_IsEquipmentGender) == 0x000000, "Member 'EventShopCheckList_C_CreateIconList::L_IsEquipmentGender' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_ItemName) == 0x000008, "Member 'EventShopCheckList_C_CreateIconList::L_ItemName' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_ItemType) == 0x000018, "Member 'EventShopCheckList_C_CreateIconList::L_ItemType' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_ItemRewardType) == 0x000019, "Member 'EventShopCheckList_C_CreateIconList::L_ItemRewardType' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_ItemId) == 0x00001C, "Member 'EventShopCheckList_C_CreateIconList::L_ItemId' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_SelectNum) == 0x000020, "Member 'EventShopCheckList_C_CreateIconList::L_SelectNum' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_AttarId) == 0x000024, "Member 'EventShopCheckList_C_CreateIconList::L_AttarId' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, L_ProductData) == 0x000028, "Member 'EventShopCheckList_C_CreateIconList::L_ProductData' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, Temp_int_Array_Index_Variable) == 0x000058, "Member 'EventShopCheckList_C_CreateIconList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Create_ReturnValue) == 0x000060, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_GetMasterDataManager_IsValid) == 0x000068, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_GetMasterDataManager_ReturnValue) == 0x000070, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_GetPlayerGender_OutGender) == 0x000078, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_GetPlayerGender_OutGender' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_BP_FindCostumeMaster_IsExist) == 0x000079, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_BP_FindCostumeMaster_IsExist' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_BP_FindCostumeMaster_ReturnValue) == 0x000080, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_BP_FindCostumeMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Not_PreBool_ReturnValue) == 0x000108, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000109, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_BooleanAND_ReturnValue) == 0x00010A, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Array_Get_Item) == 0x000110, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, Temp_byte_Variable) == 0x000144, "Member 'EventShopCheckList_C_CreateIconList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, Temp_int_Loop_Counter_Variable) == 0x000148, "Member 'EventShopCheckList_C_CreateIconList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Add_IntInt_ReturnValue) == 0x000150, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, Temp_byte_Variable_1) == 0x000154, "Member 'EventShopCheckList_C_CreateIconList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Percent_IntInt_ReturnValue) == 0x000158, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Multiply_IntInt_ReturnValue) == 0x00015C, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Divide_IntInt_ReturnValue) == 0x000160, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_GetMasterDataManager_IsValid_1) == 0x000164, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_GetMasterDataManager_IsValid_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_GetMasterDataManager_ReturnValue_1) == 0x000168, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_GetMasterDataManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, K2Node_MakeStruct_Margin) == 0x000170, "Member 'EventShopCheckList_C_CreateIconList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_BP_GetEventShopItemSetMasterById_IsExists) == 0x000180, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_BP_GetEventShopItemSetMasterById_IsExists' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue) == 0x000184, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, Temp_byte_Variable_2) == 0x0001B8, "Member 'EventShopCheckList_C_CreateIconList::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, K2Node_Select_Default) == 0x0001B9, "Member 'EventShopCheckList_C_CreateIconList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Get_Item_Type_Type) == 0x0001BA, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Get_Item_Type_Type' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001BB, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001BC, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_GetValidValue_ReturnValue) == 0x0001BD, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateIconList, CallFunc_AddChildToGrid_ReturnValue) == 0x0001C0, "Member 'EventShopCheckList_C_CreateIconList::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");

// Function EventShopCheckList.EventShopCheckList_C.CreateItemList_Storage_I
// 0x0160 (0x0160 - 0x0000)
struct EventShopCheckList_C_CreateItemList_Storage_I final
{
public:
	int32                                         L_Storage_Limit;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Storage_Now;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsOver;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64FD[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventShopCheckList_Destination_C*      L_WBP_Dest;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_IsCreateDest;                                    // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64FE[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 L_ItemName;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EItemType                                     L_ItemType;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             L_ItemRewardType;                                  // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64FF[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         L_ItemId;                                          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_SelectNum;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6500[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventShopPurchaseItemInfo           L_ProductData;                                     // 0x0040(0x0030)(Edit, BlueprintVisible)
	class FString                                 CallFunc_GetItemName_OutName;                      // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemName_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6501[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6502[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStackableNum_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BP_GetItemAmount_ByItemIndex_ReturnValue; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6503[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6504[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventShopCheckList_Destination_C*      CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCheckListItemType_IsOk;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6505[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventShopCheckList_Item_Storage_C*     CallFunc_Create_ReturnValue_1;                     // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6506[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6507[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetEventShopItemSetMasterById_IsExists; // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6508[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventShopItemSetMasterData          CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue; // 0x00EC(0x0034)(NoDestructor)
	struct FSBEventShopPurchaseItemInfo           CallFunc_Array_Get_Item;                           // 0x0120(0x0030)()
	EItemType                                     CallFunc_Get_Item_Type_Type;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6509[0x1];                                     // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EventShopCheckList_C_CreateItemList_Storage_I) == 0x000008, "Wrong alignment on EventShopCheckList_C_CreateItemList_Storage_I");
static_assert(sizeof(EventShopCheckList_C_CreateItemList_Storage_I) == 0x000160, "Wrong size on EventShopCheckList_C_CreateItemList_Storage_I");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_Storage_Limit) == 0x000000, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_Storage_Limit' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_Storage_Now) == 0x000004, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_Storage_Now' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_IsOver) == 0x000008, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_IsOver' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_WBP_Dest) == 0x000010, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_WBP_Dest' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_IsCreateDest) == 0x000018, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_IsCreateDest' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_ItemName) == 0x000020, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_ItemName' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_ItemType) == 0x000030, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_ItemType' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_ItemRewardType) == 0x000031, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_ItemRewardType' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_ItemId) == 0x000034, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_ItemId' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_SelectNum) == 0x000038, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_SelectNum' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, L_ProductData) == 0x000040, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::L_ProductData' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_GetItemName_OutName) == 0x000070, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_GetItemName_OutName' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_GetItemName_ReturnValue) == 0x000080, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_GetStackableNum_ReturnValue) == 0x000090, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_GetStackableNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_BP_GetItemAmount_ByItemIndex_ReturnValue) == 0x000094, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_BP_GetItemAmount_ByItemIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_AddChild_ReturnValue) == 0x000098, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A8, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_GetCheckListItemType_IsOk) == 0x0000B8, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_GetCheckListItemType_IsOk' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Create_ReturnValue_1) == 0x0000C0, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000C8, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_AddChild_ReturnValue_1) == 0x0000D0, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopCheckList_C_CreateItemList_Storage_I, CallFunc_GetMasterDataManager_IsValid) == 0x0000D8, "Member 'EventShopCheckList_C_CreateItemList_Storage_I::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
