#pragma once

 

// Package: EventShopProductBox_Item

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EventShopProductBox_Item.EventShopProductBox_Item_C.OnBtnSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature final
{
public:
	class UEventShopProductBox_Item_C*            Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOnNumberInput;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature) == 0x000008, "Wrong alignment on EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature");
static_assert(sizeof(EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature) == 0x000010, "Wrong size on EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature");
static_assert(offsetof(EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature, Item) == 0x000000, "Member 'EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature, bOnNumberInput) == 0x000008, "Member 'EventShopProductBox_Item_C_OnBtnSelected__DelegateSignature::bOnNumberInput' has a wrong offset!");

// Function EventShopProductBox_Item.EventShopProductBox_Item_C.OnAdd__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct EventShopProductBox_Item_C_OnAdd__DelegateSignature final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopProductBox_Item_C_OnAdd__DelegateSignature) == 0x000004, "Wrong alignment on EventShopProductBox_Item_C_OnAdd__DelegateSignature");
static_assert(sizeof(EventShopProductBox_Item_C_OnAdd__DelegateSignature) == 0x000004, "Wrong size on EventShopProductBox_Item_C_OnAdd__DelegateSignature");
static_assert(offsetof(EventShopProductBox_Item_C_OnAdd__DelegateSignature, Num) == 0x000000, "Member 'EventShopProductBox_Item_C_OnAdd__DelegateSignature::Num' has a wrong offset!");

// Function EventShopProductBox_Item.EventShopProductBox_Item_C.OnSub__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct EventShopProductBox_Item_C_OnSub__DelegateSignature final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopProductBox_Item_C_OnSub__DelegateSignature) == 0x000004, "Wrong alignment on EventShopProductBox_Item_C_OnSub__DelegateSignature");
static_assert(sizeof(EventShopProductBox_Item_C_OnSub__DelegateSignature) == 0x000004, "Wrong size on EventShopProductBox_Item_C_OnSub__DelegateSignature");
static_assert(offsetof(EventShopProductBox_Item_C_OnSub__DelegateSignature, Num) == 0x000000, "Member 'EventShopProductBox_Item_C_OnSub__DelegateSignature::Num' has a wrong offset!");

// Function EventShopProductBox_Item.EventShopProductBox_Item_C.OnAddRemake__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventShopProductBox_Item_C_OnAddRemake__DelegateSignature final
{
public:
	class UEventShopProductBox_Item_C*            Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopProductBox_Item_C_OnAddRemake__DelegateSignature) == 0x000008, "Wrong alignment on EventShopProductBox_Item_C_OnAddRemake__DelegateSignature");
static_assert(sizeof(EventShopProductBox_Item_C_OnAddRemake__DelegateSignature) == 0x000008, "Wrong size on EventShopProductBox_Item_C_OnAddRemake__DelegateSignature");
static_assert(offsetof(EventShopProductBox_Item_C_OnAddRemake__DelegateSignature, Item) == 0x000000, "Member 'EventShopProductBox_Item_C_OnAddRemake__DelegateSignature::Item' has a wrong offset!");

// Function EventShopProductBox_Item.EventShopProductBox_Item_C.OnSubRemake__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct EventShopProductBox_Item_C_OnSubRemake__DelegateSignature final
{
public:
	class UEventShopProductBox_Item_C*            Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShopProductBox_Item_C_OnSubRemake__DelegateSignature) == 0x000008, "Wrong alignment on EventShopProductBox_Item_C_OnSubRemake__DelegateSignature");
static_assert(sizeof(EventShopProductBox_Item_C_OnSubRemake__DelegateSignature) == 0x000008, "Wrong size on EventShopProductBox_Item_C_OnSubRemake__DelegateSignature");
static_assert(offsetof(EventShopProductBox_Item_C_OnSubRemake__DelegateSignature, Item) == 0x000000, "Member 'EventShopProductBox_Item_C_OnSubRemake__DelegateSignature::Item' has a wrong offset!");

// Function EventShopProductBox_Item.EventShopProductBox_Item_C.ExecuteUbergraph_EventShopProductBox_Item
// 0x0540 (0x0540 - 0x0000)
struct EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6403[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6404[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Type;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6405[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	int32                                         K2Node_CustomEvent_Stock;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_limit;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6406[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6407[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6408[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6409[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640A[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640B[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640C[0x1];                                     // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ItemType;                       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_640D[0x1];                                     // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ItemSetId;                      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640E[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetEventShopItemSetMasterById_IsExists; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_640F[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEventShopItemSetMasterData          CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue; // 0x011C(0x0034)(NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6410[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_DateTimeToTermText_ReturnValue;           // 0x0158(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0170(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6411[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetAmountNum_Remain;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6412[0x5];                                     // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01B0(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01C8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01F0(0x0028)()
	int32                                         CallFunc_GetStorageRemainNum_Remain;               // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateDiscountValue_OutDiscountValue;  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6413[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0238(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0240(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSkillId_Exchangeable;                  // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6414[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_CustomEvent_End;                            // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue;                  // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0273(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMasterySkill_ReturnValue;               // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6415[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0278(0x0028)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x02A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x02AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x02B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6416[0x3];                                     // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x02B8(0x0028)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SwitchHoldType_IsToken;                   // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6417[0x5];                                     // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x02E8(0x0018)()
	bool                                          CallFunc_ValidShopNotAvailable_ReturnValue;        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6418[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_Select_Default_2;                           // 0x0308(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidShopNotAvailable_ReturnValue_1;      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0312(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0313(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6419[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_4;                           // 0x0318(0x0028)()
	bool                                          Temp_bool_Variable_5;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641A[0x7];                                     // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x0348(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641B[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641C[0x3];                                     // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x036C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x037C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x038C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_641D[0x4];                                     // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x03A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_641E[0x2];                                     // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_641F[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x03C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSBEventShopProduct                    K2Node_CustomEvent_ProductData;                    // 0x03C8(0x0070)()
	float                                         K2Node_CustomEvent_DiscountRate;                   // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDiscount;                     // 0x043C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6420[0x3];                                     // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBTemporallyStorage*                   K2Node_CustomEvent_Item;                           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   K2Node_CustomEvent_Equip;                          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   K2Node_CustomEvent_Storage;                        // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   K2Node_CustomEvent_Ornament;                       // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0464(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6421[0x3];                                     // 0x0479(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6422[0x3];                                     // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x048C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x049C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_CheckExchangeLimitNum_LimitNum;           // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x04B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6423[0x1];                                     // 0x04B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Num;                            // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_2;               // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6424[0x3];                                     // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_6;                           // 0x04C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x04D0(0x0028)()
	int32                                         K2Node_CustomEvent_CurrencyType;                   // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TokenId;                        // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetTokenIconTexture_Texture;              // 0x0500(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6425[0x1];                                     // 0x052B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x052C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Select_Default_7;                           // 0x053C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bTrying;                        // 0x053D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item) == 0x000008, "Wrong alignment on EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item");
static_assert(sizeof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item) == 0x000540, "Wrong size on EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, EntryPoint) == 0x000000, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, Temp_object_Variable) == 0x000010, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_DynamicCast_AsTexture_2D) == 0x000018, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_Type) == 0x000024, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_Type' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_GetTextFromAsset_ReturnValue) == 0x000030, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_Stock) == 0x000058, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_Stock' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_limit) == 0x00005C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_limit' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, Temp_object_Variable_1) == 0x000060, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_DynamicCast_AsTexture_2D_1) == 0x000070, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_DynamicCast_AsTexture_2D_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_IntToString_ReturnValue) == 0x000080, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Greater_IntInt_ReturnValue) == 0x000090, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000C8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_IntToText_ReturnValue) == 0x0000D0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000E8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_Loaded_1) == 0x0000F0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BooleanAND_ReturnValue) == 0x0000F8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, Temp_bool_Variable) == 0x0000F9, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000FA, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_ItemType) == 0x0000FC, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_ItemType' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_IntToByte_ReturnValue) == 0x000100, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000101, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_GetValidValue_ReturnValue) == 0x000102, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_ItemSetId) == 0x000104, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_ItemSetId' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_GetMasterDataManager_IsValid) == 0x000108, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_GetMasterDataManager_ReturnValue) == 0x000110, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BP_GetEventShopItemSetMasterById_IsExists) == 0x000118, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BP_GetEventShopItemSetMasterById_IsExists' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue) == 0x00011C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BP_GetEventShopItemSetMasterById_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, Temp_bool_Variable_1) == 0x000150, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_DateTimeToTermText_ReturnValue) == 0x000158, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_DateTimeToTermText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000170, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Not_PreBool_ReturnValue) == 0x000188, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CreateDelegate_OutputDelegate) == 0x00018C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_GetAmountNum_Remain) == 0x00019C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_GetAmountNum_Remain' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001A0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0001A9, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0001AA, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001B0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_MakeStruct_SlateColor) == 0x0001C8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_MakeStruct_SlateColor_1) == 0x0001F0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_GetStorageRemainNum_Remain) == 0x000218, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_GetStorageRemainNum_Remain' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_CalculateDiscountValue_OutDiscountValue) == 0x00021C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_CalculateDiscountValue_OutDiscountValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000220, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_SelectInt_ReturnValue) == 0x000230, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000238, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000240, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000258, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_SetSkillId_Exchangeable) == 0x000259, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_SetSkillId_Exchangeable' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_SwitchEnum_CmpSuccess) == 0x00025A, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Not_PreBool_ReturnValue_1) == 0x00025B, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, Temp_bool_Variable_2) == 0x00025C, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_CustomEvent_End) == 0x000260, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_CustomEvent_End' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_DateTimeMinValue_ReturnValue) == 0x000268, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x000270, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_SetDateTime_ReturnValue) == 0x000271, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_SetDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_Not_PreBool_ReturnValue_2) == 0x000272, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_Select_Default) == 0x000273, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_IsMasterySkill_ReturnValue) == 0x000274, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_IsMasterySkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, K2Node_MakeStruct_SlateColor_2) == 0x000278, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002A0, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002A1, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002A2, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0002A3, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BooleanOR_ReturnValue) == 0x0002A4, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0002A5, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BooleanOR_ReturnValue_1) == 0x0002A6, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0002A7, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BooleanOR_ReturnValue_2) == 0x0002A8, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0002A9, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_BooleanOR_ReturnValue_3) == 0x0002AA, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0002AB, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x0002AC, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x0002AD, "Member 'EventShopProductBox_Item_C_ExecuteUbergraph_EventShopProductBox_Item::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
