#pragma once

 

// Package: EventShop

#include "Basic.hpp"

#include "E_SBDetailsZoomIn_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EventShop.EventShop_C.ExecuteUbergraph_EventShop
// 0x05E0 (0x05E0 - 0x0000)
struct EventShop_C_ExecuteUbergraph_EventShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6442[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDialog_TacticalAbilityLearning_C*      K2Node_CustomEvent_Dialog_1;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialog_TacticalAbilityLearning_C*      K2Node_CustomEvent_Dialog;                         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result_4;                       // 0x0044(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6443[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode_3;                      // 0x0048(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6444[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBEventShopExchangeHistory>    K2Node_CustomEvent_History;                        // 0x0050(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0060(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0018)()
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAdventureBoardComponent*       CallFunc_GetAdventureBoardComponent_ReturnValue;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RetCode_2;                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6445[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result_3;                       // 0x00A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6446[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x00AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCryptoCurrency                      K2Node_CustomEvent_Cryptocurrency;                 // 0x00B0(0x0028)(ConstParm, NoDestructor)
	class USBRmShopComponent*                     CallFunc_GetRmShopComponent_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Request_GetCryptocurrency_ReturnValue;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6447[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUMG_ProductDetailMenu_C* Sender)> K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result, int32 RetCode, struct FSBCryptoCurrency& Cryptocurrency)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bShow;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6448[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SBProductItemData_C*                K2Node_ComponentBoundEvent_Data;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProductDetailMenu_C*               CallFunc_Create_ReturnValue;                       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProductDetailMenu_C*               K2Node_CustomEvent_Sender_1;                       // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SBDetailsZoomIn                             K2Node_ComponentBoundEvent_Type;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6449[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SBProductItemData_C*                K2Node_CustomEvent_Sender;                         // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bTrying;                        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_644A[0x3];                                     // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventShopProductBox_Item_C*            K2Node_DynamicCast_AsEvent_Shop_Product_Box_Item;  // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_2;                       // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InMessage;                      // 0x01A8(0x0018)()
	bool                                          CallFunc_GetSystemMessageManager_IsValid;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_644B[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBSystemMessageManager*                CallFunc_GetSystemMessageManager_ReturnValue;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_644C[0x2];                                     // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result, int32 RetCode, TArray<struct FSBEventShopExchangeHistory>& History)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x01E4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_644D[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x01E8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_644E[0x3];                                     // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue_1;            // 0x01F0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0200(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_2;                     // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_644F[0x2];                                     // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Selected;                       // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6450[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBEventShopProduct                    CallFunc_Array_Get_Item_1;                         // 0x0238(0x0070)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6451[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBEventShopProduct                    K2Node_MakeStruct_SBEventShopProduct;              // 0x02B0(0x0070)()
	class FName                                   Temp_name_Variable;                                // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0338(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array_1;                          // 0x0358(0x0010)(ConstParm, ReferenceParm)
	struct FSBEventShopPurchaseItemInfo           CallFunc_Array_Get_Item_2;                         // 0x0368(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6452[0x3];                                     // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBEventShopStorage                           CallFunc_GetEventShopStorageData_ReturnValue;      // 0x03B4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6453[0x2];                                     // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShopType                                     Temp_byte_Variable;                                // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6454[0x3];                                     // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x03D4(0x0010)(ZeroConstructor, NoDestructor)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6455[0x3];                                     // 0x03E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventShopProductBox_Item_C*            K2Node_DynamicCast_AsEvent_Shop_Product_Box_Item_1; // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetTAbiiltyClass_ClassType;               // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6456[0x2];                                     // 0x03FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EYesNoDialogResult Result)>    K2Node_CreateDelegate_OutputDelegate_6;            // 0x03FC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EYesNoDialogResult                            K2Node_CustomEvent_Result;                         // 0x040D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x040E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6457[0x1];                                     // 0x040F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0420(0x0018)()
	class USBDialog*                              CallFunc_ShowYesNoDialog_ReturnValue;              // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StorageCheckSelectItem_Ret;               // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6458[0x3];                                     // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0444(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6459[0x3];                                     // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0458(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_645A[0x4];                                     // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventShopProductBox_Item_C*            K2Node_CustomEvent_Item;                           // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOnNumberInput;                 // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_645B[0x2];                                     // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventShopCheckList_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0488(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x04A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_645C[0x4];                                     // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x04A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_645D[0x5];                                     // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_645E[0x7];                                     // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x04D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_645F[0x3];                                     // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue_1;           // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_3;                     // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x04FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6460[0x2];                                     // 0x04FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Selected)>               K2Node_CreateDelegate_OutputDelegate_10;           // 0x0508(0x0010)(ZeroConstructor, NoDestructor)
	class UEventShopStorageSelect_C*              CallFunc_GetBpStorageSelect_Widget;                // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventShopStorageSelect_C*              CallFunc_GetBpStorageSelect_Widget_1;              // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USelectorDialog_C*                      CallFunc_Create_ReturnValue_2;                     // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialog_TacticalAbilityLearning_C*      CallFunc_Create_ReturnValue_3;                     // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Ret;                            // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6461[0x4];                                     // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue_2;            // 0x0540(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool Result, int32 RetCode)>   K2Node_CreateDelegate_OutputDelegate_11;           // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0560(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6462[0x7];                                     // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESBClassType>                          CallFunc_GetSortedPlayerClassList_ReturnValue;     // 0x0580(0x0010)(ReferenceParm)
	ESBClassType                                  CallFunc_Array_Get_Item_3;                         // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6463[0x3];                                     // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0594(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RequestCharaSkillMasteryOthers_ReturnValue; // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6464[0x3];                                     // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x05A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x05B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x05B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6465[0x7];                                     // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x05C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EventShop_C_ExecuteUbergraph_EventShop) == 0x000008, "Wrong alignment on EventShop_C_ExecuteUbergraph_EventShop");
static_assert(sizeof(EventShop_C_ExecuteUbergraph_EventShop) == 0x0005E0, "Wrong size on EventShop_C_ExecuteUbergraph_EventShop");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, EntryPoint) == 0x000000, "Member 'EventShop_C_ExecuteUbergraph_EventShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Dialog_1) == 0x000008, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Dialog_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Dialog) == 0x000010, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Dialog' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetTextFromAsset_ReturnValue) == 0x000018, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_PlaySE_ReturnValue) == 0x000040, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Result_4) == 0x000044, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Result_4' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_RetCode_3) == 0x000048, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_RetCode_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_History) == 0x000050, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_History' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetSBRetMessage_ReturnValue) == 0x000060, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000070, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetSBPlayerController_ReturnValue) == 0x000088, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetAdventureBoardComponent_ReturnValue) == 0x000090, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetAdventureBoardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_RetCode_2) == 0x000098, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_RetCode_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetSBPlayerController_ReturnValue_1) == 0x0000A0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetSBPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Result_3) == 0x0000A8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Result_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_RetCode_1) == 0x0000AC, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Cryptocurrency) == 0x0000B0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Cryptocurrency' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetRmShopComponent_ReturnValue) == 0x0000D8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetRmShopComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Request_GetCryptocurrency_ReturnValue) == 0x0000E0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Request_GetCryptocurrency_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_PlaySE_ReturnValue_1) == 0x0000E4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_MakeArray_Array) == 0x000108, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Array_Get_Item) == 0x000118, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000120, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetDisplayName_ReturnValue) == 0x000128, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_ComponentBoundEvent_bShow) == 0x000138, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_ComponentBoundEvent_bShow' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Not_PreBool_ReturnValue) == 0x000139, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_ComponentBoundEvent_Data) == 0x000140, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_ComponentBoundEvent_Data' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetOwningPlayer_ReturnValue) == 0x000148, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Create_ReturnValue) == 0x000150, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Sender_1) == 0x000158, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Sender_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_AddChildToCanvas_ReturnValue) == 0x000160, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_ComponentBoundEvent_Type) == 0x000168, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Sender) == 0x000170, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_bTrying) == 0x000178, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_bTrying' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_int_Array_Index_Variable) == 0x00017C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_DynamicCast_AsEvent_Shop_Product_Box_Item) == 0x000180, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_DynamicCast_AsEvent_Shop_Product_Box_Item' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_IsValid_ReturnValue) == 0x000189, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Result_2) == 0x00018A, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Result_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_SwitchEnum_CmpSuccess) == 0x00018B, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_int_Array_Index_Variable_1) == 0x00018C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_2) == 0x000190, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_int_Loop_Counter_Variable) == 0x0001A0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Add_IntInt_ReturnValue) == 0x0001A4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_InMessage) == 0x0001A8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_InMessage' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetSystemMessageManager_IsValid) == 0x0001C0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetSystemMessageManager_IsValid' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetSystemMessageManager_ReturnValue) == 0x0001C8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetSystemMessageManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_bool_True_if_break_was_hit_Variable) == 0x0001D0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001D1, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001D4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Result_1) == 0x0001E4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_RetCode) == 0x0001E8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001EC, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetSBRetMessage_ReturnValue_1) == 0x0001F0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetSBRetMessage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000200, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_int_Loop_Counter_Variable_1) == 0x000218, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Add_IntInt_ReturnValue_1) == 0x00021C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_PlaySE_ReturnValue_2) == 0x000220, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Array_Length_ReturnValue) == 0x000224, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000228, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Not_PreBool_ReturnValue_2) == 0x000229, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Selected) == 0x00022C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_IsEmpty_ReturnValue) == 0x000230, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_int_Array_Index_Variable_2) == 0x000234, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Array_Get_Item_1) == 0x000238, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002A8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Subtract_IntInt_ReturnValue) == 0x0002AC, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_MakeStruct_SBEventShopProduct) == 0x0002B0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_MakeStruct_SBEventShopProduct' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_name_Variable) == 0x000320, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000328, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x000338, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetTextFromAsset_ReturnValue_3) == 0x000348, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetTextFromAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_MakeArray_Array_1) == 0x000358, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Array_Get_Item_2) == 0x000368, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Array_Length_ReturnValue_1) == 0x000398, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Less_IntInt_ReturnValue) == 0x00039C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003A0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Array_AddUnique_ReturnValue) == 0x0003B0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetEventShopStorageData_ReturnValue) == 0x0003B4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetEventShopStorageData_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_SwitchEnum_CmpSuccess_1) == 0x0003B5, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_name_Variable_1) == 0x0003B8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_name_Variable_2) == 0x0003C0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_name_Variable_3) == 0x0003C8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_byte_Variable) == 0x0003D0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_5) == 0x0003D4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetClassType_ReturnValue) == 0x0003E4, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetChildAt_ReturnValue) == 0x0003E8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_DynamicCast_AsEvent_Shop_Product_Box_Item_1) == 0x0003F0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_DynamicCast_AsEvent_Shop_Product_Box_Item_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_DynamicCast_bSuccess_1) == 0x0003F8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetTAbiiltyClass_ClassType) == 0x0003F9, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetTAbiiltyClass_ClassType' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003FC, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00040C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Result) == 0x00040D, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_SwitchEnum_CmpSuccess_2) == 0x00040E, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000410, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000420, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_ShowYesNoDialog_ReturnValue) == 0x000438, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_ShowYesNoDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_StorageCheckSelectItem_Ret) == 0x000440, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_StorageCheckSelectItem_Ret' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_7) == 0x000444, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Not_PreBool_ReturnValue_3) == 0x000454, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_8) == 0x000458, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_int_Loop_Counter_Variable_2) == 0x000468, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Item) == 0x000470, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_bOnNumberInput) == 0x000478, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_bOnNumberInput' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Less_IntInt_ReturnValue_1) == 0x000479, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Add_IntInt_ReturnValue_2) == 0x00047C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_Create_ReturnValue_1) == 0x000480, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CreateDelegate_OutputDelegate_9) == 0x000488, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_ComponentBoundEvent_Index) == 0x000498, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, K2Node_CustomEvent_Index) == 0x00049C, "Member 'EventShop_C_ExecuteUbergraph_EventShop::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0004A0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_GetVisibility_ReturnValue) == 0x0004A1, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0004A2, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_bool_Variable) == 0x0004A3, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_K2_SetTimer_ReturnValue) == 0x0004A8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, CallFunc_K2_SetTimer_ReturnValue_1) == 0x0004B0, "Member 'EventShop_C_ExecuteUbergraph_EventShop::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(EventShop_C_ExecuteUbergraph_EventShop, Temp_bool_Variable_1) == 0x0004B8, "Member 'EventShop_C_ExecuteUbergraph_EventShop::Temp_bool_Variable_1' has a wrong offset!");
