#pragma once

 

// Package: Fang_expedition_DetailItemReplacedAnm

#include "Basic.hpp"


namespace SDK::Params
{

// Function Fang_expedition_DetailItemReplacedAnm.Fang_expedition_DetailItemReplacedAnm_C.ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm) == 0x000004, "Wrong alignment on Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm");
static_assert(sizeof(Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm) == 0x000004, "Wrong size on Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm");
static_assert(offsetof(Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm, EntryPoint) == 0x000000, "Member 'Fang_expedition_DetailItemReplacedAnm_C_ExecuteUbergraph_Fang_expedition_DetailItemReplacedAnm::EntryPoint' has a wrong offset!");

// Function Fang_expedition_DetailItemReplacedAnm.Fang_expedition_DetailItemReplacedAnm_C.PlayAnm
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_DetailItemReplacedAnm_C_PlayAnm final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_DetailItemReplacedAnm_C_PlayAnm) == 0x000008, "Wrong alignment on Fang_expedition_DetailItemReplacedAnm_C_PlayAnm");
static_assert(sizeof(Fang_expedition_DetailItemReplacedAnm_C_PlayAnm) == 0x000008, "Wrong size on Fang_expedition_DetailItemReplacedAnm_C_PlayAnm");
static_assert(offsetof(Fang_expedition_DetailItemReplacedAnm_C_PlayAnm, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'Fang_expedition_DetailItemReplacedAnm_C_PlayAnm::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

