#pragma once

 

// Package: Fang_expedition_ExpeditionMountData

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "STFang_expeditionHeartData_structs.hpp"


namespace SDK::Params
{

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.ExecuteUbergraph_Fang_expedition_ExpeditionMountData
// 0x0060 (0x0060 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E10[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class UCommonIcon_C*                          K2Node_CustomEvent_Sender_4;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          K2Node_CustomEvent_Sender_3;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          K2Node_CustomEvent_Sender_2;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          K2Node_CustomEvent_Sender_1;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          K2Node_CustomEvent_Sender;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTipContent_MultiLine_C*  CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData) == 0x000060, "Wrong size on Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, EntryPoint) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, CallFunc_GetTextFromAsset_ReturnValue) == 0x000008, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, K2Node_CustomEvent_Sender_4) == 0x000030, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::K2Node_CustomEvent_Sender_4' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, K2Node_CustomEvent_Sender_3) == 0x000038, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::K2Node_CustomEvent_Sender_3' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, K2Node_CustomEvent_Sender_2) == 0x000040, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::K2Node_CustomEvent_Sender_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, K2Node_CustomEvent_Sender_1) == 0x000048, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::K2Node_CustomEvent_Sender_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, K2Node_CustomEvent_Sender) == 0x000050, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData, CallFunc_Create_ReturnValue) == 0x000058, "Member 'Fang_expedition_ExpeditionMountData_C_ExecuteUbergraph_Fang_expedition_ExpeditionMountData::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.OnClickIcon5
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_OnClickIcon5 final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_OnClickIcon5) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_OnClickIcon5");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_OnClickIcon5) == 0x000008, "Wrong size on Fang_expedition_ExpeditionMountData_C_OnClickIcon5");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_OnClickIcon5, Sender) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_OnClickIcon5::Sender' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.OnClickIcon4
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_OnClickIcon4 final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_OnClickIcon4) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_OnClickIcon4");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_OnClickIcon4) == 0x000008, "Wrong size on Fang_expedition_ExpeditionMountData_C_OnClickIcon4");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_OnClickIcon4, Sender) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_OnClickIcon4::Sender' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.OnClickIcon3
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_OnClickIcon3 final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_OnClickIcon3) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_OnClickIcon3");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_OnClickIcon3) == 0x000008, "Wrong size on Fang_expedition_ExpeditionMountData_C_OnClickIcon3");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_OnClickIcon3, Sender) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_OnClickIcon3::Sender' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.OnClickIcon2
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_OnClickIcon2 final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_OnClickIcon2) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_OnClickIcon2");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_OnClickIcon2) == 0x000008, "Wrong size on Fang_expedition_ExpeditionMountData_C_OnClickIcon2");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_OnClickIcon2, Sender) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_OnClickIcon2::Sender' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.OnClickIcon1
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_OnClickIcon1 final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_OnClickIcon1) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_OnClickIcon1");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_OnClickIcon1) == 0x000008, "Wrong size on Fang_expedition_ExpeditionMountData_C_OnClickIcon1");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_OnClickIcon1, Sender) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_OnClickIcon1::Sender' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.ClearFangData
// 0x0020 (0x0020 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_ClearFangData final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E11[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E12[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_ClearFangData) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_ClearFangData");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_ClearFangData) == 0x000020, "Wrong size on Fang_expedition_ExpeditionMountData_C_ClearFangData");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ClearFangData, Temp_int_Variable) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_ClearFangData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ClearFangData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'Fang_expedition_ExpeditionMountData_C_ClearFangData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ClearFangData, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Fang_expedition_ExpeditionMountData_C_ClearFangData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_ClearFangData, Temp_string_Variable) == 0x000010, "Member 'Fang_expedition_ExpeditionMountData_C_ClearFangData::Temp_string_Variable' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.AddUniqueId
// 0x0018 (0x0018 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_AddUniqueId final
{
public:
	class FString                                 UniqueId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_AddUniqueId) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_AddUniqueId");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_AddUniqueId) == 0x000018, "Wrong size on Fang_expedition_ExpeditionMountData_C_AddUniqueId");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_AddUniqueId, UniqueId) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_AddUniqueId::UniqueId' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_AddUniqueId, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'Fang_expedition_ExpeditionMountData_C_AddUniqueId::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.UpdateIcon
// 0x0330 (0x0330 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_UpdateIcon final
{
public:
	class USBMasterDataManager*                   MasterManager;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LotteryCount;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E13[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 FangIds;                                           // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UCommonIcon_C*                          Target;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCommonIcon_C*>                  WorkIconList;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         LoopEnd;                                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E14[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E15[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E16[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0098(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FOwnItemInfo                           CallFunc_FindCharacterEquipment_OutResult;         // 0x00A8(0x0118)()
	bool                                          CallFunc_FindCharacterEquipment_ReturnValue;       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E17[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_FindCharacterEquipment_OutResult_1;       // 0x01C8(0x0118)()
	bool                                          CallFunc_FindCharacterEquipment_ReturnValue_1;     // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E18[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLuckyChanceNum_ReturnValue;            // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLuckyChanceNum_ReturnValue_1;          // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E19[0x3];                                     // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIcon_C*                          CallFunc_Array_Get_Item_1;                         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0308(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UCommonIcon_C*>                  K2Node_MakeArray_Array;                            // 0x0318(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_UpdateIcon) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_UpdateIcon");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_UpdateIcon) == 0x000330, "Wrong size on Fang_expedition_ExpeditionMountData_C_UpdateIcon");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, MasterManager) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::MasterManager' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, LotteryCount) == 0x000008, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::LotteryCount' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, FangIds) == 0x000010, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::FangIds' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, Target) == 0x000020, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::Target' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, WorkIconList) == 0x000028, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::WorkIconList' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, LoopEnd) == 0x000038, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::LoopEnd' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, Temp_int_Variable) == 0x00003C, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_GetMasterDataManager_IsValid) == 0x000060, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_GetMasterDataManager_ReturnValue) == 0x000068, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, Temp_int_Variable_1) == 0x000078, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Add_IntInt_ReturnValue_2) == 0x00007C, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Array_Get_Item) == 0x000080, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000088, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Add_IntInt_ReturnValue_3) == 0x00008C, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000090, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, Temp_string_Variable) == 0x000098, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_FindCharacterEquipment_OutResult) == 0x0000A8, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_FindCharacterEquipment_OutResult' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_FindCharacterEquipment_ReturnValue) == 0x0001C0, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_FindCharacterEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_FindCharacterEquipment_OutResult_1) == 0x0001C8, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_FindCharacterEquipment_OutResult_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_FindCharacterEquipment_ReturnValue_1) == 0x0002E0, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_FindCharacterEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_GetLuckyChanceNum_ReturnValue) == 0x0002E4, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_GetLuckyChanceNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Add_IntInt_ReturnValue_4) == 0x0002E8, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_GetLuckyChanceNum_ReturnValue_1) == 0x0002EC, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_GetLuckyChanceNum_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Add_IntInt_ReturnValue_5) == 0x0002F0, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Array_AddUnique_ReturnValue) == 0x0002F4, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Array_AddUnique_ReturnValue_1) == 0x0002F8, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0002FC, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Array_Get_Item_1) == 0x000300, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, Temp_string_Variable_1) == 0x000308, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, K2Node_MakeArray_Array) == 0x000318, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateIcon, CallFunc_Array_LastIndex_ReturnValue) == 0x000328, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateIcon::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.BindFunc
// 0x0050 (0x0050 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_BindFunc final
{
public:
	TDelegate<void(class UCommonIcon_C* Sender)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonIcon_C* Sender)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonIcon_C* Sender)>  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonIcon_C* Sender)>  K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonIcon_C* Sender)>  K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_BindFunc) == 0x000004, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_BindFunc");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_BindFunc) == 0x000050, "Wrong size on Fang_expedition_ExpeditionMountData_C_BindFunc");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_BindFunc, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_BindFunc::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_BindFunc, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'Fang_expedition_ExpeditionMountData_C_BindFunc::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_BindFunc, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'Fang_expedition_ExpeditionMountData_C_BindFunc::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_BindFunc, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'Fang_expedition_ExpeditionMountData_C_BindFunc::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_BindFunc, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'Fang_expedition_ExpeditionMountData_C_BindFunc::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.RemoveIndex
// 0x0010 (0x0010 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_RemoveIndex final
{
public:
	class FString                                 TargetUniqueID;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_RemoveIndex) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_RemoveIndex");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_RemoveIndex) == 0x000010, "Wrong size on Fang_expedition_ExpeditionMountData_C_RemoveIndex");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_RemoveIndex, TargetUniqueID) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_RemoveIndex::TargetUniqueID' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.SetExpectedValue
// 0x0078 (0x0078 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_SetExpectedValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopValue;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFang_expedition_ExpeditionHeartAnm_C*> IconList;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1A[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFang_expedition_ExpeditionHeartAnm_C*  CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFang_expedition_ExpeditionHeartAnm_C*> K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTFang_expeditionHeartData            CallFunc_GetDataTableRowFromName_OutRow;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1B[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFang_expedition_ExpeditionHeartAnm_C*  CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1C[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_SetExpectedValue");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue) == 0x000078, "Wrong size on Fang_expedition_ExpeditionMountData_C_SetExpectedValue");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, Value) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::Value' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, LoopValue) == 0x000004, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::LoopValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, IconList) == 0x000008, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::IconList' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, Temp_int_Variable) == 0x000018, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Array_Get_Item) == 0x000028, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, K2Node_MakeArray_Array) == 0x000030, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Conv_IntToString_ReturnValue) == 0x000040, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Conv_StringToName_ReturnValue) == 0x000050, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, Temp_int_Variable_1) == 0x000058, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_GetDataTableRowFromName_OutRow) == 0x00005C, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000070, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetExpectedValue, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'Fang_expedition_ExpeditionMountData_C_SetExpectedValue::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.SetUniqueIds
// 0x0010 (0x0010 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_SetUniqueIds final
{
public:
	TArray<class FString>                         UniqueIds;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_SetUniqueIds) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_SetUniqueIds");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_SetUniqueIds) == 0x000010, "Wrong size on Fang_expedition_ExpeditionMountData_C_SetUniqueIds");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetUniqueIds, UniqueIds) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_SetUniqueIds::UniqueIds' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.SetMaxIconNum
// 0x0088 (0x0088 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_SetMaxIconNum final
{
public:
	int32                                         IconCount;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCommonIcon_C*>                  WorkIcon;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UImage*>                         WorkBG;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1E[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIcon_C*                          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_2;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1F[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item_3;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E20[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UCommonIcon_C*>                  K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_SetMaxIconNum");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum) == 0x000088, "Wrong size on Fang_expedition_ExpeditionMountData_C_SetMaxIconNum");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, IconCount) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::IconCount' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, WorkIcon) == 0x000008, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::WorkIcon' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, WorkBG) == 0x000018, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::WorkBG' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, Temp_int_Variable) == 0x000028, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, Temp_int_Variable_1) == 0x000030, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Array_Get_Item) == 0x000038, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Array_Get_Item_2) == 0x000048, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Array_Get_Item_3) == 0x000058, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000064, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, K2Node_MakeArray_Array) == 0x000068, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetMaxIconNum, K2Node_MakeArray_Array_1) == 0x000078, "Member 'Fang_expedition_ExpeditionMountData_C_SetMaxIconNum::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.SetPlusCount
// 0x0008 (0x0008 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_SetPlusCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateSkip;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_SetPlusCount) == 0x000004, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_SetPlusCount");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_SetPlusCount) == 0x000008, "Wrong size on Fang_expedition_ExpeditionMountData_C_SetPlusCount");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetPlusCount, Count) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_SetPlusCount::Count' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_SetPlusCount, UpdateSkip) == 0x000004, "Member 'Fang_expedition_ExpeditionMountData_C_SetPlusCount::UpdateSkip' has a wrong offset!");

// Function Fang_expedition_ExpeditionMountData.Fang_expedition_ExpeditionMountData_C.UpdateLotteryCountText
// 0x0178 (0x0178 - 0x0000)
struct Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText final
{
public:
	class USBMasterDataManager*                   MasterManager;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LotteryCount;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopEnd;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E21[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E22[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E23[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_FindCharacterEquipment_OutResult;         // 0x0050(0x0118)()
	bool                                          CallFunc_FindCharacterEquipment_ReturnValue;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E24[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLuckyChanceNum_ReturnValue;            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText) == 0x000008, "Wrong alignment on Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText");
static_assert(sizeof(Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText) == 0x000178, "Wrong size on Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText, MasterManager) == 0x000000, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText::MasterManager' has a wrong offset!");
static_assert(offsetof(Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText, LotteryCount) == 0x000008, "Member 'Fang_expedition_ExpeditionMountData_C_UpdateLotteryCountText::LotteryCount' has a wrong offset!");
