#pragma once

 

// Package: Fang_expedition_StatusIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function Fang_expedition_StatusIcon.Fang_expedition_StatusIcon_C.ExecuteUbergraph_Fang_expedition_StatusIcon
// 0x0020 (0x0020 - 0x0000)
struct Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA8[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon) == 0x000008, "Wrong alignment on Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon");
static_assert(sizeof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon) == 0x000020, "Wrong size on Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon");
static_assert(offsetof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon, EntryPoint) == 0x000000, "Member 'Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000005, "Member 'Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'Fang_expedition_StatusIcon_C_ExecuteUbergraph_Fang_expedition_StatusIcon::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function Fang_expedition_StatusIcon.Fang_expedition_StatusIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Fang_expedition_StatusIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fang_expedition_StatusIcon_C_PreConstruct) == 0x000001, "Wrong alignment on Fang_expedition_StatusIcon_C_PreConstruct");
static_assert(sizeof(Fang_expedition_StatusIcon_C_PreConstruct) == 0x000001, "Wrong size on Fang_expedition_StatusIcon_C_PreConstruct");
static_assert(offsetof(Fang_expedition_StatusIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Fang_expedition_StatusIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Fang_expedition_StatusIcon.Fang_expedition_StatusIcon_C.SetTypeIndex
// 0x0010 (0x0010 - 0x0000)
struct Fang_expedition_StatusIcon_C_SetTypeIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA9[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_StatusIcon_C_SetTypeIndex) == 0x000008, "Wrong alignment on Fang_expedition_StatusIcon_C_SetTypeIndex");
static_assert(sizeof(Fang_expedition_StatusIcon_C_SetTypeIndex) == 0x000010, "Wrong size on Fang_expedition_StatusIcon_C_SetTypeIndex");
static_assert(offsetof(Fang_expedition_StatusIcon_C_SetTypeIndex, Param_Index) == 0x000000, "Member 'Fang_expedition_StatusIcon_C_SetTypeIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_SetTypeIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'Fang_expedition_StatusIcon_C_SetTypeIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_StatusIcon_C_SetTypeIndex, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Fang_expedition_StatusIcon_C_SetTypeIndex::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

