#pragma once

 

// Package: Fang_expedition_PlayListWindow

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.OnSelectPlayListSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature) == 0x000004, "Wrong alignment on Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature) == 0x000004, "Wrong size on Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature, Param_Index) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_OnSelectPlayListSlot__DelegateSignature::Param_Index' has a wrong offset!");

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.OnPressDetailButton__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature) == 0x000004, "Wrong alignment on Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature) == 0x000004, "Wrong size on Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature, Param_Index) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_OnPressDetailButton__DelegateSignature::Param_Index' has a wrong offset!");

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.OnPressFinishButton__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature) == 0x000004, "Wrong alignment on Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature) == 0x000004, "Wrong size on Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature, Param_Index) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_OnPressFinishButton__DelegateSignature::Param_Index' has a wrong offset!");

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.ExecuteUbergraph_Fang_expedition_PlayListWindow
// 0x002C (0x002C - 0x0000)
struct Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_Index_1;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow) == 0x000004, "Wrong alignment on Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow) == 0x00002C, "Wrong size on Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow, EntryPoint) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow, K2Node_CustomEvent_Index_1) == 0x000014, "Member 'Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow::K2Node_CustomEvent_Index_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow, K2Node_CustomEvent_Index) == 0x000018, "Member 'Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'Fang_expedition_PlayListWindow_C_ExecuteUbergraph_Fang_expedition_PlayListWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.CB_OnPressFinishButton
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton) == 0x000004, "Wrong alignment on Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton) == 0x000004, "Wrong size on Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton, Param_Index) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_CB_OnPressFinishButton::Param_Index' has a wrong offset!");

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.CB_OnPressDetailButton
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton) == 0x000004, "Wrong alignment on Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton) == 0x000004, "Wrong size on Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton, Param_Index) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_CB_OnPressDetailButton::Param_Index' has a wrong offset!");

// Function Fang_expedition_PlayListWindow.Fang_expedition_PlayListWindow_C.SetData
// 0x00B8 (0x00B8 - 0x0000)
struct Fang_expedition_PlayListWindow_C_SetData final
{
public:
	struct FSBFang_expeditionData                 ExpeditionData;                                    // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          BlankText;                                         // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF0[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFang_expedition_PlayListItem_C*        WorkWidget;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopEnd;                                           // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF1[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FF2[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFang_expedition_PlayListItem_C*        K2Node_DynamicCast_AsFang_Expedition_Play_List_Item; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF3[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFang_expedition_PlayListItem_C*        K2Node_DynamicCast_AsFang_Expedition_Play_List_Item_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF4[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFang_expedition_PlayListItem_C*        K2Node_DynamicCast_AsFang_Expedition_Play_List_Item_2; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FF5[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Fang_expedition_PlayListWindow_C_SetData) == 0x000008, "Wrong alignment on Fang_expedition_PlayListWindow_C_SetData");
static_assert(sizeof(Fang_expedition_PlayListWindow_C_SetData) == 0x0000B8, "Wrong size on Fang_expedition_PlayListWindow_C_SetData");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, ExpeditionData) == 0x000000, "Member 'Fang_expedition_PlayListWindow_C_SetData::ExpeditionData' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, BlankText) == 0x000038, "Member 'Fang_expedition_PlayListWindow_C_SetData::BlankText' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, WorkWidget) == 0x000040, "Member 'Fang_expedition_PlayListWindow_C_SetData::WorkWidget' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, LoopEnd) == 0x000048, "Member 'Fang_expedition_PlayListWindow_C_SetData::LoopEnd' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, Temp_int_Variable) == 0x00004C, "Member 'Fang_expedition_PlayListWindow_C_SetData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, Temp_int_Variable_1) == 0x000054, "Member 'Fang_expedition_PlayListWindow_C_SetData::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_GetChildAt_ReturnValue) == 0x000060, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_Add_IntInt_ReturnValue_2) == 0x000068, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, K2Node_DynamicCast_AsFang_Expedition_Play_List_Item) == 0x000070, "Member 'Fang_expedition_PlayListWindow_C_SetData::K2Node_DynamicCast_AsFang_Expedition_Play_List_Item' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'Fang_expedition_PlayListWindow_C_SetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, Temp_int_Variable_2) == 0x00007C, "Member 'Fang_expedition_PlayListWindow_C_SetData::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_GetChildAt_ReturnValue_1) == 0x000080, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, K2Node_DynamicCast_AsFang_Expedition_Play_List_Item_1) == 0x000088, "Member 'Fang_expedition_PlayListWindow_C_SetData::K2Node_DynamicCast_AsFang_Expedition_Play_List_Item_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'Fang_expedition_PlayListWindow_C_SetData::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000091, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_Add_IntInt_ReturnValue_3) == 0x000094, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_GetChildAt_ReturnValue_2) == 0x000098, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, K2Node_DynamicCast_AsFang_Expedition_Play_List_Item_2) == 0x0000A0, "Member 'Fang_expedition_PlayListWindow_C_SetData::K2Node_DynamicCast_AsFang_Expedition_Play_List_Item_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'Fang_expedition_PlayListWindow_C_SetData::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_Array_LastIndex_ReturnValue) == 0x0000AC, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B0, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Fang_expedition_PlayListWindow_C_SetData, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0000B4, "Member 'Fang_expedition_PlayListWindow_C_SetData::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

}

