#pragma once

 

// Package: Fang_expedition_DetailItemListPagePoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function Fang_expedition_DetailItemListPagePoint.Fang_expedition_DetailItemListPagePoint_C.OnButtonClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature) == 0x000004, "Wrong alignment on Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature");
static_assert(sizeof(Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature) == 0x000004, "Wrong size on Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature, Param_Index) == 0x000000, "Member 'Fang_expedition_DetailItemListPagePoint_C_OnButtonClicked__DelegateSignature::Param_Index' has a wrong offset!");

// Function Fang_expedition_DetailItemListPagePoint.Fang_expedition_DetailItemListPagePoint_C.ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint
// 0x0004 (0x0004 - 0x0000)
struct Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint) == 0x000004, "Wrong alignment on Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint");
static_assert(sizeof(Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint) == 0x000004, "Wrong size on Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint, EntryPoint) == 0x000000, "Member 'Fang_expedition_DetailItemListPagePoint_C_ExecuteUbergraph_Fang_expedition_DetailItemListPagePoint::EntryPoint' has a wrong offset!");

// Function Fang_expedition_DetailItemListPagePoint.Fang_expedition_DetailItemListPagePoint_C.SetActive
// 0x0010 (0x0010 - 0x0000)
struct Fang_expedition_DetailItemListPagePoint_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D37[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Fang_expedition_DetailItemListPagePoint_C_SetActive) == 0x000004, "Wrong alignment on Fang_expedition_DetailItemListPagePoint_C_SetActive");
static_assert(sizeof(Fang_expedition_DetailItemListPagePoint_C_SetActive) == 0x000010, "Wrong size on Fang_expedition_DetailItemListPagePoint_C_SetActive");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_SetActive, IsActive) == 0x000000, "Member 'Fang_expedition_DetailItemListPagePoint_C_SetActive::IsActive' has a wrong offset!");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_SetActive, Temp_bool_Variable) == 0x000001, "Member 'Fang_expedition_DetailItemListPagePoint_C_SetActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_SetActive, Temp_int_Variable) == 0x000004, "Member 'Fang_expedition_DetailItemListPagePoint_C_SetActive::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_SetActive, Temp_int_Variable_1) == 0x000008, "Member 'Fang_expedition_DetailItemListPagePoint_C_SetActive::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Fang_expedition_DetailItemListPagePoint_C_SetActive, K2Node_Select_Default) == 0x00000C, "Member 'Fang_expedition_DetailItemListPagePoint_C_SetActive::K2Node_Select_Default' has a wrong offset!");

}

