#pragma once

 

// Package: FLIB_UIMasterDataManager

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindItemBoxMaster
// 0x0090 (0x0090 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindItemBoxMaster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_734F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterItemBox                       ItemBoxMaster;                                     // 0x0018(0x0020)(Parm, OutParm)
	struct FSBMasterItemBox                       Temp;                                              // 0x0038(0x0020)(Edit, BlueprintVisible)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7350[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7351[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterItemBox                       CallFunc_GetItemBoxMasterData_ReturnValue;         // 0x0070(0x0020)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindItemBoxMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindItemBoxMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindItemBoxMaster) == 0x000090, "Wrong size on FLIB_UIMasterDataManager_C_FindItemBoxMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, ItemIndex) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, ItemBoxMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::ItemBoxMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, Temp) == 0x000038, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::Temp' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000058, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000060, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000068, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemBoxMaster, CallFunc_GetItemBoxMasterData_ReturnValue) == 0x000070, "Member 'FLIB_UIMasterDataManager_C_FindItemBoxMaster::CallFunc_GetItemBoxMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindItemMaster
// 0x01D0 (0x01D0 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindItemMaster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7352[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7353[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        ItemMaster;                                        // 0x0018(0x00D0)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7354[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemMasterData_IsExists;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7355[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        CallFunc_GetItemMasterData_ReturnValue;            // 0x0100(0x00D0)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindItemMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindItemMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindItemMaster) == 0x0001D0, "Wrong size on FLIB_UIMasterDataManager_C_FindItemMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, ItemIndex) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, ItemMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::ItemMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, CallFunc_GetMasterDataManager_IsValid) == 0x0000E8, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000F0, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, CallFunc_GetItemMasterData_IsExists) == 0x0000F8, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::CallFunc_GetItemMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindItemMaster, CallFunc_GetItemMasterData_ReturnValue) == 0x000100, "Member 'FLIB_UIMasterDataManager_C_FindItemMaster::CallFunc_GetItemMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindCostumeMaster
// 0x0140 (0x0140 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindCostumeMaster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7356[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7357[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CostumeMaster;                                     // 0x0018(0x0088)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7358[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7359[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x00B8(0x0088)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindCostumeMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindCostumeMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindCostumeMaster) == 0x000140, "Wrong size on FLIB_UIMasterDataManager_C_FindCostumeMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, ItemIndex) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, CostumeMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::CostumeMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, CallFunc_GetMasterDataManager_IsValid) == 0x0000A0, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000A8, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, CallFunc_BP_FindCostumeMaster_IsExist) == 0x0000B0, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::CallFunc_BP_FindCostumeMaster_IsExist' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCostumeMaster, CallFunc_BP_FindCostumeMaster_ReturnValue) == 0x0000B8, "Member 'FLIB_UIMasterDataManager_C_FindCostumeMaster::CallFunc_BP_FindCostumeMaster_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindWeaponMaster
// 0x0190 (0x0190 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindWeaponMaster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_735A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    WeaponMaster;                                      // 0x0018(0x00B0)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735C[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponMasterData_IsExists;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735D[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_GetWeaponMasterData_ReturnValue;          // 0x00E0(0x00B0)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindWeaponMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindWeaponMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindWeaponMaster) == 0x000190, "Wrong size on FLIB_UIMasterDataManager_C_FindWeaponMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, ItemIndex) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, WeaponMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::WeaponMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, CallFunc_GetMasterDataManager_IsValid) == 0x0000C8, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000D0, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, CallFunc_GetWeaponMasterData_IsExists) == 0x0000D8, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::CallFunc_GetWeaponMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindWeaponMaster, CallFunc_GetWeaponMasterData_ReturnValue) == 0x0000E0, "Member 'FLIB_UIMasterDataManager_C_FindWeaponMaster::CallFunc_GetWeaponMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindImagineMaster
// 0x0280 (0x0280 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindImagineMaster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_735E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735F[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       ImagineMaster;                                     // 0x0018(0x00B0)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7360[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindMasterImagineRecepi_InExists;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7361[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterImagineRecepi                   CallFunc_FindMasterImagineRecepi_ReturnValue;      // 0x00E0(0x0038)()
	bool                                          CallFunc_FindMasterImagineData_IsExists;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7362[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindMasterImagineData_ReturnValue;        // 0x0120(0x00B0)()
	struct FSBMasterImagine                       CallFunc_FindMasterImagine_ReturnValue;            // 0x01D0(0x00B0)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindImagineMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindImagineMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindImagineMaster) == 0x000280, "Wrong size on FLIB_UIMasterDataManager_C_FindImagineMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, ItemIndex) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, ImagineMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::ImagineMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_GetMasterDataManager_IsValid) == 0x0000C8, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000D0, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_FindMasterImagineRecepi_InExists) == 0x0000D8, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_FindMasterImagineRecepi_InExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_FindMasterImagineRecepi_ReturnValue) == 0x0000E0, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_FindMasterImagineRecepi_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_FindMasterImagineData_IsExists) == 0x000118, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_FindMasterImagineData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_FindMasterImagineData_ReturnValue) == 0x000120, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_FindMasterImagineData_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMaster, CallFunc_FindMasterImagine_ReturnValue) == 0x0001D0, "Member 'FLIB_UIMasterDataManager_C_FindImagineMaster::CallFunc_FindMasterImagine_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindImagineMasterByRewardData
// 0x01C8 (0x01C8 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData final
{
public:
	ESBRewardItemType                             RewardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7363[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7364[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       ImagineMaster;                                     // 0x0018(0x00B0)(Parm, OutParm)
	int32                                         ImagineId;                                         // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindImagineRecipeByMaterialItem_bIsValid; // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7365[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterImagineRecepi                   CallFunc_FindImagineRecipeByMaterialItem_ImagineRecipeMaster; // 0x00D0(0x0038)()
	bool                                          CallFunc_FindImagineMaster_bIsValid;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7366[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindImagineMaster_ImagineMaster;          // 0x0110(0x00B0)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData) == 0x0001C8, "Wrong size on FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, RewardType) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::RewardType' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, ItemIndex) == 0x000004, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, ImagineMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::ImagineMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, ImagineId) == 0x0000C8, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::ImagineId' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, CallFunc_FindImagineRecipeByMaterialItem_bIsValid) == 0x0000CC, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::CallFunc_FindImagineRecipeByMaterialItem_bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, CallFunc_FindImagineRecipeByMaterialItem_ImagineRecipeMaster) == 0x0000D0, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::CallFunc_FindImagineRecipeByMaterialItem_ImagineRecipeMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, CallFunc_FindImagineMaster_bIsValid) == 0x000108, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::CallFunc_FindImagineMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, CallFunc_FindImagineMaster_ImagineMaster) == 0x000110, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::CallFunc_FindImagineMaster_ImagineMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001C0, "Member 'FLIB_UIMasterDataManager_C_FindImagineMasterByRewardData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindMountImagineMaster
// 0x0110 (0x0110 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindMountImagineMaster final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7367[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7368[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterMountImagine                  MountImagineMaster;                                // 0x0018(0x0070)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7369[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindMasterMountImagineData_bOutExist;  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_736A[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterMountImagine                  CallFunc_BP_FindMasterMountImagineData_ReturnValue; // 0x00A0(0x0070)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindMountImagineMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindMountImagineMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindMountImagineMaster) == 0x000110, "Wrong size on FLIB_UIMasterDataManager_C_FindMountImagineMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, ItemIndex) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::ItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, MountImagineMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::MountImagineMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000088, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000090, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, CallFunc_BP_FindMasterMountImagineData_bOutExist) == 0x000098, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::CallFunc_BP_FindMasterMountImagineData_bOutExist' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindMountImagineMaster, CallFunc_BP_FindMasterMountImagineData_ReturnValue) == 0x0000A0, "Member 'FLIB_UIMasterDataManager_C_FindMountImagineMaster::CallFunc_BP_FindMasterMountImagineData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindCraftMaster
// 0x0140 (0x0140 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindCraftMaster final
{
public:
	int32                                         RecepiId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_736B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_736C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CraftMaster;                                       // 0x0018(0x0088)(ConstParm, Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_736D[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindCraftMasterData_isExists;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_736E[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CallFunc_FindCraftMasterData_ReturnValue;          // 0x00B8(0x0088)(ConstParm)
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindCraftMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindCraftMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindCraftMaster) == 0x000140, "Wrong size on FLIB_UIMasterDataManager_C_FindCraftMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, RecepiId) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::RecepiId' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, CraftMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::CraftMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, CallFunc_GetMasterDataManager_IsValid) == 0x0000A0, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000A8, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, CallFunc_FindCraftMasterData_isExists) == 0x0000B0, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::CallFunc_FindCraftMasterData_isExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindCraftMaster, CallFunc_FindCraftMasterData_ReturnValue) == 0x0000B8, "Member 'FLIB_UIMasterDataManager_C_FindCraftMaster::CallFunc_FindCraftMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindTokenMaster
// 0x00E0 (0x00E0 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindTokenMaster final
{
public:
	int32                                         InTokenId;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_736F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7370[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterToken                           TokenMaster;                                       // 0x0018(0x0058)(ConstParm, Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7371[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindMasterToken_bIsValid;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7372[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterToken                           CallFunc_BP_FindMasterToken_ReturnValue;           // 0x0088(0x0058)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindTokenMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindTokenMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindTokenMaster) == 0x0000E0, "Wrong size on FLIB_UIMasterDataManager_C_FindTokenMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, InTokenId) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::InTokenId' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, TokenMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::TokenMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000070, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000078, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, CallFunc_BP_FindMasterToken_bIsValid) == 0x000080, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::CallFunc_BP_FindMasterToken_bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindTokenMaster, CallFunc_BP_FindMasterToken_ReturnValue) == 0x000088, "Member 'FLIB_UIMasterDataManager_C_FindTokenMaster::CallFunc_BP_FindMasterToken_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindAchievementMaster
// 0x0120 (0x0120 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindAchievementMaster final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7373[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7374[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAchievementMasterData                 AchievementMaster;                                 // 0x0018(0x0078)(ConstParm, Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7375[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAchievementMasterData_IsExists;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7376[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAchievementMasterData                 CallFunc_GetAchievementMasterData_ReturnValue;     // 0x00A8(0x0078)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindAchievementMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindAchievementMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindAchievementMaster) == 0x000120, "Wrong size on FLIB_UIMasterDataManager_C_FindAchievementMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, Param_Index) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::Param_Index' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, AchievementMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::AchievementMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000090, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000098, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, CallFunc_GetAchievementMasterData_IsExists) == 0x0000A0, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::CallFunc_GetAchievementMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindAchievementMaster, CallFunc_GetAchievementMasterData_ReturnValue) == 0x0000A8, "Member 'FLIB_UIMasterDataManager_C_FindAchievementMaster::CallFunc_GetAchievementMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindOrnamentMaster
// 0x00F0 (0x00F0 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindOrnamentMaster final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7377[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7378[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterOrnament                      ReturnValue;                                       // 0x0018(0x0060)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7379[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindMasterOrnamentDataBP_bExists;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_737A[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterOrnament                      CallFunc_FindMasterOrnamentDataBP_ReturnValue;     // 0x0090(0x0060)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindOrnamentMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindOrnamentMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindOrnamentMaster) == 0x0000F0, "Wrong size on FLIB_UIMasterDataManager_C_FindOrnamentMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, ID) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::ID' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, Valid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::Valid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, ReturnValue) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000078, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000080, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, CallFunc_FindMasterOrnamentDataBP_bExists) == 0x000088, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::CallFunc_FindMasterOrnamentDataBP_bExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindOrnamentMaster, CallFunc_FindMasterOrnamentDataBP_ReturnValue) == 0x000090, "Member 'FLIB_UIMasterDataManager_C_FindOrnamentMaster::CallFunc_FindMasterOrnamentDataBP_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindEmoteMaster
// 0x0080 (0x0080 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindEmoteMaster final
{
public:
	int32                                         EmoteId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_737B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_737C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEmoteMasterData                     EmoteMaster;                                       // 0x0018(0x0028)(ConstParm, Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_737D[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindEmoteData_IsExists;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_737E[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEmoteMasterData                     CallFunc_FindEmoteData_ReturnValue;                // 0x0058(0x0028)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindEmoteMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindEmoteMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindEmoteMaster) == 0x000080, "Wrong size on FLIB_UIMasterDataManager_C_FindEmoteMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, EmoteId) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::EmoteId' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, EmoteMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::EmoteMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000040, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000048, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, CallFunc_FindEmoteData_IsExists) == 0x000050, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::CallFunc_FindEmoteData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindEmoteMaster, CallFunc_FindEmoteData_ReturnValue) == 0x000058, "Member 'FLIB_UIMasterDataManager_C_FindEmoteMaster::CallFunc_FindEmoteData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindStampCategoryMaster
// 0x0070 (0x0070 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindStampCategoryMaster final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_737F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7380[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStampCategoryMasterData             StampCategoryMaster;                               // 0x0018(0x0020)(ConstParm, Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7381[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindStampMasterData_IsExists;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7382[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStampCategoryMasterData             CallFunc_FindStampMasterData_ReturnValue;          // 0x0050(0x0020)()
};
static_assert(alignof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster) == 0x000008, "Wrong alignment on FLIB_UIMasterDataManager_C_FindStampCategoryMaster");
static_assert(sizeof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster) == 0x000070, "Wrong size on FLIB_UIMasterDataManager_C_FindStampCategoryMaster");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, CategoryId) == 0x000000, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::CategoryId' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, __WorldContext) == 0x000008, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, bIsValid) == 0x000010, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, StampCategoryMaster) == 0x000018, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::StampCategoryMaster' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, CallFunc_GetMasterDataManager_IsValid) == 0x000038, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, CallFunc_GetMasterDataManager_ReturnValue) == 0x000040, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, CallFunc_FindStampMasterData_IsExists) == 0x000048, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::CallFunc_FindStampMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_UIMasterDataManager_C_FindStampCategoryMaster, CallFunc_FindStampMasterData_ReturnValue) == 0x000050, "Member 'FLIB_UIMasterDataManager_C_FindStampCategoryMaster::CallFunc_FindStampMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_UIMasterDataManager.FLIB_UIMasterDataManager_C.FindStampCategoryMasterByStampId
// 0x0070 (0x0070 - 0x0000)
struct FLIB_UIMasterDataManager_C_FindStampCategoryMasterByStampId final
{
public:
	int32                                         StampId;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7383[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7384[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStampCategoryMasterData             StampCategoryMaster;                               // 0x0018(0x0020)(ConstParm, Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
