#pragma once

 

// Package: FLIB_UiCostume

#include "Basic.hpp"

#include "CharaParts_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function FLIB_UiCostume.FLIB_UiCostume_C.CheckCostumePartsIsCompositeWear
// 0x00F8 (0x00F8 - 0x0000)
struct FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear final
{
public:
	class FString                                 InCostumePartsName;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	EProtectorCategory                            InCostumePartsCategory;                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            InCharacterGender;                                 // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9951[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsCompositeWear;                                // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9952[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   OutOccupiedPartsLocations;                         // 0x0028(0x0010)(Parm, OutParm)
	ECharaPartsLocation                           TmpSubLocation;                                    // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9953[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   TmpOccupiedPartsLocations;                         // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<ECharaPartsLocation>                   TmpCheckedSubLocationArray;                        // 0x0050(0x0010)(Edit, BlueprintVisible)
	EProtectorCategory                            TmpCostumeProtectorCategory;                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TmpIsCompositeWear;                                // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharaPartsBody                               Temp_byte_Variable;                                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9954[0x1];                                     // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProtectorCategory                            Temp_byte_Variable_1;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_2;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_3;                              // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_4;                              // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_5;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_6;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_7;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_8;                              // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_9;                              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_10;                             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_11;                             // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_12;                             // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_13;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_14;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_15;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           Temp_byte_Variable_16;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsBody                               Temp_byte_Variable_17;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharaPartsLocation                           K2Node_Select_Default;                             // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharaPartsBody                               Temp_byte_Variable_18;                             // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterGender                            Temp_byte_Variable_19;                             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharaPartsBody                               K2Node_Select_Default_1;                           // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9955[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaPartsData*                        CallFunc_GetPartsData_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9956[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   CallFunc_GetCheckedSubLocationArray_CharaPartsLocationArray; // 0x00A8(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9957[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECharaPartsLocation                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9958[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9959[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGameSingleton_IsValid;                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995A[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBGameSingleton*                       CallFunc_GetGameSingleton_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBCharaPartsManager*                   CallFunc_GetCharaPartsManager_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear) == 0x000008, "Wrong alignment on FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear");
static_assert(sizeof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear) == 0x0000F8, "Wrong size on FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, InCostumePartsName) == 0x000000, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::InCostumePartsName' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, InCostumePartsCategory) == 0x000010, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::InCostumePartsCategory' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, InCharacterGender) == 0x000011, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::InCharacterGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, __WorldContext) == 0x000018, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, OutIsCompositeWear) == 0x000020, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::OutIsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, OutOccupiedPartsLocations) == 0x000028, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::OutOccupiedPartsLocations' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, TmpSubLocation) == 0x000038, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::TmpSubLocation' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, TmpOccupiedPartsLocations) == 0x000040, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::TmpOccupiedPartsLocations' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, TmpCheckedSubLocationArray) == 0x000050, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::TmpCheckedSubLocationArray' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, TmpCostumeProtectorCategory) == 0x000060, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::TmpCostumeProtectorCategory' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, TmpIsCompositeWear) == 0x000061, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::TmpIsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable) == 0x000062, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Conv_StringToName_ReturnValue) == 0x000064, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_1) == 0x00006C, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_2) == 0x00006D, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_3) == 0x00006E, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_4) == 0x00006F, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_5) == 0x000070, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_6) == 0x000071, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_7) == 0x000072, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_8) == 0x000073, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_9) == 0x000074, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_10) == 0x000075, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_11) == 0x000076, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_12) == 0x000077, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_13) == 0x000078, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_14) == 0x000079, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_15) == 0x00007A, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_16) == 0x00007B, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_int_Array_Index_Variable) == 0x000084, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_17) == 0x000088, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000089, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, K2Node_Select_Default) == 0x00008A, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00008B, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00008C, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00008D, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00008E, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_18) == 0x00008F, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue) == 0x000090, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_1) == 0x000091, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, Temp_byte_Variable_19) == 0x000092, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_2) == 0x000093, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_3) == 0x000094, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, K2Node_Select_Default_1) == 0x000095, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_GetPartsData_ReturnValue) == 0x000098, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_GetPartsData_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_GetCheckedSubLocationArray_CharaPartsLocationArray) == 0x0000A8, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_GetCheckedSubLocationArray_CharaPartsLocationArray' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0000B8, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0000C0, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0000C1, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x0000C2, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x0000C3, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_4) == 0x0000C4, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_5) == 0x0000C5, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_6) == 0x0000C6, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_BooleanOR_ReturnValue_7) == 0x0000C7, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Array_Length_ReturnValue_1) == 0x0000D4, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_GetGameSingleton_IsValid) == 0x0000D9, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_GetGameSingleton_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_GetGameSingleton_ReturnValue) == 0x0000E0, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_GetGameSingleton_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_GetCharaPartsManager_ReturnValue) == 0x0000E8, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_GetCharaPartsManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'FLIB_UiCostume_C_CheckCostumePartsIsCompositeWear::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function FLIB_UiCostume.FLIB_UiCostume_C.IsCompositeWearByMasterCostume
// 0x00D0 (0x00D0 - 0x0000)
struct FLIB_UiCostume_C_IsCompositeWearByMasterCostume final
{
public:
	struct FSBMasterCostume                       MasterCostume;                                     // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESBCharacterGender                            InCharacterGender;                                 // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCostumeGender;                                 // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995B[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsCompositeWear;                                // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995C[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   OutOccupiedPartsLocations;                         // 0x00A0(0x0010)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEquipableGender                              Temp_byte_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable_1;                              // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable_2;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable_3;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            Temp_byte_Variable_4;                              // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            K2Node_Select_Default;                             // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            K2Node_Select_Default_1;                           // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCostumePartsIsCompositeWear_OutIsCompositeWear; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995D[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   CallFunc_CheckCostumePartsIsCompositeWear_OutOccupiedPartsLocations; // 0x00C0(0x0010)(ReferenceParm)
};
static_assert(alignof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume) == 0x000008, "Wrong alignment on FLIB_UiCostume_C_IsCompositeWearByMasterCostume");
static_assert(sizeof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume) == 0x0000D0, "Wrong size on FLIB_UiCostume_C_IsCompositeWearByMasterCostume");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, MasterCostume) == 0x000000, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::MasterCostume' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, InCharacterGender) == 0x000088, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::InCharacterGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, bUseCostumeGender) == 0x000089, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::bUseCostumeGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, __WorldContext) == 0x000090, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, OutIsCompositeWear) == 0x000098, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::OutIsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, OutOccupiedPartsLocations) == 0x0000A0, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::OutOccupiedPartsLocations' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, Temp_bool_Variable) == 0x0000B0, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, Temp_byte_Variable) == 0x0000B1, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, Temp_byte_Variable_1) == 0x0000B2, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, Temp_byte_Variable_2) == 0x0000B3, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, Temp_byte_Variable_3) == 0x0000B4, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, Temp_byte_Variable_4) == 0x0000B5, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, K2Node_Select_Default) == 0x0000B6, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, K2Node_Select_Default_1) == 0x0000B7, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, CallFunc_CheckCostumePartsIsCompositeWear_OutIsCompositeWear) == 0x0000B8, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::CallFunc_CheckCostumePartsIsCompositeWear_OutIsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByMasterCostume, CallFunc_CheckCostumePartsIsCompositeWear_OutOccupiedPartsLocations) == 0x0000C0, "Member 'FLIB_UiCostume_C_IsCompositeWearByMasterCostume::CallFunc_CheckCostumePartsIsCompositeWear_OutOccupiedPartsLocations' has a wrong offset!");

// Function FLIB_UiCostume.FLIB_UiCostume_C.IsCompositeWearByCostumeId
// 0x01A0 (0x01A0 - 0x0000)
struct FLIB_UiCostume_C_IsCompositeWearByCostumeId final
{
public:
	int32                                         CostumeId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            InCharacterGender;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCostumeGender;                                 // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCompositeWear;                                   // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_995F[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   OccupiedPartsLocations;                            // 0x0018(0x0010)(Parm, OutParm)
	struct FSBMasterCostume                       MasterCostume;                                     // 0x0028(0x0088)(Parm, OutParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9960[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9961[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9962[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x0100(0x0088)()
	bool                                          CallFunc_IsCompositeWearByMasterCostume_OutIsCompositeWear; // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9963[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   CallFunc_IsCompositeWearByMasterCostume_OutOccupiedPartsLocations; // 0x0190(0x0010)(ReferenceParm)
};
static_assert(alignof(FLIB_UiCostume_C_IsCompositeWearByCostumeId) == 0x000008, "Wrong alignment on FLIB_UiCostume_C_IsCompositeWearByCostumeId");
static_assert(sizeof(FLIB_UiCostume_C_IsCompositeWearByCostumeId) == 0x0001A0, "Wrong size on FLIB_UiCostume_C_IsCompositeWearByCostumeId");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CostumeId) == 0x000000, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CostumeId' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, InCharacterGender) == 0x000004, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::InCharacterGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, bUseCostumeGender) == 0x000005, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::bUseCostumeGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, __WorldContext) == 0x000008, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, bIsValid) == 0x000010, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, IsCompositeWear) == 0x000011, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::IsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, OccupiedPartsLocations) == 0x000018, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::OccupiedPartsLocations' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, MasterCostume) == 0x000028, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::MasterCostume' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, K2Node_MakeArray_Array) == 0x0000B0, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_IsEmpty_ReturnValue) == 0x0000C8, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000D0, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_GetDisplayName_ReturnValue) == 0x0000D8, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_GetMasterDataManager_IsValid) == 0x0000E8, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000F0, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_BP_FindCostumeMaster_IsExist) == 0x0000F8, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_BP_FindCostumeMaster_IsExist' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_BP_FindCostumeMaster_ReturnValue) == 0x000100, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_BP_FindCostumeMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_IsCompositeWearByMasterCostume_OutIsCompositeWear) == 0x000188, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_IsCompositeWearByMasterCostume_OutIsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_IsCompositeWearByCostumeId, CallFunc_IsCompositeWearByMasterCostume_OutOccupiedPartsLocations) == 0x000190, "Member 'FLIB_UiCostume_C_IsCompositeWearByCostumeId::CallFunc_IsCompositeWearByMasterCostume_OutOccupiedPartsLocations' has a wrong offset!");

// Function FLIB_UiCostume.FLIB_UiCostume_C.GetOccupiedLocation
// 0x00F0 (0x00F0 - 0x0000)
struct FLIB_UiCostume_C_GetOccupiedLocation final
{
public:
	struct FSBMasterCostume                       MasterCostume;                                     // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ESBCharacterGender                            InCharacterGender;                                 // 0x0088(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCostumeGender;                                 // 0x0089(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9964[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EProtectorCategory>                    Result;                                            // 0x0098(0x0010)(Parm, OutParm)
	TArray<EProtectorCategory>                    Ret;                                               // 0x00A8(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsCompositeWearByMasterCostume_OutIsCompositeWear; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9965[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   CallFunc_IsCompositeWearByMasterCostume_OutOccupiedPartsLocations; // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharaPartsLocation                           CallFunc_Array_Get_Item;                           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EProtectorCategory                            CallFunc_CharaPartsLocationToProtectorCategory_ProtectorCategory; // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9966[0x1];                                     // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FLIB_UiCostume_C_GetOccupiedLocation) == 0x000008, "Wrong alignment on FLIB_UiCostume_C_GetOccupiedLocation");
static_assert(sizeof(FLIB_UiCostume_C_GetOccupiedLocation) == 0x0000F0, "Wrong size on FLIB_UiCostume_C_GetOccupiedLocation");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, MasterCostume) == 0x000000, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::MasterCostume' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, InCharacterGender) == 0x000088, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::InCharacterGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, bUseCostumeGender) == 0x000089, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::bUseCostumeGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, __WorldContext) == 0x000090, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, Result) == 0x000098, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::Result' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, Ret) == 0x0000A8, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::Ret' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_IsCompositeWearByMasterCostume_OutIsCompositeWear) == 0x0000B8, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_IsCompositeWearByMasterCostume_OutIsCompositeWear' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_IsCompositeWearByMasterCostume_OutOccupiedPartsLocations) == 0x0000C0, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_IsCompositeWearByMasterCostume_OutOccupiedPartsLocations' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, Temp_int_Array_Index_Variable) == 0x0000D4, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_Array_Get_Item) == 0x0000DC, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_CharaPartsLocationToProtectorCategory_ProtectorCategory) == 0x0000DD, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_CharaPartsLocationToProtectorCategory_ProtectorCategory' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_Less_IntInt_ReturnValue) == 0x0000DE, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_Add_IntInt_ReturnValue) == 0x0000E0, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_Array_Add_ReturnValue) == 0x0000E4, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocation, CallFunc_Array_Add_ReturnValue_1) == 0x0000E8, "Member 'FLIB_UiCostume_C_GetOccupiedLocation::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function FLIB_UiCostume.FLIB_UiCostume_C.GetOccupiedLocationByCostumeId
// 0x0230 (0x0230 - 0x0000)
struct FLIB_UiCostume_C_GetOccupiedLocationByCostumeId final
{
public:
	int32                                         CostumeId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterGender                            InCharacterGender;                                 // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseCostumeGender;                                 // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9967[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9968[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EProtectorCategory>                    Result;                                            // 0x0018(0x0010)(Parm, OutParm)
	struct FSBMasterCostume                       MasterCostume;                                     // 0x0028(0x0088)(Parm, OutParm)
	struct FSBMasterCostume                       Work;                                              // 0x00B0(0x0088)(Edit, BlueprintVisible)
	TArray<EProtectorCategory>                    Ret;                                               // 0x0138(0x0010)(Edit, BlueprintVisible)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9969[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<EProtectorCategory>                    CallFunc_GetOccupiedLocation_Result;               // 0x0180(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_996A[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_996B[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x01A8(0x0088)()
};
static_assert(alignof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId) == 0x000008, "Wrong alignment on FLIB_UiCostume_C_GetOccupiedLocationByCostumeId");
static_assert(sizeof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId) == 0x000230, "Wrong size on FLIB_UiCostume_C_GetOccupiedLocationByCostumeId");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, CostumeId) == 0x000000, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::CostumeId' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, InCharacterGender) == 0x000004, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::InCharacterGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, bUseCostumeGender) == 0x000005, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::bUseCostumeGender' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, __WorldContext) == 0x000008, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, bIsValid) == 0x000010, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::bIsValid' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, Result) == 0x000018, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::Result' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, MasterCostume) == 0x000028, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::MasterCostume' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, Work) == 0x0000B0, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::Work' has a wrong offset!");
static_assert(offsetof(FLIB_UiCostume_C_GetOccupiedLocationByCostumeId, Ret) == 0x000138, "Member 'FLIB_UiCostume_C_GetOccupiedLocationByCostumeId::Ret' has a wrong offset!");
