#pragma once

 

// Package: FLIB_CommonIcon

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.RewardItemTypeToItemType
// 0x0038 (0x0038 - 0x0000)
struct FLIB_CommonIcon_C_RewardItemTypeToItemType final
{
public:
	ESBRewardItemType                             RewardItemType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43FE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     ItemType;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_4;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_5;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_6;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_7;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_8;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_9;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_10;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_11;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_12;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_13;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_14;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_15;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_16;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_17;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_18;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_19;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_20;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_21;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_22;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_23;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_24;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_25;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_26;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_27;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_28;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_29;                             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_30;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_31;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_32;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_33;                             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_34;                             // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_35;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_36;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     K2Node_Select_Default;                             // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FLIB_CommonIcon_C_RewardItemTypeToItemType) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_RewardItemTypeToItemType");
static_assert(sizeof(FLIB_CommonIcon_C_RewardItemTypeToItemType) == 0x000038, "Wrong size on FLIB_CommonIcon_C_RewardItemTypeToItemType");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, RewardItemType) == 0x000000, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::RewardItemType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, __WorldContext) == 0x000008, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, ItemType) == 0x000010, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::ItemType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable) == 0x000011, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_1) == 0x000012, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_2) == 0x000013, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_3) == 0x000014, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_4) == 0x000015, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_5) == 0x000016, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_6) == 0x000017, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_7) == 0x000018, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_8) == 0x000019, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_9) == 0x00001A, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_10) == 0x00001B, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_11) == 0x00001C, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_12) == 0x00001D, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_13) == 0x00001E, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_14) == 0x00001F, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_15) == 0x000020, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_16) == 0x000021, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_17) == 0x000022, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_18) == 0x000023, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_19) == 0x000024, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_20) == 0x000025, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_21) == 0x000026, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_22) == 0x000027, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_23) == 0x000028, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_24) == 0x000029, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_24' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_25) == 0x00002A, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_25' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_26) == 0x00002B, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_26' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_27) == 0x00002C, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_27' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_28) == 0x00002D, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_28' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_29) == 0x00002E, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_29' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_30) == 0x00002F, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_30' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_31) == 0x000030, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_31' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_32) == 0x000031, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_32' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_33) == 0x000032, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_33' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_34) == 0x000033, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_34' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_35) == 0x000034, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_35' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, Temp_byte_Variable_36) == 0x000035, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::Temp_byte_Variable_36' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_RewardItemTypeToItemType, K2Node_Select_Default) == 0x000036, "Member 'FLIB_CommonIcon_C_RewardItemTypeToItemType::K2Node_Select_Default' has a wrong offset!");

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.ItemTypeToRewardItemType
// 0x0020 (0x0020 - 0x0000)
struct FLIB_CommonIcon_C_ItemTypeToRewardItemType final
{
public:
	EItemType                                     InItemType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43FF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Out_RewardItemType;                                // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_4;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_5;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_6;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_7;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             Temp_byte_Variable_8;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FLIB_CommonIcon_C_ItemTypeToRewardItemType) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_ItemTypeToRewardItemType");
static_assert(sizeof(FLIB_CommonIcon_C_ItemTypeToRewardItemType) == 0x000020, "Wrong size on FLIB_CommonIcon_C_ItemTypeToRewardItemType");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, InItemType) == 0x000000, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::InItemType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, __WorldContext) == 0x000008, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Out_RewardItemType) == 0x000010, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Out_RewardItemType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable) == 0x000011, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_1) == 0x000012, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_2) == 0x000013, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_3) == 0x000014, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_4) == 0x000015, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_5) == 0x000016, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_6) == 0x000017, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_7) == 0x000018, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, Temp_byte_Variable_8) == 0x000019, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_ItemTypeToRewardItemType, K2Node_Select_Default) == 0x00001A, "Member 'FLIB_CommonIcon_C_ItemTypeToRewardItemType::K2Node_Select_Default' has a wrong offset!");

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.GetItemToolTipText
// 0x0408 (0x0408 - 0x0000)
struct FLIB_CommonIcon_C_GetItemToolTipText final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unidentified;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAddBrackets;                                      // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4400[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutName;                                           // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   OutType;                                           // 0x0028(0x0018)(Parm, OutParm)
	class FText                                   ItemType;                                          // 0x0040(0x0018)(Edit, BlueprintVisible)
	class FText                                   ItemName;                                          // 0x0058(0x0018)(Edit, BlueprintVisible)
	struct FItemMasterData                        MasterData;                                        // 0x0070(0x00D0)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4401[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4402[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassNameText_ReturnValue;             // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4403[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0190(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01B8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01F8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0210(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ReferenceParm)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4404[0x4];                                     // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0268(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0290(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4405[0x3];                                     // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTextTableHash                       K2Node_Select_Default;                             // 0x02AC(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4406[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemText_ReturnValue;                  // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x02C8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x02E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Add_BracketsToString_ReturnValue;         // 0x0308(0x0018)()
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4407[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemMasterData_IsExists;               // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4408[0x7];                                     // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        CallFunc_GetItemMasterData_ReturnValue;            // 0x0338(0x00D0)()
};
static_assert(alignof(FLIB_CommonIcon_C_GetItemToolTipText) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_GetItemToolTipText");
static_assert(sizeof(FLIB_CommonIcon_C_GetItemToolTipText) == 0x000408, "Wrong size on FLIB_CommonIcon_C_GetItemToolTipText");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, InItemIndex) == 0x000000, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::InItemIndex' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, Unidentified) == 0x000004, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::Unidentified' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, bAddBrackets) == 0x000005, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::bAddBrackets' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, __WorldContext) == 0x000008, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, OutName) == 0x000010, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::OutName' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, OutType) == 0x000028, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::OutType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, ItemType) == 0x000040, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::ItemType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, ItemName) == 0x000058, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::ItemName' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, MasterData) == 0x000070, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::MasterData' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, Temp_bool_Variable) == 0x000140, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000148, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000170, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetClassNameText_ReturnValue) == 0x000178, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetClassNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000188, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000190, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetTextFromAsset_ReturnValue) == 0x0001A8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, K2Node_MakeStruct_FormatArgumentData) == 0x0001B8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001F8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000210, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, K2Node_MakeArray_Array) == 0x000250, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000260, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Format_ReturnValue) == 0x000268, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000280, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000290, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002A8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, K2Node_Select_Default) == 0x0002AC, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, Temp_bool_Variable_1) == 0x0002B0, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetItemText_ReturnValue) == 0x0002B8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetItemText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0002C8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, K2Node_Select_Default_1) == 0x0002E0, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Conv_TextToString_ReturnValue) == 0x0002F8, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_Add_BracketsToString_ReturnValue) == 0x000308, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_Add_BracketsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetMasterDataManager_IsValid) == 0x000320, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetMasterDataManager_ReturnValue) == 0x000328, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetItemMasterData_IsExists) == 0x000330, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetItemMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetItemToolTipText, CallFunc_GetItemMasterData_ReturnValue) == 0x000338, "Member 'FLIB_CommonIcon_C_GetItemToolTipText::CallFunc_GetItemMasterData_ReturnValue' has a wrong offset!");

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.GetWeaponToolTipText
// 0x0158 (0x0158 - 0x0000)
struct FLIB_CommonIcon_C_GetWeaponToolTipText final
{
public:
	int32                                         WeaponID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddBrackets;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4409[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutName;                                           // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   OutType;                                           // 0x0028(0x0018)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_440A[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponMasterData_IsExists;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_440B[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_GetWeaponMasterData_ReturnValue;          // 0x0058(0x00B0)()
	class FString                                 CallFunc_GetWeaponText_ReturnValue;                // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWeaponTypeText_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
	class FText                                   CallFunc_Add_BracketsToString_ReturnValue;         // 0x0140(0x0018)()
};
static_assert(alignof(FLIB_CommonIcon_C_GetWeaponToolTipText) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_GetWeaponToolTipText");
static_assert(sizeof(FLIB_CommonIcon_C_GetWeaponToolTipText) == 0x000158, "Wrong size on FLIB_CommonIcon_C_GetWeaponToolTipText");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, WeaponID) == 0x000000, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::WeaponID' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, bAddBrackets) == 0x000004, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::bAddBrackets' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, __WorldContext) == 0x000008, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, OutName) == 0x000010, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::OutName' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, OutType) == 0x000028, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::OutType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_GetMasterDataManager_IsValid) == 0x000040, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_GetMasterDataManager_ReturnValue) == 0x000048, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_GetWeaponMasterData_IsExists) == 0x000050, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_GetWeaponMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_GetWeaponMasterData_ReturnValue) == 0x000058, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_GetWeaponMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_GetWeaponText_ReturnValue) == 0x000108, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_GetWeaponText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_GetWeaponTypeText_ReturnValue) == 0x000118, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_GetWeaponTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetWeaponToolTipText, CallFunc_Add_BracketsToString_ReturnValue) == 0x000140, "Member 'FLIB_CommonIcon_C_GetWeaponToolTipText::CallFunc_Add_BracketsToString_ReturnValue' has a wrong offset!");

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.GetCostumeToolTipText
// 0x01F0 (0x01F0 - 0x0000)
struct FLIB_CommonIcon_C_GetCostumeToolTipText final
{
public:
	int32                                         CostumeId;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddBrackets;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_440C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutName;                                           // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   OutType;                                           // 0x0028(0x0018)(Parm, OutParm)
	struct FSBMasterCostume                       MasterCostume;                                     // 0x0040(0x0088)(Edit, BlueprintVisible)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_440D[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_440E[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCostumeText_ReturnValue;               // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_440F[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x0128(0x0088)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0018)()
	class FString                                 CallFunc_GetCostumeWearingPartsText_ReturnValue;   // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Add_BracketsToString_ReturnValue;         // 0x01D8(0x0018)()
};
static_assert(alignof(FLIB_CommonIcon_C_GetCostumeToolTipText) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_GetCostumeToolTipText");
static_assert(sizeof(FLIB_CommonIcon_C_GetCostumeToolTipText) == 0x0001F0, "Wrong size on FLIB_CommonIcon_C_GetCostumeToolTipText");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CostumeId) == 0x000000, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CostumeId' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, bAddBrackets) == 0x000004, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::bAddBrackets' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, __WorldContext) == 0x000008, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, OutName) == 0x000010, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::OutName' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, OutType) == 0x000028, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::OutType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, MasterCostume) == 0x000040, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::MasterCostume' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, K2Node_MakeArray_Array) == 0x0000C8, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_IsEmpty_ReturnValue) == 0x0000E0, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000E8, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_GetDisplayName_ReturnValue) == 0x0000F0, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_GetMasterDataManager_IsValid) == 0x000100, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_GetMasterDataManager_ReturnValue) == 0x000108, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_GetCostumeText_ReturnValue) == 0x000110, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_GetCostumeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_BP_FindCostumeMaster_IsExist) == 0x000120, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_BP_FindCostumeMaster_IsExist' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_BP_FindCostumeMaster_ReturnValue) == 0x000128, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_BP_FindCostumeMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B0, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_GetCostumeWearingPartsText_ReturnValue) == 0x0001C8, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_GetCostumeWearingPartsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetCostumeToolTipText, CallFunc_Add_BracketsToString_ReturnValue) == 0x0001D8, "Member 'FLIB_CommonIcon_C_GetCostumeToolTipText::CallFunc_Add_BracketsToString_ReturnValue' has a wrong offset!");

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.GetImagineToolTipText
// 0x0158 (0x0158 - 0x0000)
struct FLIB_CommonIcon_C_GetImagineToolTipText final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddBrackets;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4410[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutName;                                           // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   OutType;                                           // 0x0028(0x0018)(Parm, OutParm)
	class FString                                 CallFunc_GetRewardItemTypeName_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4411[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Add_BracketsToString_ReturnValue;         // 0x0060(0x0018)()
	bool                                          CallFunc_FindMasterImagineData_IsExists;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4412[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindMasterImagineData_ReturnValue;        // 0x0080(0x00B0)()
	class FString                                 CallFunc_GetMasterImagineText_ReturnValue;         // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0140(0x0018)()
};
static_assert(alignof(FLIB_CommonIcon_C_GetImagineToolTipText) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_GetImagineToolTipText");
static_assert(sizeof(FLIB_CommonIcon_C_GetImagineToolTipText) == 0x000158, "Wrong size on FLIB_CommonIcon_C_GetImagineToolTipText");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, InId) == 0x000000, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::InId' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, bAddBrackets) == 0x000004, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::bAddBrackets' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, __WorldContext) == 0x000008, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::__WorldContext' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, OutName) == 0x000010, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::OutName' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, OutType) == 0x000028, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::OutType' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_GetRewardItemTypeName_ReturnValue) == 0x000040, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_GetRewardItemTypeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_GetMasterDataManager_IsValid) == 0x000050, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_GetMasterDataManager_ReturnValue) == 0x000058, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_Add_BracketsToString_ReturnValue) == 0x000060, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_Add_BracketsToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_FindMasterImagineData_IsExists) == 0x000078, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_FindMasterImagineData_IsExists' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_FindMasterImagineData_ReturnValue) == 0x000080, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_FindMasterImagineData_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_GetMasterImagineText_ReturnValue) == 0x000130, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_GetMasterImagineText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FLIB_CommonIcon_C_GetImagineToolTipText, CallFunc_Conv_StringToText_ReturnValue) == 0x000140, "Member 'FLIB_CommonIcon_C_GetImagineToolTipText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function FLIB_CommonIcon.FLIB_CommonIcon_C.GetLiquidMemoryTooltipText
// 0x00E0 (0x00E0 - 0x0000)
struct FLIB_CommonIcon_C_GetLiquidMemoryTooltipText final
{
public:
	int32                                         InId;                                              // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddBrackets;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4413[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutName;                                           // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   OutType;                                           // 0x0028(0x0018)(Parm, OutParm)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4414[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindLiquidMemoryMaster_IsExists;       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4415[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLiquidMemoryMasterData              CallFunc_BP_FindLiquidMemoryMaster_ReturnValue;    // 0x0058(0x0038)()
	class FString                                 CallFunc_GetLiquidMemoryCategoryName_OutCategoryName; // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLiquidMemoryText_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Add_BracketsToString_ReturnValue;         // 0x00B0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
};
static_assert(alignof(FLIB_CommonIcon_C_GetLiquidMemoryTooltipText) == 0x000008, "Wrong alignment on FLIB_CommonIcon_C_GetLiquidMemoryTooltipText");
