#pragma once

 

// Package: GeneralConfig

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EKeyGuideType_structs.hpp"


namespace SDK::Params
{

// Function GeneralConfig.GeneralConfig_C.Get_HideOthersPlayerAtFishing_Visibility_0
// 0x0006 (0x0006 - 0x0000)
struct GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidHideOthersPlayerAtFishing_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0) == 0x000001, "Wrong alignment on GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0");
static_assert(sizeof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0) == 0x000006, "Wrong size on GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0");
static_assert(offsetof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0, ReturnValue) == 0x000000, "Member 'GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0, CallFunc_ValidHideOthersPlayerAtFishing_ReturnValue) == 0x000004, "Member 'GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0::CallFunc_ValidHideOthersPlayerAtFishing_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0, K2Node_Select_Default) == 0x000005, "Member 'GeneralConfig_C_Get_HideOthersPlayerAtFishing_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.On_Cmb_LogoPosition_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0) == 0x000008, "Wrong alignment on GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0");
static_assert(sizeof(GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0) == 0x000038, "Wrong size on GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0, Item) == 0x000000, "Member 'GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_On_Cmb_LogoPosition_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.On_Cmb_PadKeyView_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0) == 0x000008, "Wrong alignment on GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0");
static_assert(sizeof(GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0) == 0x000038, "Wrong size on GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0");
static_assert(offsetof(GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0, Item) == 0x000000, "Member 'GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_On_Cmb_PadKeyView_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.On_Cmb_LockTargetType_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0) == 0x000008, "Wrong alignment on GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0");
static_assert(sizeof(GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0) == 0x000038, "Wrong size on GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0, Item) == 0x000000, "Member 'GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_On_Cmb_LockTargetType_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.On_Cmb_AutoTarget_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0) == 0x000008, "Wrong alignment on GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0");
static_assert(sizeof(GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0) == 0x000038, "Wrong size on GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0");
static_assert(offsetof(GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0, Item) == 0x000000, "Member 'GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_On_Cmb_AutoTarget_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.On_Cmb_WeaponVisibility_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0) == 0x000008, "Wrong alignment on GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0");
static_assert(sizeof(GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0) == 0x000038, "Wrong size on GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0");
static_assert(offsetof(GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0, Item) == 0x000000, "Member 'GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_On_Cmb_WeaponVisibility_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.On_Cmb_ShortcutRingMode_GenerateWidget_0
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCmnComboBoxItem1_C*                    CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0) == 0x000008, "Wrong alignment on GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0");
static_assert(sizeof(GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0) == 0x000038, "Wrong size on GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0");
static_assert(offsetof(GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0, Item) == 0x000000, "Member 'GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_On_Cmb_ShortcutRingMode_GenerateWidget_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.GenerateLockTargetType
// 0x0048 (0x0048 - 0x0000)
struct GeneralConfig_C_GenerateLockTargetType final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0002(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E02[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAutoTargetEnable_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E03[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneralConfig_C_GenerateLockTargetType) == 0x000008, "Wrong alignment on GeneralConfig_C_GenerateLockTargetType");
static_assert(sizeof(GeneralConfig_C_GenerateLockTargetType) == 0x000048, "Wrong size on GeneralConfig_C_GenerateLockTargetType");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, Temp_bool_Variable) == 0x000000, "Member 'GeneralConfig_C_GenerateLockTargetType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, Temp_bool_Variable_1) == 0x000001, "Member 'GeneralConfig_C_GenerateLockTargetType::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, Temp_bool_Variable_2) == 0x000002, "Member 'GeneralConfig_C_GenerateLockTargetType::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, CallFunc_GetConfigSaveManager_IsValid) == 0x000003, "Member 'GeneralConfig_C_GenerateLockTargetType::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000008, "Member 'GeneralConfig_C_GenerateLockTargetType::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, CallFunc_GetAutoTargetEnable_ReturnValue) == 0x000010, "Member 'GeneralConfig_C_GenerateLockTargetType::CallFunc_GetAutoTargetEnable_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, CallFunc_GetTextFromAsset_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_GenerateLockTargetType::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000028, "Member 'GeneralConfig_C_GenerateLockTargetType::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLockTargetType, K2Node_Select_Default) == 0x000038, "Member 'GeneralConfig_C_GenerateLockTargetType::K2Node_Select_Default' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.GenerateAutoTarget
// 0x0038 (0x0038 - 0x0000)
struct GeneralConfig_C_GenerateAutoTarget final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E04[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAutoTargetSightFocus_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E05[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GeneralConfig_C_GenerateAutoTarget) == 0x000008, "Wrong alignment on GeneralConfig_C_GenerateAutoTarget");
static_assert(sizeof(GeneralConfig_C_GenerateAutoTarget) == 0x000038, "Wrong size on GeneralConfig_C_GenerateAutoTarget");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, Temp_bool_Variable) == 0x000000, "Member 'GeneralConfig_C_GenerateAutoTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, Temp_bool_Variable_1) == 0x000001, "Member 'GeneralConfig_C_GenerateAutoTarget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, CallFunc_GetConfigSaveManager_IsValid) == 0x000002, "Member 'GeneralConfig_C_GenerateAutoTarget::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000008, "Member 'GeneralConfig_C_GenerateAutoTarget::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, CallFunc_GetAutoTargetSightFocus_ReturnValue) == 0x000010, "Member 'GeneralConfig_C_GenerateAutoTarget::CallFunc_GetAutoTargetSightFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, CallFunc_GetTextFromAsset_ReturnValue) == 0x000018, "Member 'GeneralConfig_C_GenerateAutoTarget::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateAutoTarget, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000028, "Member 'GeneralConfig_C_GenerateAutoTarget::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.GenerateWeaponVisible
// 0x0068 (0x0068 - 0x0000)
struct GeneralConfig_C_GenerateWeaponVisible final
{
public:
	class FString                                 AddValue;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ESBWeaponVisibleType                          Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E06[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0020(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E07[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E08[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E09[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBWeaponVisibleType                          CallFunc_GetWeaponVisibleType_ReturnValue;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GeneralConfig_C_GenerateWeaponVisible) == 0x000008, "Wrong alignment on GeneralConfig_C_GenerateWeaponVisible");
static_assert(sizeof(GeneralConfig_C_GenerateWeaponVisible) == 0x000068, "Wrong size on GeneralConfig_C_GenerateWeaponVisible");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, AddValue) == 0x000000, "Member 'GeneralConfig_C_GenerateWeaponVisible::AddValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_byte_Variable) == 0x000010, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_int_Variable) == 0x000014, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_int_Variable_1) == 0x000018, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_int_Variable_2) == 0x00001C, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_int_Variable_3) == 0x000020, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_int_Variable_4) == 0x000024, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, Temp_int_Variable_5) == 0x000028, "Member 'GeneralConfig_C_GenerateWeaponVisible::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_Conv_IntToByte_ReturnValue) == 0x00002C, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_GetValidValue_ReturnValue) == 0x000034, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000035, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000036, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, K2Node_Select_Default) == 0x000038, "Member 'GeneralConfig_C_GenerateWeaponVisible::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_GetTextFromAsset_ReturnValue) == 0x000040, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_GetConfigSaveManager_IsValid) == 0x000050, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000058, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_MakeLiteralInt_ReturnValue) == 0x000060, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_GetWeaponVisibleType_ReturnValue) == 0x000064, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_GetWeaponVisibleType_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000065, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateWeaponVisible, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000066, "Member 'GeneralConfig_C_GenerateWeaponVisible::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.GenerateShortcutRingMode
// 0x0068 (0x0068 - 0x0000)
struct GeneralConfig_C_GenerateShortcutRingMode final
{
public:
	class FString                                 Menu;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ESBShortcutRingMode                           Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E0A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E0B[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E0C[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E0D[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBShortcutRingMode                           CallFunc_GetShortcutRingMode_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E0E[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GeneralConfig_C_GenerateShortcutRingMode) == 0x000008, "Wrong alignment on GeneralConfig_C_GenerateShortcutRingMode");
static_assert(sizeof(GeneralConfig_C_GenerateShortcutRingMode) == 0x000068, "Wrong size on GeneralConfig_C_GenerateShortcutRingMode");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, Menu) == 0x000000, "Member 'GeneralConfig_C_GenerateShortcutRingMode::Menu' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, Temp_byte_Variable) == 0x000010, "Member 'GeneralConfig_C_GenerateShortcutRingMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, Temp_int_Variable) == 0x000014, "Member 'GeneralConfig_C_GenerateShortcutRingMode::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, Temp_int_Variable_1) == 0x000018, "Member 'GeneralConfig_C_GenerateShortcutRingMode::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, Temp_int_Variable_2) == 0x00001C, "Member 'GeneralConfig_C_GenerateShortcutRingMode::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, Temp_int_Variable_3) == 0x000020, "Member 'GeneralConfig_C_GenerateShortcutRingMode::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_Conv_IntToByte_ReturnValue) == 0x000024, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_GetValidValue_ReturnValue) == 0x00002C, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00002D, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00002E, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, K2Node_Select_Default) == 0x000030, "Member 'GeneralConfig_C_GenerateShortcutRingMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000034, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_GetTextFromAsset_ReturnValue) == 0x000038, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_GetConfigSaveManager_IsValid) == 0x000048, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000050, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_GetShortcutRingMode_ReturnValue) == 0x000058, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_GetShortcutRingMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_MakeLiteralInt_ReturnValue) == 0x00005C, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateShortcutRingMode, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'GeneralConfig_C_GenerateShortcutRingMode::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.GenerateLogoPos
// 0x0070 (0x0070 - 0x0000)
struct GeneralConfig_C_GenerateLogoPos final
{
public:
	class FString                                 AddSTR;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSSLogoPosition                             Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E0F[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E10[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E11[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E12[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSSLogoPosition                             CallFunc_GetSSLogoPosition_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E13[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GeneralConfig_C_GenerateLogoPos) == 0x000008, "Wrong alignment on GeneralConfig_C_GenerateLogoPos");
static_assert(sizeof(GeneralConfig_C_GenerateLogoPos) == 0x000070, "Wrong size on GeneralConfig_C_GenerateLogoPos");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, AddSTR) == 0x000000, "Member 'GeneralConfig_C_GenerateLogoPos::AddSTR' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_int_Variable) == 0x000010, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_int_Variable_1) == 0x000014, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_int_Variable_2) == 0x000018, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_int_Variable_3) == 0x00001C, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_byte_Variable) == 0x000020, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_int_Variable_4) == 0x000024, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, Temp_int_Variable_5) == 0x000028, "Member 'GeneralConfig_C_GenerateLogoPos::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_Conv_IntToByte_ReturnValue) == 0x00002C, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_GetValidValue_ReturnValue) == 0x000034, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000035, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000036, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, K2Node_Select_Default) == 0x000038, "Member 'GeneralConfig_C_GenerateLogoPos::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_GetTextFromAsset_ReturnValue) == 0x000040, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_GetConfigSaveManager_IsValid) == 0x000050, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000058, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_GetSSLogoPosition_ReturnValue) == 0x000060, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_GetSSLogoPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_MakeLiteralInt_ReturnValue) == 0x000064, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GenerateLogoPos, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'GeneralConfig_C_GenerateLogoPos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GeneralConfig.GeneralConfig_C.GeneratePadKeyView
// 0x0070 (0x0070 - 0x0000)
struct GeneralConfig_C_GeneratePadKeyView final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E14[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E15[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E16[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPadKeySkinType                             CallFunc_GetPadSkinType_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBPadKeySkinType                             Temp_byte_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E17[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GeneralConfig_C_GeneratePadKeyView) == 0x000008, "Wrong alignment on GeneralConfig_C_GeneratePadKeyView");
static_assert(sizeof(GeneralConfig_C_GeneratePadKeyView) == 0x000070, "Wrong size on GeneralConfig_C_GeneratePadKeyView");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, Temp_name_Variable) == 0x000000, "Member 'GeneralConfig_C_GeneratePadKeyView::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, Temp_name_Variable_1) == 0x000008, "Member 'GeneralConfig_C_GeneratePadKeyView::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, Temp_name_Variable_2) == 0x000010, "Member 'GeneralConfig_C_GeneratePadKeyView::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, Temp_int_Variable) == 0x000018, "Member 'GeneralConfig_C_GeneratePadKeyView::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, Temp_int_Variable_1) == 0x00001C, "Member 'GeneralConfig_C_GeneratePadKeyView::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_Conv_IntToByte_ReturnValue) == 0x000020, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_GetValidValue_ReturnValue) == 0x000028, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000029, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00002A, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, Temp_name_Variable_3) == 0x000030, "Member 'GeneralConfig_C_GeneratePadKeyView::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_GetConfigSaveManager_IsValid) == 0x000038, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(GeneralConfig_C_GeneratePadKeyView, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000040, "Member 'GeneralConfig_C_GeneratePadKeyView::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
