#pragma once

 

// Package: ImagineCraft

#include "Basic.hpp"

#include "Filter_Type_structs.hpp"
#include "CraftRecepiSortType_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ImagineCraft.ImagineCraft_C.ExecuteUbergraph_ImagineCraft
// 0x03C0 (0x03C0 - 0x0000)
struct ImagineCraft_C_ExecuteUbergraph_ImagineCraft final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBImagineCategoryType                        Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D1[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalclateMoney_Money;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalclateMoney_isLiquidMemomryActive;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CalclateMoney_IsDiscount;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D2[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBImagineLabComponent*                 CallFunc_GetImaginLabComp_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x0038(0x0010)(ReferenceParm)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECraftRecepiSortType                          CallFunc_Map_Find_Value;                           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D4[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStorage_StorageNo;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isImagineCraftRecepiMaterialLocked_ReturnValue; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D5[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_1;                       // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFilter_Type                                  Temp_byte_Variable_4;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D6[0x1];                                     // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	bool                                          CallFunc_ValidLimitedRecepi_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasConditionItem_ReturnValue;             // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBImagineCategoryType                        Temp_byte_Variable_5;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D7[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 InRetCode)>              K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D8[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterImagineRecepi                   K2Node_CustomEvent_Recepi;                         // 0x00E0(0x0038)()
	class URecepiListItemBtn_C*                   K2Node_CustomEvent_SelectedItem;                   // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50D9[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_2;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50DA[0x7];                                     // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBImagineLabComponent*                 CallFunc_GetImaginLabComp_ReturnValue_1;           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBImagineLabComponent*                 CallFunc_GetImaginLabComp_ReturnValue_2;           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50DB[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_MakedUID;                       // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0178(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0188(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50DC[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMoney_ReturnValue;                     // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50DD[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_isCloseAll;             // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_isLackAdvRank;                  // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetAdventurerRank_ReturnValue;            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50DE[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterImagineRecepi                   K2Node_MakeStruct_MasterImagineRecepi;             // 0x01C0(0x0038)()
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckMaterialsAmount_is_Lack;             // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50DF[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_1;             // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimeoutItem_ReturnValue;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E0[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ContainsTimeoutImagineRecepiMaterial_ReturnValue; // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E1[0x3];                                     // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWishListData                        K2Node_MakeStruct_SBWishListData;                  // 0x0240(0x000C)(NoDestructor)
	TDelegate<void(int32 RetCode, const class FString& MakedUID)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsRegistedWishlist_ReturnValue;           // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E2[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0267(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E3[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyLiquidMemoryActive_Active;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRegisterWishlistLimit_bIsRegisterWishList; // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E4[0x5];                                     // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E5[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerRewardBoostComponent*          CallFunc_GetRewardBoostComponent_ReturnValue;      // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E6[0x2];                                     // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRetCode;                      // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E7[0x7];                                     // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue_2;             // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTimeoutItem_ReturnValue_1;              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTimeoutImagineRecepiMaterial_ReturnValue_1; // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50E8[0x2];                                     // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWishListData                        K2Node_MakeStruct_SBWishListData_1;                // 0x02B4(0x000C)(NoDestructor)
	bool                                          CallFunc_IsRegistedWishlist_ReturnValue_1;         // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFilter_Type                                  K2Node_Select_Default_1;                           // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckMaterialsAmount_is_Lack_1;           // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50E9[0x5];                                     // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x02D0(0x0028)()
	struct FSlateColor                            CallFunc_GetImpossibleColor_ReturnValue;           // 0x02F8(0x0028)()
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue;                       // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0328(0x0028)()
	class UWidget*                                K2Node_Select_Default_4;                           // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBItemSortType                               CallFunc_ConvertCraftSort_SortType;                // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRegisterWishlistLimit_bIsRegisterWishList_1; // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBImagineCategoryType                        Temp_byte_Variable_8;                              // 0x035E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x035F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 K2Node_Select_Default_5;                           // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50EA[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0380(0x0018)()
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_4;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_3;             // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft) == 0x000008, "Wrong alignment on ImagineCraft_C_ExecuteUbergraph_ImagineCraft");
static_assert(sizeof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft) == 0x0003C0, "Wrong size on ImagineCraft_C_ExecuteUbergraph_ImagineCraft");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, EntryPoint) == 0x000000, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::EntryPoint' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable) == 0x000004, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_bool_Variable) == 0x000005, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_1) == 0x000006, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_2) == 0x000007, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_bool_Variable_1) == 0x000008, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_3) == 0x000009, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_CalclateMoney_Money) == 0x000018, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_CalclateMoney_Money' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_CalclateMoney_isLiquidMemomryActive) == 0x00001C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_CalclateMoney_isLiquidMemomryActive' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_CalclateMoney_IsDiscount) == 0x00001D, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_CalclateMoney_IsDiscount' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000020, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetImaginLabComp_ReturnValue) == 0x000030, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetImaginLabComp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_ComponentBoundEvent_Filters) == 0x000038, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_ComponentBoundEvent_SelectedItem) == 0x000048, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_ComponentBoundEvent_SelectionType) == 0x000058, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Map_Find_Value) == 0x000059, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Map_Find_ReturnValue) == 0x00005A, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetStorage_StorageNo) == 0x00005C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetStorage_StorageNo' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_isImagineCraftRecepiMaterialLocked_ReturnValue) == 0x000060, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_isImagineCraftRecepiMaterialLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_Result_1) == 0x000074, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_4) == 0x000075, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000076, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000078, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_ValidLimitedRecepi_ReturnValue) == 0x0000A0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_ValidLimitedRecepi_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_Result) == 0x0000A1, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_HasConditionItem_ReturnValue) == 0x0000A2, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_HasConditionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000A3, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_5) == 0x0000A4, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetTextFromAsset_ReturnValue) == 0x0000A8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x0000C8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_6) == 0x0000D8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_Recepi) == 0x0000E0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_Recepi' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_SelectedItem) == 0x000118, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetPlayerController_ReturnValue_2) == 0x000128, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_DynamicCast_AsSBPlayer_Controller_1) == 0x000130, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_DynamicCast_AsSBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_DynamicCast_AsSBPlayer_Controller_2) == 0x000140, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_DynamicCast_AsSBPlayer_Controller_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetImaginLabComp_ReturnValue_1) == 0x000150, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetImaginLabComp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetImaginLabComp_ReturnValue_2) == 0x000158, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetImaginLabComp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_RetCode_1) == 0x000160, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_MakedUID) == 0x000168, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_MakedUID' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetSBRetMessage_ReturnValue) == 0x000178, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000188, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetMoney_ReturnValue) == 0x0001A4, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetMoney_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_RetCode) == 0x0001AC, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001B0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_ComponentBoundEvent_isCloseAll) == 0x0001B1, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_ComponentBoundEvent_isCloseAll' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_Visible) == 0x0001B2, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_isLackAdvRank) == 0x0001B3, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_isLackAdvRank' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetAdventurerRank_ReturnValue) == 0x0001B4, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetAdventurerRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001B8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_MakeStruct_MasterImagineRecepi) == 0x0001C0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_MakeStruct_MasterImagineRecepi' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_7) == 0x0001F8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_bool_Variable_2) == 0x0001F9, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_CheckMaterialsAmount_is_Lack) == 0x0001FA, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_CheckMaterialsAmount_is_Lack' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001FB, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_PlayAnimation_ReturnValue) == 0x000200, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetCharacterId_ReturnValue) == 0x000208, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetCharacterId_ReturnValue_1) == 0x000218, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetCharacterId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsTimeoutItem_ReturnValue) == 0x000228, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsTimeoutItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CreateDelegate_OutputDelegate_2) == 0x00022C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_ContainsTimeoutImagineRecepiMaterial_ReturnValue) == 0x00023C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_ContainsTimeoutImagineRecepiMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_MakeStruct_SBWishListData) == 0x000240, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_MakeStruct_SBWishListData' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CreateDelegate_OutputDelegate_3) == 0x00024C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsRegistedWishlist_ReturnValue) == 0x00025C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsRegistedWishlist_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_PlaySE_ReturnValue) == 0x000260, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue) == 0x000264, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_1) == 0x000265, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue) == 0x000266, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue_1) == 0x000267, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_2) == 0x000268, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_PlaySE_ReturnValue_1) == 0x00026C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsAnyLiquidMemoryActive_Active) == 0x000270, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsAnyLiquidMemoryActive_Active' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_Select_Default) == 0x000271, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsRegisterWishlistLimit_bIsRegisterWishList) == 0x000272, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsRegisterWishlistLimit_bIsRegisterWishList' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetSBPlayerController_ReturnValue) == 0x000278, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue_2) == 0x000280, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetRewardBoostComponent_ReturnValue) == 0x000288, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetRewardBoostComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanOR_ReturnValue) == 0x000290, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanOR_ReturnValue_1) == 0x000291, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CustomEvent_InRetCode) == 0x000294, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CustomEvent_InRetCode' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_3) == 0x000298, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetCharacterId_ReturnValue_2) == 0x0002A0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetCharacterId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsTimeoutItem_ReturnValue_1) == 0x0002B0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsTimeoutItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_ContainsTimeoutImagineRecepiMaterial_ReturnValue_1) == 0x0002B1, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_ContainsTimeoutImagineRecepiMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_MakeStruct_SBWishListData_1) == 0x0002B4, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_MakeStruct_SBWishListData_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsRegistedWishlist_ReturnValue_1) == 0x0002C0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsRegistedWishlist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_4) == 0x0002C1, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_5) == 0x0002C2, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue_3) == 0x0002C3, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue_4) == 0x0002C4, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_6) == 0x0002C5, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_Select_Default_1) == 0x0002C6, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_CheckMaterialsAmount_is_Lack_1) == 0x0002C7, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_CheckMaterialsAmount_is_Lack_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_7) == 0x0002C8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue_5) == 0x0002C9, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_Select_Default_2) == 0x0002CA, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_MakeStruct_SlateColor) == 0x0002D0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetImpossibleColor_ReturnValue) == 0x0002F8, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetImpossibleColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Create_ReturnValue) == 0x000320, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_Select_Default_3) == 0x000328, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_Select_Default_4) == 0x000350, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_ConvertCraftSort_SortType) == 0x000358, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_ConvertCraftSort_SortType' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_IsRegisterWishlistLimit_bIsRegisterWishList_1) == 0x000359, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_IsRegisterWishlistLimit_bIsRegisterWishList_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanAND_ReturnValue_6) == 0x00035A, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanOR_ReturnValue_2) == 0x00035B, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_BooleanOR_ReturnValue_3) == 0x00035C, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Not_PreBool_ReturnValue_8) == 0x00035D, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, Temp_byte_Variable_8) == 0x00035E, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_ComponentBoundEvent_bIsChecked) == 0x00035F, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_Select_Default_5) == 0x000360, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetConfigSaveManager_IsValid) == 0x000370, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000378, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000380, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_Create_ReturnValue_1) == 0x000398, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003A0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ImagineCraft_C_ExecuteUbergraph_ImagineCraft, CallFunc_GetCharacterId_ReturnValue_3) == 0x0003B0, "Member 'ImagineCraft_C_ExecuteUbergraph_ImagineCraft::CallFunc_GetCharacterId_ReturnValue_3' has a wrong offset!");

// Function ImagineCraft.ImagineCraft_C.BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'ImagineCraft_C_BndEvt__ImagineCraft_CB_FilterCraftable_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function ImagineCraft.ImagineCraft_C.OnRequest_GetRewaedBoost_cmpl
// 0x0004 (0x0004 - 0x0000)
struct ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl final
{
public:
	int32                                         InRetCode;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl) == 0x000004, "Wrong alignment on ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl");
static_assert(sizeof(ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl) == 0x000004, "Wrong size on ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl");
static_assert(offsetof(ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl, InRetCode) == 0x000000, "Member 'ImagineCraft_C_OnRequest_GetRewaedBoost_cmpl::InRetCode' has a wrong offset!");

// Function ImagineCraft.ImagineCraft_C.ChgHelpMode
// 0x0001 (0x0001 - 0x0000)
struct ImagineCraft_C_ChgHelpMode final
{
public:
	bool                                          IsLackAdvRank;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImagineCraft_C_ChgHelpMode) == 0x000001, "Wrong alignment on ImagineCraft_C_ChgHelpMode");
static_assert(sizeof(ImagineCraft_C_ChgHelpMode) == 0x000001, "Wrong size on ImagineCraft_C_ChgHelpMode");
static_assert(offsetof(ImagineCraft_C_ChgHelpMode, IsLackAdvRank) == 0x000000, "Member 'ImagineCraft_C_ChgHelpMode::IsLackAdvRank' has a wrong offset!");

// Function ImagineCraft.ImagineCraft_C.ShowHelp
// 0x0001 (0x0001 - 0x0000)
struct ImagineCraft_C_ShowHelp final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImagineCraft_C_ShowHelp) == 0x000001, "Wrong alignment on ImagineCraft_C_ShowHelp");
static_assert(sizeof(ImagineCraft_C_ShowHelp) == 0x000001, "Wrong size on ImagineCraft_C_ShowHelp");
static_assert(offsetof(ImagineCraft_C_ShowHelp, Visible) == 0x000000, "Member 'ImagineCraft_C_ShowHelp::Visible' has a wrong offset!");

// Function ImagineCraft.ImagineCraft_C.BndEvt__ImagineCraftResult_K2Node_ComponentBoundEvent_6_OnClosed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct ImagineCraft_C_BndEvt__ImagineCraftResult_K2Node_ComponentBoundEvent_6_OnClosed__DelegateSignature final
{
public:
	bool                                          IsCloseAll;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ImagineCraft_C_BndEvt__ImagineCraftResult_K2Node_ComponentBoundEvent_6_OnClosed__DelegateSignature) == 0x000001, "Wrong alignment on ImagineCraft_C_BndEvt__ImagineCraftResult_K2Node_ComponentBoundEvent_6_OnClosed__DelegateSignature");
static_assert(sizeof(ImagineCraft_C_BndEvt__ImagineCraftResult_K2Node_ComponentBoundEvent_6_OnClosed__DelegateSignature) == 0x000001, "Wrong size on ImagineCraft_C_BndEvt__ImagineCraftResult_K2Node_ComponentBoundEvent_6_OnClosed__DelegateSignature");
