#pragma once

 

// Package: InhelitPerkViewItem

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function InhelitPerkViewItem.InhelitPerkViewItem_C.SelectChange__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct InhelitPerkViewItem_C_SelectChange__DelegateSignature final
{
public:
	struct FSBStackBPerk                          SelectData;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(InhelitPerkViewItem_C_SelectChange__DelegateSignature) == 0x000008, "Wrong alignment on InhelitPerkViewItem_C_SelectChange__DelegateSignature");
static_assert(sizeof(InhelitPerkViewItem_C_SelectChange__DelegateSignature) == 0x000030, "Wrong size on InhelitPerkViewItem_C_SelectChange__DelegateSignature");
static_assert(offsetof(InhelitPerkViewItem_C_SelectChange__DelegateSignature, SelectData) == 0x000000, "Member 'InhelitPerkViewItem_C_SelectChange__DelegateSignature::SelectData' has a wrong offset!");

// Function InhelitPerkViewItem.InhelitPerkViewItem_C.SelectPurge__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct InhelitPerkViewItem_C_SelectPurge__DelegateSignature final
{
public:
	struct FSBStackBPerk                          SelectPerk;                                        // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(InhelitPerkViewItem_C_SelectPurge__DelegateSignature) == 0x000008, "Wrong alignment on InhelitPerkViewItem_C_SelectPurge__DelegateSignature");
static_assert(sizeof(InhelitPerkViewItem_C_SelectPurge__DelegateSignature) == 0x000030, "Wrong size on InhelitPerkViewItem_C_SelectPurge__DelegateSignature");
static_assert(offsetof(InhelitPerkViewItem_C_SelectPurge__DelegateSignature, SelectPerk) == 0x000000, "Member 'InhelitPerkViewItem_C_SelectPurge__DelegateSignature::SelectPerk' has a wrong offset!");

// Function InhelitPerkViewItem.InhelitPerkViewItem_C.ExecuteUbergraph_InhelitPerkViewItem
// 0x0004 (0x0004 - 0x0000)
struct InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem) == 0x000004, "Wrong alignment on InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem");
static_assert(sizeof(InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem) == 0x000004, "Wrong size on InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem");
static_assert(offsetof(InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem, EntryPoint) == 0x000000, "Member 'InhelitPerkViewItem_C_ExecuteUbergraph_InhelitPerkViewItem::EntryPoint' has a wrong offset!");

// Function InhelitPerkViewItem.InhelitPerkViewItem_C.SetPerkData
// 0x0030 (0x0030 - 0x0000)
struct InhelitPerkViewItem_C_SetPerkData final
{
public:
	struct FSBStackBPerk                          SBCharacter_Weapon_Perk_Data;                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(InhelitPerkViewItem_C_SetPerkData) == 0x000008, "Wrong alignment on InhelitPerkViewItem_C_SetPerkData");
static_assert(sizeof(InhelitPerkViewItem_C_SetPerkData) == 0x000030, "Wrong size on InhelitPerkViewItem_C_SetPerkData");
static_assert(offsetof(InhelitPerkViewItem_C_SetPerkData, SBCharacter_Weapon_Perk_Data) == 0x000000, "Member 'InhelitPerkViewItem_C_SetPerkData::SBCharacter_Weapon_Perk_Data' has a wrong offset!");

}

