#pragma once

 

// Package: InventoryFunctionLibrary

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "ST_ATypeFilterListData_structs.hpp"
#include "ST_ATypeFilterSortData_structs.hpp"
#include "Engine_structs.hpp"
#include "UseItemWindowType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InventoryItemData_structs.hpp"
#include "InventoryData_structs.hpp"
#include "InventoryWeaponData_structs.hpp"


namespace SDK::Params
{

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.CreateInventoryData
// 0x0DA8 (0x0DA8 - 0x0000)
struct InventoryFunctionLibrary_C_CreateInventoryData final
{
public:
	struct FOwnItemInfo                           OwnItemInfo;                                       // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryData                         InventoryData;                                     // 0x0120(0x0098)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          IsSuccess;                                         // 0x01B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958C[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           TmpOwnItemInfo;                                    // 0x01C0(0x0118)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958D[0x6];                                     // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindMasterMountImagineData_bOutExist;  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958E[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterMountImagine                  CallFunc_BP_FindMasterMountImagineData_ReturnValue; // 0x02F0(0x0070)()
	bool                                          CallFunc_GetMasterDataManager_IsValid_1;           // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_958F[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_1;       // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMasterMountImagineText_ReturnValue;    // 0x0370(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindMasterImagineData_IsExists;           // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9590[0x7];                                     // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindMasterImagineData_ReturnValue;        // 0x0388(0x00B0)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0438(0x0018)()
	struct FInventoryItemData                     K2Node_MakeStruct_InventoryItemData;               // 0x0450(0x0060)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetMasterImagineText_ReturnValue;         // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInventoryData                         K2Node_MakeStruct_InventoryData;                   // 0x04C0(0x0098)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0558(0x0018)()
	struct FInventoryItemData                     K2Node_MakeStruct_InventoryItemData_1;             // 0x0570(0x0060)(HasGetValueTypeHash)
	struct FInventoryData                         K2Node_MakeStruct_InventoryData_1;                 // 0x05D0(0x0098)(HasGetValueTypeHash)
	struct FInventoryWeaponData                   K2Node_MakeStruct_InventoryWeaponData;             // 0x0668(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_2;           // 0x066A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9591[0x5];                                     // 0x066B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_2;       // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindOrnamentMaster_valid;                 // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9592[0x7];                                     // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterOrnament                      CallFunc_FindOrnamentMaster_ReturnValue;           // 0x0680(0x0060)()
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9593[0x7];                                     // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x06E8(0x0088)()
	class FString                                 CallFunc_GetOrnamentText_ReturnValue;              // 0x0770(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCostumeText_ReturnValue;               // 0x0780(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0790(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x07A8(0x0018)()
	struct FInventoryItemData                     K2Node_MakeStruct_InventoryItemData_2;             // 0x07C0(0x0060)(HasGetValueTypeHash)
	struct FInventoryItemData                     K2Node_MakeStruct_InventoryItemData_3;             // 0x0820(0x0060)(HasGetValueTypeHash)
	struct FInventoryData                         K2Node_MakeStruct_InventoryData_2;                 // 0x0880(0x0098)(HasGetValueTypeHash)
	struct FInventoryData                         K2Node_MakeStruct_InventoryData_3;                 // 0x0918(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponMasterData_IsExists;             // 0x09B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9594[0x7];                                     // 0x09B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_GetWeaponMasterData_ReturnValue;          // 0x09B8(0x00B0)()
	bool                                          CallFunc_GetItemMasterData_IsExists;               // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9595[0x7];                                     // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        CallFunc_GetItemMasterData_ReturnValue;            // 0x0A70(0x00D0)()
	class FString                                 CallFunc_GetWeaponText_ReturnValue;                // 0x0B40(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemText_ReturnValue;                  // 0x0B50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0B60(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0B78(0x0018)()
	struct FInventoryItemData                     K2Node_MakeStruct_InventoryItemData_4;             // 0x0B90(0x0060)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemText_ReturnValue_1;                // 0x0BF0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInventoryData                         K2Node_MakeStruct_InventoryData_4;                 // 0x0C00(0x0098)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0C98(0x0018)()
	struct FInventoryItemData                     K2Node_MakeStruct_InventoryItemData_5;             // 0x0CB0(0x0060)(HasGetValueTypeHash)
	struct FInventoryData                         K2Node_MakeStruct_InventoryData_5;                 // 0x0D10(0x0098)(HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_CreateInventoryData) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_CreateInventoryData");
static_assert(sizeof(InventoryFunctionLibrary_C_CreateInventoryData) == 0x000DA8, "Wrong size on InventoryFunctionLibrary_C_CreateInventoryData");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, OwnItemInfo) == 0x000000, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::OwnItemInfo' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, __WorldContext) == 0x000118, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, InventoryData) == 0x000120, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::InventoryData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, IsSuccess) == 0x0001B8, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::IsSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, TmpOwnItemInfo) == 0x0001C0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::TmpOwnItemInfo' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_SwitchEnum_CmpSuccess) == 0x0002D8, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterDataManager_IsValid) == 0x0002D9, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterDataManager_ReturnValue) == 0x0002E0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_BP_FindMasterMountImagineData_bOutExist) == 0x0002E8, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_BP_FindMasterMountImagineData_bOutExist' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_BP_FindMasterMountImagineData_ReturnValue) == 0x0002F0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_BP_FindMasterMountImagineData_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterDataManager_IsValid_1) == 0x000360, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterDataManager_IsValid_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterDataManager_ReturnValue_1) == 0x000368, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterDataManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterMountImagineText_ReturnValue) == 0x000370, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterMountImagineText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_FindMasterImagineData_IsExists) == 0x000380, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_FindMasterImagineData_IsExists' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_FindMasterImagineData_ReturnValue) == 0x000388, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_FindMasterImagineData_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue) == 0x000438, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryItemData) == 0x000450, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryItemData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterImagineText_ReturnValue) == 0x0004B0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterImagineText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryData) == 0x0004C0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000558, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryItemData_1) == 0x000570, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryItemData_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryData_1) == 0x0005D0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryData_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryWeaponData) == 0x000668, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryWeaponData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterDataManager_IsValid_2) == 0x00066A, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterDataManager_IsValid_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetMasterDataManager_ReturnValue_2) == 0x000670, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetMasterDataManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_FindOrnamentMaster_valid) == 0x000678, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_FindOrnamentMaster_valid' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_FindOrnamentMaster_ReturnValue) == 0x000680, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_FindOrnamentMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_BP_FindCostumeMaster_IsExist) == 0x0006E0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_BP_FindCostumeMaster_IsExist' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_BP_FindCostumeMaster_ReturnValue) == 0x0006E8, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_BP_FindCostumeMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetOrnamentText_ReturnValue) == 0x000770, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetOrnamentText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetCostumeText_ReturnValue) == 0x000780, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetCostumeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000790, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0007A8, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryItemData_2) == 0x0007C0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryItemData_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryItemData_3) == 0x000820, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryItemData_3' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryData_2) == 0x000880, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryData_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryData_3) == 0x000918, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryData_3' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetWeaponMasterData_IsExists) == 0x0009B0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetWeaponMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetWeaponMasterData_ReturnValue) == 0x0009B8, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetWeaponMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetItemMasterData_IsExists) == 0x000A68, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetItemMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetItemMasterData_ReturnValue) == 0x000A70, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetItemMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetWeaponText_ReturnValue) == 0x000B40, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetWeaponText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetItemText_ReturnValue) == 0x000B50, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetItemText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000B60, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000B78, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryItemData_4) == 0x000B90, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryItemData_4' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_GetItemText_ReturnValue_1) == 0x000BF0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_GetItemText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryData_4) == 0x000C00, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryData_4' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, CallFunc_Conv_StringToText_ReturnValue_6) == 0x000C98, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryItemData_5) == 0x000CB0, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryItemData_5' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_CreateInventoryData, K2Node_MakeStruct_InventoryData_5) == 0x000D10, "Member 'InventoryFunctionLibrary_C_CreateInventoryData::K2Node_MakeStruct_InventoryData_5' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.Create Add Grid Item Icon Btn
// 0x0070 (0x0070 - 0x0000)
struct InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn final
{
public:
	class UGridPanel*                             ParentGridPanel;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CreateNum;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatricesNam;                                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MagineintervalTop;                                 // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MagineintervalLeft;                                // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsImagineSimpleTooltip;                            // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsToolTipEnable;                                   // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsRightClickAccept;                               // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9596[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseSize;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverSize;                                          // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MarginLeft;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MarginTop;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemIconBtn_C*                         CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9597[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn");
static_assert(sizeof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn) == 0x000070, "Wrong size on InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, ParentGridPanel) == 0x000000, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::ParentGridPanel' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, FirstIndex) == 0x000008, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::FirstIndex' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CreateNum) == 0x00000C, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CreateNum' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, MatricesNam) == 0x000010, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::MatricesNam' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, MagineintervalTop) == 0x000014, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::MagineintervalTop' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, MagineintervalLeft) == 0x000018, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::MagineintervalLeft' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, IsImagineSimpleTooltip) == 0x00001C, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::IsImagineSimpleTooltip' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, IsToolTipEnable) == 0x00001D, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::IsToolTipEnable' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, bIsRightClickAccept) == 0x00001E, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::bIsRightClickAccept' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, BaseSize) == 0x000020, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::BaseSize' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, OverSize) == 0x000024, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::OverSize' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, __WorldContext) == 0x000028, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, MarginLeft) == 0x000030, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::MarginLeft' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, MarginTop) == 0x000034, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::MarginTop' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_Create_ReturnValue) == 0x000038, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_AddChildToGrid_ReturnValue) == 0x000040, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, K2Node_MakeStruct_Margin) == 0x00004C, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, Temp_int_Variable) == 0x00005C, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_Percent_IntInt_ReturnValue) == 0x000060, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_Divide_IntInt_ReturnValue) == 0x000064, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000069, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006A, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'InventoryFunctionLibrary_C_Create_Add_Grid_Item_Icon_Btn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.EmptyGridSlot
// 0x0040 (0x0040 - 0x0000)
struct InventoryFunctionLibrary_C_EmptyGridSlot final
{
public:
	class UGridPanel*                             GridPanel;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotNum;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9598[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9599[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_EmptyGridSlot) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_EmptyGridSlot");
static_assert(sizeof(InventoryFunctionLibrary_C_EmptyGridSlot) == 0x000040, "Wrong size on InventoryFunctionLibrary_C_EmptyGridSlot");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, GridPanel) == 0x000000, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::GridPanel' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, SlotNum) == 0x000008, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::SlotNum' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, __WorldContext) == 0x000010, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, Temp_int_Variable) == 0x00001C, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000025, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, K2Node_DynamicCast_AsItem_Icon_Btn) == 0x000030, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::K2Node_DynamicCast_AsItem_Icon_Btn' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_EmptyGridSlot, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'InventoryFunctionLibrary_C_EmptyGridSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.SetCaptureStudioEnable
// 0x0070 (0x0070 - 0x0000)
struct InventoryFunctionLibrary_C_SetCaptureStudioEnable final
{
public:
	class UUMG_CaptureStudio_C*                   CaptureStudioWeapon;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CaptureStudio_C*                   CaptureStudioCostume;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CaptureStudio_C*                   CaptureStudioImagine;                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CaptureStudio_C*                   CaptureStudioMountImagine;                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     ItemType;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959C[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_CaptureStudio_C*                   Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CaptureStudio_C*                   Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CaptureStudio_C*                   Temp_object_Variable_2;                            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_CaptureStudio_C*                   Temp_object_Variable_3;                            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_CaptureStudio_C*                   K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryFunctionLibrary_C_SetCaptureStudioEnable) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_SetCaptureStudioEnable");
static_assert(sizeof(InventoryFunctionLibrary_C_SetCaptureStudioEnable) == 0x000070, "Wrong size on InventoryFunctionLibrary_C_SetCaptureStudioEnable");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, CaptureStudioWeapon) == 0x000000, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::CaptureStudioWeapon' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, CaptureStudioCostume) == 0x000008, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::CaptureStudioCostume' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, CaptureStudioImagine) == 0x000010, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::CaptureStudioImagine' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, CaptureStudioMountImagine) == 0x000018, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::CaptureStudioMountImagine' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, ItemType) == 0x000020, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::ItemType' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, __WorldContext) == 0x000028, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, Result) == 0x000030, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::Result' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, Temp_object_Variable) == 0x000038, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, Temp_object_Variable_1) == 0x000040, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, Temp_object_Variable_2) == 0x000048, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, Temp_object_Variable_3) == 0x000050, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, Temp_byte_Variable) == 0x000058, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, K2Node_Select_Default) == 0x000060, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_SetCaptureStudioEnable, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'InventoryFunctionLibrary_C_SetCaptureStudioEnable::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.Set Item Lock Save
// 0x01E8 (0x01E8 - 0x0000)
struct InventoryFunctionLibrary_C_Set_Item_Lock_Save final
{
public:
	TDelegate<void(bool Result, TArray<struct FSBLockItemData>& LockItemData, int32 InRetCode)> InputPin;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	class FString                                 UniqueId;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         StorageNumber;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     InItemType;                                        // 0x0024(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959E[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBLockItemData                        LockItemData;                                      // 0x0030(0x0020)(Parm, OutParm)
	bool                                          bIsItemLock;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_959F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                TmpOwnItemListContainer;                           // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 TmpUniqueId;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         TmpStorageNumber;                                  // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95A0[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBLockItemData>                TmpItemLockData;                                   // 0x0078(0x0010)(Edit, BlueprintVisible)
	class ASBPlayerState*                         CallFunc_GetSBPlayerState_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A1[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x00A0(0x0118)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A2[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBLockItemData                        K2Node_MakeStruct_SBLockItemData;                  // 0x01C0(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_Set_Item_Lock_Save) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_Set_Item_Lock_Save");
static_assert(sizeof(InventoryFunctionLibrary_C_Set_Item_Lock_Save) == 0x0001E8, "Wrong size on InventoryFunctionLibrary_C_Set_Item_Lock_Save");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, InputPin) == 0x000000, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::InputPin' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, UniqueId) == 0x000010, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::UniqueId' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, StorageNumber) == 0x000020, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::StorageNumber' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, InItemType) == 0x000024, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::InItemType' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, __WorldContext) == 0x000028, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, LockItemData) == 0x000030, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::LockItemData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, bIsItemLock) == 0x000050, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::bIsItemLock' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, TmpOwnItemListContainer) == 0x000058, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::TmpOwnItemListContainer' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, TmpUniqueId) == 0x000060, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::TmpUniqueId' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, TmpStorageNumber) == 0x000070, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::TmpStorageNumber' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, TmpItemLockData) == 0x000078, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::TmpItemLockData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_GetSBPlayerState_ReturnValue) == 0x000088, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_GetSBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_GetStorage_ReturnValue) == 0x000090, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x000098, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x0000A0, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_Not_PreBool_ReturnValue) == 0x0001B8, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_Conv_BoolToInt_ReturnValue) == 0x0001BC, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, K2Node_MakeStruct_SBLockItemData) == 0x0001C0, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::K2Node_MakeStruct_SBLockItemData' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_Set_Item_Lock_Save, CallFunc_Array_Add_ReturnValue) == 0x0001E0, "Member 'InventoryFunctionLibrary_C_Set_Item_Lock_Save::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.UnbindItemLockDelegate
// 0x0020 (0x0020 - 0x0000)
struct InventoryFunctionLibrary_C_UnbindItemLockDelegate final
{
public:
	TDelegate<void(bool Result, TArray<struct FSBLockItemData>& LockItemData, int32 InRetCode)> Event;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerState*                         CallFunc_GetSBPlayerState_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventoryFunctionLibrary_C_UnbindItemLockDelegate) == 0x000008, "Wrong alignment on InventoryFunctionLibrary_C_UnbindItemLockDelegate");
static_assert(sizeof(InventoryFunctionLibrary_C_UnbindItemLockDelegate) == 0x000020, "Wrong size on InventoryFunctionLibrary_C_UnbindItemLockDelegate");
static_assert(offsetof(InventoryFunctionLibrary_C_UnbindItemLockDelegate, Event) == 0x000000, "Member 'InventoryFunctionLibrary_C_UnbindItemLockDelegate::Event' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UnbindItemLockDelegate, __WorldContext) == 0x000010, "Member 'InventoryFunctionLibrary_C_UnbindItemLockDelegate::__WorldContext' has a wrong offset!");
static_assert(offsetof(InventoryFunctionLibrary_C_UnbindItemLockDelegate, CallFunc_GetSBPlayerState_ReturnValue) == 0x000018, "Member 'InventoryFunctionLibrary_C_UnbindItemLockDelegate::CallFunc_GetSBPlayerState_ReturnValue' has a wrong offset!");

// Function InventoryFunctionLibrary.InventoryFunctionLibrary_C.UpdateItemLockaVisibility
// 0x0058 (0x0058 - 0x0000)
struct InventoryFunctionLibrary_C_UpdateItemLockaVisibility final
{
public:
	class UGridPanel*                             InventorySlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 UniqueId;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsVisibility;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A3[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95A4[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95A5[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
