#pragma once

 

// Package: ItemIconBtn

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "CharaParts_structs.hpp"
#include "InventoryItemData_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ItemIconBtn.ItemIconBtn_C.OnSelect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemIconBtn_C_OnSelect__DelegateSignature final
{
public:
	class UItemIconBtn_C*                         SelectItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_OnSelect__DelegateSignature) == 0x000008, "Wrong alignment on ItemIconBtn_C_OnSelect__DelegateSignature");
static_assert(sizeof(ItemIconBtn_C_OnSelect__DelegateSignature) == 0x000008, "Wrong size on ItemIconBtn_C_OnSelect__DelegateSignature");
static_assert(offsetof(ItemIconBtn_C_OnSelect__DelegateSignature, SelectItem) == 0x000000, "Member 'ItemIconBtn_C_OnSelect__DelegateSignature::SelectItem' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.OnSelectRight__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemIconBtn_C_OnSelectRight__DelegateSignature final
{
public:
	class UItemIconBtn_C*                         SelectItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_OnSelectRight__DelegateSignature) == 0x000008, "Wrong alignment on ItemIconBtn_C_OnSelectRight__DelegateSignature");
static_assert(sizeof(ItemIconBtn_C_OnSelectRight__DelegateSignature) == 0x000008, "Wrong size on ItemIconBtn_C_OnSelectRight__DelegateSignature");
static_assert(offsetof(ItemIconBtn_C_OnSelectRight__DelegateSignature, SelectItem) == 0x000000, "Member 'ItemIconBtn_C_OnSelectRight__DelegateSignature::SelectItem' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemIconBtn_C_OnPressed__DelegateSignature final
{
public:
	class UItemIconBtn_C*                         SelectItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on ItemIconBtn_C_OnPressed__DelegateSignature");
static_assert(sizeof(ItemIconBtn_C_OnPressed__DelegateSignature) == 0x000008, "Wrong size on ItemIconBtn_C_OnPressed__DelegateSignature");
static_assert(offsetof(ItemIconBtn_C_OnPressed__DelegateSignature, SelectItem) == 0x000000, "Member 'ItemIconBtn_C_OnPressed__DelegateSignature::SelectItem' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.ExecuteUbergraph_ItemIconBtn
// 0x0028 (0x0028 - 0x0000)
struct ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9BB0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonIcon_C*                          K2Node_ComponentBoundEvent_Sender;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BB1[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIcon_C*                          K2Node_ComponentBoundEvent_Sender_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn) == 0x000008, "Wrong alignment on ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn");
static_assert(sizeof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn) == 0x000028, "Wrong size on ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn");
static_assert(offsetof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn, EntryPoint) == 0x000000, "Member 'ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn, K2Node_ComponentBoundEvent_Sender) == 0x000008, "Member 'ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn::K2Node_ComponentBoundEvent_Sender' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn, K2Node_Event_bIsExpanded) == 0x000010, "Member 'ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn, K2Node_Event_bIsSelected) == 0x000011, "Member 'ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn, K2Node_Event_ListItemObject) == 0x000018, "Member 'ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn, K2Node_ComponentBoundEvent_Sender_1) == 0x000020, "Member 'ItemIconBtn_C_ExecuteUbergraph_ItemIconBtn::K2Node_ComponentBoundEvent_Sender_1' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(sizeof(ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature) == 0x000008, "Wrong size on ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature");
static_assert(offsetof(ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature, Sender) == 0x000000, "Member 'ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_2_OnPressed__DelegateSignature::Sender' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	class UCommonIcon_C*                          Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000008, "Wrong size on ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, Sender) == 0x000000, "Member 'ItemIconBtn_C_BndEvt__ItemIconBtn_CommonIcon_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::Sender' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct ItemIconBtn_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on ItemIconBtn_C_OnListItemObjectSet");
static_assert(sizeof(ItemIconBtn_C_OnListItemObjectSet) == 0x000008, "Wrong size on ItemIconBtn_C_OnListItemObjectSet");
static_assert(offsetof(ItemIconBtn_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'ItemIconBtn_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on ItemIconBtn_C_BP_OnItemSelectionChanged");
static_assert(sizeof(ItemIconBtn_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on ItemIconBtn_C_BP_OnItemSelectionChanged");
static_assert(offsetof(ItemIconBtn_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'ItemIconBtn_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on ItemIconBtn_C_BP_OnItemExpansionChanged");
static_assert(sizeof(ItemIconBtn_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on ItemIconBtn_C_BP_OnItemExpansionChanged");
static_assert(offsetof(ItemIconBtn_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'ItemIconBtn_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetItem_InventoryData
// 0x0090 (0x0090 - 0x0000)
struct ItemIconBtn_C_SetItem_InventoryData final
{
public:
	struct FInventoryItemData                     InItemData;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          InUseDetailsTooltip;                               // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiddenLockIcon;                                    // 0x0061(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HiddenAmout;                                       // 0x0062(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUnidentified;                                    // 0x0063(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLimitedTime;                                      // 0x0064(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_Stack_BEffective_Display;                    // 0x0065(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpLimitedTime;                                    // 0x0066(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpIsUseDetailsTooltip;                            // 0x0067(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpIsUnidentified;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpItemLockVisibility;                             // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpIsWeapon;                                       // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BB2[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TmpItemAmount;                                     // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpItemId;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BB3[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemType                                     Temp_byte_Variable;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemLockIconDraw_OutLockFlag;           // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetItem_InventoryData) == 0x000008, "Wrong alignment on ItemIconBtn_C_SetItem_InventoryData");
static_assert(sizeof(ItemIconBtn_C_SetItem_InventoryData) == 0x000090, "Wrong size on ItemIconBtn_C_SetItem_InventoryData");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, InItemData) == 0x000000, "Member 'ItemIconBtn_C_SetItem_InventoryData::InItemData' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, InUseDetailsTooltip) == 0x000060, "Member 'ItemIconBtn_C_SetItem_InventoryData::InUseDetailsTooltip' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, HiddenLockIcon) == 0x000061, "Member 'ItemIconBtn_C_SetItem_InventoryData::HiddenLockIcon' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, HiddenAmout) == 0x000062, "Member 'ItemIconBtn_C_SetItem_InventoryData::HiddenAmout' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, IsUnidentified) == 0x000063, "Member 'ItemIconBtn_C_SetItem_InventoryData::IsUnidentified' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, bLimitedTime) == 0x000064, "Member 'ItemIconBtn_C_SetItem_InventoryData::bLimitedTime' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Param_Stack_BEffective_Display) == 0x000065, "Member 'ItemIconBtn_C_SetItem_InventoryData::Param_Stack_BEffective_Display' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpLimitedTime) == 0x000066, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpLimitedTime' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpIsUseDetailsTooltip) == 0x000067, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpIsUseDetailsTooltip' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpIsUnidentified) == 0x000068, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpIsUnidentified' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpItemLockVisibility) == 0x000069, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpItemLockVisibility' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpIsWeapon) == 0x00006A, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpIsWeapon' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpItemAmount) == 0x00006C, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpItemAmount' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, TmpItemId) == 0x000070, "Member 'ItemIconBtn_C_SetItem_InventoryData::TmpItemId' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable) == 0x000074, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_1) == 0x000075, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_2) == 0x000076, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_3) == 0x000077, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_int_Variable) == 0x000078, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_4) == 0x00007C, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_5) == 0x00007D, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_6) == 0x00007E, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_7) == 0x00007F, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_bool_Variable_8) == 0x000080, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, K2Node_Select_Default) == 0x000084, "Member 'ItemIconBtn_C_SetItem_InventoryData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, CallFunc_Greater_IntInt_ReturnValue) == 0x000088, "Member 'ItemIconBtn_C_SetItem_InventoryData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, Temp_byte_Variable) == 0x000089, "Member 'ItemIconBtn_C_SetItem_InventoryData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, K2Node_Select_Default_1) == 0x00008A, "Member 'ItemIconBtn_C_SetItem_InventoryData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, CallFunc_IsItemLockIconDraw_OutLockFlag) == 0x00008B, "Member 'ItemIconBtn_C_SetItem_InventoryData::CallFunc_IsItemLockIconDraw_OutLockFlag' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_InventoryData, K2Node_SwitchEnum_CmpSuccess) == 0x00008C, "Member 'ItemIconBtn_C_SetItem_InventoryData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetItem_Index
// 0x000C (0x000C - 0x0000)
struct ItemIconBtn_C_SetItem_Index final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InItemAmount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLimitedTime;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetItem_Index) == 0x000004, "Wrong alignment on ItemIconBtn_C_SetItem_Index");
static_assert(sizeof(ItemIconBtn_C_SetItem_Index) == 0x00000C, "Wrong size on ItemIconBtn_C_SetItem_Index");
static_assert(offsetof(ItemIconBtn_C_SetItem_Index, InItemIndex) == 0x000000, "Member 'ItemIconBtn_C_SetItem_Index::InItemIndex' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_Index, InItemAmount) == 0x000004, "Member 'ItemIconBtn_C_SetItem_Index::InItemAmount' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_Index, bLimitedTime) == 0x000008, "Member 'ItemIconBtn_C_SetItem_Index::bLimitedTime' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetItem_Index, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'ItemIconBtn_C_SetItem_Index::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetImagine_Index
// 0x0004 (0x0004 - 0x0000)
struct ItemIconBtn_C_SetImagine_Index final
{
public:
	int32                                         InImagineItemId;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetImagine_Index) == 0x000004, "Wrong alignment on ItemIconBtn_C_SetImagine_Index");
static_assert(sizeof(ItemIconBtn_C_SetImagine_Index) == 0x000004, "Wrong size on ItemIconBtn_C_SetImagine_Index");
static_assert(offsetof(ItemIconBtn_C_SetImagine_Index, InImagineItemId) == 0x000000, "Member 'ItemIconBtn_C_SetImagine_Index::InImagineItemId' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetMountImagine
// 0x0198 (0x0198 - 0x0000)
struct ItemIconBtn_C_SetMountImagine final
{
public:
	struct FInventoryItemData                     Param_InventoryItemData;                           // 0x0000(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BB4[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x0078(0x0118)(ConstParm)
	bool                                          CallFunc_IsItemLock_ReturnValue;                   // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetMountImagine) == 0x000008, "Wrong alignment on ItemIconBtn_C_SetMountImagine");
static_assert(sizeof(ItemIconBtn_C_SetMountImagine) == 0x000198, "Wrong size on ItemIconBtn_C_SetMountImagine");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, Param_InventoryItemData) == 0x000000, "Member 'ItemIconBtn_C_SetMountImagine::Param_InventoryItemData' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, CallFunc_GetStorage_ReturnValue) == 0x000060, "Member 'ItemIconBtn_C_SetMountImagine::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, CallFunc_GetStorage_ReturnValue_1) == 0x000068, "Member 'ItemIconBtn_C_SetMountImagine::CallFunc_GetStorage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x000070, "Member 'ItemIconBtn_C_SetMountImagine::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x000078, "Member 'ItemIconBtn_C_SetMountImagine::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, CallFunc_IsItemLock_ReturnValue) == 0x000190, "Member 'ItemIconBtn_C_SetMountImagine::CallFunc_IsItemLock_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetMountImagine, CallFunc_Greater_IntInt_ReturnValue) == 0x000191, "Member 'ItemIconBtn_C_SetMountImagine::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetWeapon_Index
// 0x0004 (0x0004 - 0x0000)
struct ItemIconBtn_C_SetWeapon_Index final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetWeapon_Index) == 0x000004, "Wrong alignment on ItemIconBtn_C_SetWeapon_Index");
static_assert(sizeof(ItemIconBtn_C_SetWeapon_Index) == 0x000004, "Wrong size on ItemIconBtn_C_SetWeapon_Index");
static_assert(offsetof(ItemIconBtn_C_SetWeapon_Index, InItemIndex) == 0x000000, "Member 'ItemIconBtn_C_SetWeapon_Index::InItemIndex' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.IsIconEmpty
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_IsIconEmpty final
{
public:
	bool                                          Param_Empty;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_IsIconEmpty) == 0x000001, "Wrong alignment on ItemIconBtn_C_IsIconEmpty");
static_assert(sizeof(ItemIconBtn_C_IsIconEmpty) == 0x000001, "Wrong size on ItemIconBtn_C_IsIconEmpty");
static_assert(offsetof(ItemIconBtn_C_IsIconEmpty, Param_Empty) == 0x000000, "Member 'ItemIconBtn_C_IsIconEmpty::Param_Empty' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetIconSelected
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetIconSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetIconSelected) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetIconSelected");
static_assert(sizeof(ItemIconBtn_C_SetIconSelected) == 0x000001, "Wrong size on ItemIconBtn_C_SetIconSelected");
static_assert(offsetof(ItemIconBtn_C_SetIconSelected, IsSelected) == 0x000000, "Member 'ItemIconBtn_C_SetIconSelected::IsSelected' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetDetach
// 0x0009 (0x0009 - 0x0000)
struct ItemIconBtn_C_SetDetach final
{
public:
	bool                                          Param_IsDetach;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetDetach) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetDetach");
static_assert(sizeof(ItemIconBtn_C_SetDetach) == 0x000009, "Wrong size on ItemIconBtn_C_SetDetach");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Param_IsDetach) == 0x000000, "Member 'ItemIconBtn_C_SetDetach::Param_IsDetach' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Temp_bool_Variable) == 0x000001, "Member 'ItemIconBtn_C_SetDetach::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Temp_byte_Variable) == 0x000002, "Member 'ItemIconBtn_C_SetDetach::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Temp_byte_Variable_1) == 0x000003, "Member 'ItemIconBtn_C_SetDetach::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Temp_bool_Variable_1) == 0x000004, "Member 'ItemIconBtn_C_SetDetach::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, K2Node_Select_Default) == 0x000005, "Member 'ItemIconBtn_C_SetDetach::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Temp_byte_Variable_2) == 0x000006, "Member 'ItemIconBtn_C_SetDetach::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, Temp_byte_Variable_3) == 0x000007, "Member 'ItemIconBtn_C_SetDetach::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetDetach, K2Node_Select_Default_1) == 0x000008, "Member 'ItemIconBtn_C_SetDetach::K2Node_Select_Default_1' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetIconBlank
// 0x0005 (0x0005 - 0x0000)
struct ItemIconBtn_C_SetIconBlank final
{
public:
	bool                                          IsBlank;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetIconBlank) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetIconBlank");
static_assert(sizeof(ItemIconBtn_C_SetIconBlank) == 0x000005, "Wrong size on ItemIconBtn_C_SetIconBlank");
static_assert(offsetof(ItemIconBtn_C_SetIconBlank, IsBlank) == 0x000000, "Member 'ItemIconBtn_C_SetIconBlank::IsBlank' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIconBlank, Temp_bool_Variable) == 0x000001, "Member 'ItemIconBtn_C_SetIconBlank::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIconBlank, Temp_byte_Variable) == 0x000002, "Member 'ItemIconBtn_C_SetIconBlank::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIconBlank, Temp_byte_Variable_1) == 0x000003, "Member 'ItemIconBtn_C_SetIconBlank::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIconBlank, K2Node_Select_Default) == 0x000004, "Member 'ItemIconBtn_C_SetIconBlank::K2Node_Select_Default' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.Set Enable
// 0x0009 (0x0009 - 0x0000)
struct ItemIconBtn_C_Set_Enable final
{
public:
	bool                                          Param_bIsEnabled;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_Set_Enable) == 0x000001, "Wrong alignment on ItemIconBtn_C_Set_Enable");
static_assert(sizeof(ItemIconBtn_C_Set_Enable) == 0x000009, "Wrong size on ItemIconBtn_C_Set_Enable");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Param_bIsEnabled) == 0x000000, "Member 'ItemIconBtn_C_Set_Enable::Param_bIsEnabled' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Temp_bool_Variable) == 0x000001, "Member 'ItemIconBtn_C_Set_Enable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Temp_byte_Variable) == 0x000002, "Member 'ItemIconBtn_C_Set_Enable::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Temp_byte_Variable_1) == 0x000003, "Member 'ItemIconBtn_C_Set_Enable::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Temp_bool_Variable_1) == 0x000004, "Member 'ItemIconBtn_C_Set_Enable::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, K2Node_Select_Default) == 0x000005, "Member 'ItemIconBtn_C_Set_Enable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Temp_byte_Variable_2) == 0x000006, "Member 'ItemIconBtn_C_Set_Enable::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, Temp_byte_Variable_3) == 0x000007, "Member 'ItemIconBtn_C_Set_Enable::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_Set_Enable, K2Node_Select_Default_1) == 0x000008, "Member 'ItemIconBtn_C_Set_Enable::K2Node_Select_Default_1' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetTooltipEnable
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetTooltipEnable final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetTooltipEnable) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetTooltipEnable");
static_assert(sizeof(ItemIconBtn_C_SetTooltipEnable) == 0x000001, "Wrong size on ItemIconBtn_C_SetTooltipEnable");
static_assert(offsetof(ItemIconBtn_C_SetTooltipEnable, bEnable) == 0x000000, "Member 'ItemIconBtn_C_SetTooltipEnable::bEnable' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetIsButtonActive
// 0x0005 (0x0005 - 0x0000)
struct ItemIconBtn_C_SetIsButtonActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetIsButtonActive) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetIsButtonActive");
static_assert(sizeof(ItemIconBtn_C_SetIsButtonActive) == 0x000005, "Wrong size on ItemIconBtn_C_SetIsButtonActive");
static_assert(offsetof(ItemIconBtn_C_SetIsButtonActive, IsActive) == 0x000000, "Member 'ItemIconBtn_C_SetIsButtonActive::IsActive' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIsButtonActive, Temp_bool_Variable) == 0x000001, "Member 'ItemIconBtn_C_SetIsButtonActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIsButtonActive, Temp_byte_Variable) == 0x000002, "Member 'ItemIconBtn_C_SetIsButtonActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIsButtonActive, Temp_byte_Variable_1) == 0x000003, "Member 'ItemIconBtn_C_SetIsButtonActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetIsButtonActive, K2Node_Select_Default) == 0x000004, "Member 'ItemIconBtn_C_SetIsButtonActive::K2Node_Select_Default' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetPressedSoundId
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetPressedSoundId final
{
public:
	ESystemSE                                     InSoundId;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetPressedSoundId) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetPressedSoundId");
static_assert(sizeof(ItemIconBtn_C_SetPressedSoundId) == 0x000001, "Wrong size on ItemIconBtn_C_SetPressedSoundId");
static_assert(offsetof(ItemIconBtn_C_SetPressedSoundId, InSoundId) == 0x000000, "Member 'ItemIconBtn_C_SetPressedSoundId::InSoundId' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetHoveredSoundId
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetHoveredSoundId final
{
public:
	ESystemSE                                     InSoundId;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetHoveredSoundId) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetHoveredSoundId");
static_assert(sizeof(ItemIconBtn_C_SetHoveredSoundId) == 0x000001, "Wrong size on ItemIconBtn_C_SetHoveredSoundId");
static_assert(offsetof(ItemIconBtn_C_SetHoveredSoundId, InSoundId) == 0x000000, "Member 'ItemIconBtn_C_SetHoveredSoundId::InSoundId' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetHoveredColor
// 0x0010 (0x0010 - 0x0000)
struct ItemIconBtn_C_SetHoveredColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetHoveredColor) == 0x000004, "Wrong alignment on ItemIconBtn_C_SetHoveredColor");
static_assert(sizeof(ItemIconBtn_C_SetHoveredColor) == 0x000010, "Wrong size on ItemIconBtn_C_SetHoveredColor");
static_assert(offsetof(ItemIconBtn_C_SetHoveredColor, Color) == 0x000000, "Member 'ItemIconBtn_C_SetHoveredColor::Color' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.OnDragDetected
// 0x00B8 (0x00B8 - 0x0000)
struct ItemIconBtn_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UShortcutDragDropOperation_C*           CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_OnDragDetected) == 0x000008, "Wrong alignment on ItemIconBtn_C_OnDragDetected");
static_assert(sizeof(ItemIconBtn_C_OnDragDetected) == 0x0000B8, "Wrong size on ItemIconBtn_C_OnDragDetected");
static_assert(offsetof(ItemIconBtn_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'ItemIconBtn_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'ItemIconBtn_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnDragDetected, Operation) == 0x0000A8, "Member 'ItemIconBtn_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'ItemIconBtn_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.OnPreviewMouseButtonDown
// 0x0448 (0x0448 - 0x0000)
struct ItemIconBtn_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0218(0x00B8)()
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue_1;        // 0x02D0(0x00B8)()
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue_1; // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BB5[0x5];                                     // 0x038B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0390(0x00B8)()
};
static_assert(alignof(ItemIconBtn_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on ItemIconBtn_C_OnPreviewMouseButtonDown");
static_assert(sizeof(ItemIconBtn_C_OnPreviewMouseButtonDown) == 0x000448, "Wrong size on ItemIconBtn_C_OnPreviewMouseButtonDown");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000218, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue_1) == 0x0002D0, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000388, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue_1) == 0x000389, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_BooleanAND_ReturnValue) == 0x00038A, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000390, "Member 'ItemIconBtn_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetDragable
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetDragable final
{
public:
	bool                                          InDragable;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetDragable) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetDragable");
static_assert(sizeof(ItemIconBtn_C_SetDragable) == 0x000001, "Wrong size on ItemIconBtn_C_SetDragable");
static_assert(offsetof(ItemIconBtn_C_SetDragable, InDragable) == 0x000000, "Member 'ItemIconBtn_C_SetDragable::InDragable' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetEquipIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetEquipIconVisibility final
{
public:
	bool                                          InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetEquipIconVisibility) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetEquipIconVisibility");
static_assert(sizeof(ItemIconBtn_C_SetEquipIconVisibility) == 0x000001, "Wrong size on ItemIconBtn_C_SetEquipIconVisibility");
static_assert(offsetof(ItemIconBtn_C_SetEquipIconVisibility, InVisibility) == 0x000000, "Member 'ItemIconBtn_C_SetEquipIconVisibility::InVisibility' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.GetEquipIconVisibility
// 0x0003 (0x0003 - 0x0000)
struct ItemIconBtn_C_GetEquipIconVisibility final
{
public:
	bool                                          OutIsEquipIconVisible;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_GetEquipIconVisibility) == 0x000001, "Wrong alignment on ItemIconBtn_C_GetEquipIconVisibility");
static_assert(sizeof(ItemIconBtn_C_GetEquipIconVisibility) == 0x000003, "Wrong size on ItemIconBtn_C_GetEquipIconVisibility");
static_assert(offsetof(ItemIconBtn_C_GetEquipIconVisibility, OutIsEquipIconVisible) == 0x000000, "Member 'ItemIconBtn_C_GetEquipIconVisibility::OutIsEquipIconVisible' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_GetEquipIconVisibility, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'ItemIconBtn_C_GetEquipIconVisibility::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_GetEquipIconVisibility, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'ItemIconBtn_C_GetEquipIconVisibility::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetRarity
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetRarity final
{
public:
	ESBRarity                                     InRarity;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetRarity) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetRarity");
static_assert(sizeof(ItemIconBtn_C_SetRarity) == 0x000001, "Wrong size on ItemIconBtn_C_SetRarity");
static_assert(offsetof(ItemIconBtn_C_SetRarity, InRarity) == 0x000000, "Member 'ItemIconBtn_C_SetRarity::InRarity' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetImagineSimpleTooltip
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetImagineSimpleTooltip final
{
public:
	bool                                          IsImagineSimpleTooltip;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetImagineSimpleTooltip) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetImagineSimpleTooltip");
static_assert(sizeof(ItemIconBtn_C_SetImagineSimpleTooltip) == 0x000001, "Wrong size on ItemIconBtn_C_SetImagineSimpleTooltip");
static_assert(offsetof(ItemIconBtn_C_SetImagineSimpleTooltip, IsImagineSimpleTooltip) == 0x000000, "Member 'ItemIconBtn_C_SetImagineSimpleTooltip::IsImagineSimpleTooltip' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetRightClickAccept
// 0x0001 (0x0001 - 0x0000)
struct ItemIconBtn_C_SetRightClickAccept final
{
public:
	bool                                          Param_bIsRightClickAccept;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemIconBtn_C_SetRightClickAccept) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetRightClickAccept");
static_assert(sizeof(ItemIconBtn_C_SetRightClickAccept) == 0x000001, "Wrong size on ItemIconBtn_C_SetRightClickAccept");
static_assert(offsetof(ItemIconBtn_C_SetRightClickAccept, Param_bIsRightClickAccept) == 0x000000, "Member 'ItemIconBtn_C_SetRightClickAccept::Param_bIsRightClickAccept' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.AnimInOutPlay
// 0x0018 (0x0018 - 0x0000)
struct ItemIconBtn_C_AnimInOutPlay final
{
public:
	bool                                          bInAnim;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9BB6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_AnimInOutPlay) == 0x000008, "Wrong alignment on ItemIconBtn_C_AnimInOutPlay");
static_assert(sizeof(ItemIconBtn_C_AnimInOutPlay) == 0x000018, "Wrong size on ItemIconBtn_C_AnimInOutPlay");
static_assert(offsetof(ItemIconBtn_C_AnimInOutPlay, bInAnim) == 0x000000, "Member 'ItemIconBtn_C_AnimInOutPlay::bInAnim' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_AnimInOutPlay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'ItemIconBtn_C_AnimInOutPlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_AnimInOutPlay, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'ItemIconBtn_C_AnimInOutPlay::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function ItemIconBtn.ItemIconBtn_C.SetGrayMode
// 0x0005 (0x0005 - 0x0000)
struct ItemIconBtn_C_SetGrayMode final
{
public:
	bool                                          Param_bIsEnabled;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemIconBtn_C_SetGrayMode) == 0x000001, "Wrong alignment on ItemIconBtn_C_SetGrayMode");
static_assert(sizeof(ItemIconBtn_C_SetGrayMode) == 0x000005, "Wrong size on ItemIconBtn_C_SetGrayMode");
static_assert(offsetof(ItemIconBtn_C_SetGrayMode, Param_bIsEnabled) == 0x000000, "Member 'ItemIconBtn_C_SetGrayMode::Param_bIsEnabled' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetGrayMode, Temp_bool_Variable) == 0x000001, "Member 'ItemIconBtn_C_SetGrayMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetGrayMode, Temp_byte_Variable) == 0x000002, "Member 'ItemIconBtn_C_SetGrayMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemIconBtn_C_SetGrayMode, Temp_byte_Variable_1) == 0x000003, "Member 'ItemIconBtn_C_SetGrayMode::Temp_byte_Variable_1' has a wrong offset!");
