#pragma once

 

// Package: KeyConfig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Config_KeyconfigItems_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "KeyAssignSet_structs.hpp"
#include "SlateCore_structs.hpp"
#include "KeyConfigType_structs.hpp"
#include "InputCore_structs.hpp"
#include "KeyConfigItemName_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function KeyConfig.KeyConfig_C.ExecuteUbergraph_KeyConfig
// 0x0DA0 (0x0DA0 - 0x0000)
struct KeyConfig_C_ExecuteUbergraph_KeyConfig final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	ESBMoveInputCommandInterval                   Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBMoveInputCommandInterval                   Temp_byte_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBMoveInputCommandInterval                   Temp_byte_Variable_2;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USBPlayerManager*                       CallFunc_GetPlayerManager_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BD5[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	class USBPlayerManager*                       CallFunc_GetPlayerManager_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNoAssignedTextId_TextId;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD6[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	bool                                          CallFunc_IsClassKeyConfigCustomized_ReturnValue;   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD7[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	class UKeyConfig_Slider_C*                    K2Node_CustomEvent_Target_1;                       // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GenerateComboBox_LastRet1;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  K2Node_CustomEvent_NextClass;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_Map_Find_Value;                           // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD8[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerManager*                       CallFunc_GetPlayerManager_ReturnValue_2;           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBPlayerClassKeyConfigData            CallFunc_GetClassCommonKeyConfig_ReturnValue;      // 0x0140(0x01C8)()
	bool                                          CallFunc_IsClassKeyConfigCustomized_ReturnValue_1; // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD9[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBPlayerClassKeyConfigData            CallFunc_GetClassKeyConfig_ReturnValue;            // 0x0310(0x01C8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EConfig_KeyconfigItems                        K2Node_CustomEvent_KeyType_1;                      // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BDA[0x6];                                     // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_DownKey_1;                      // 0x04E0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsFunction3Key_ReturnValue;               // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BDB[0x7];                                     // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0500(0x0018)()
	bool                                          CallFunc_IsFunction2Key_ReturnValue;               // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFunctionKey_ReturnValue;                // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBKeyConfigGamepadKey                        CallFunc_PadToKeyConfigKey_ReturnValue;            // 0x051A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x051B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x051D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x051E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EConfig_KeyconfigItems                        K2Node_CustomEvent_KeyType;                        // 0x051F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BDC[0x5];                                     // 0x0523(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_DownKey;                        // 0x0528(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBKeyConfigMouseKey                          CallFunc_MouseToKeyConfigKey_ReturnValue;          // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBKeyConfigKeyboardKey                       CallFunc_KeyToKeyConfigKey_ReturnValue;            // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnassignableMouseKey_IsUnassighnableKey; // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsMouseButton_ReturnValue;            // 0x0546(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue;            // 0x0547(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_4;                       // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnassignableKeyboardKey_IsUnassighnableKey; // 0x054B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x054D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bLock;                          // 0x054E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BDD[0x1];                                     // 0x054F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetChangedTop_Target;                     // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetChangedTop_bChanged;                   // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BDE[0x6];                                     // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0568(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0578(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_3;                       // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BDF[0x1];                                     // 0x0593(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0594(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5BE0[0x4];                                     // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerManager*                       CallFunc_GetPlayerManager_ReturnValue_3;           // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE1[0x3];                                     // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InTextId;                       // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasNone_bHasNone;                         // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE2[0x7];                                     // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x05C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x05D0(0x0018)()
	EDialogResult                                 K2Node_CustomEvent_Result_2;                       // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE3[0x2];                                     // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_2;            // 0x05EC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x05FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x05FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE4[0x6];                                     // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChanged_bChanged;                       // 0x061A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x061B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_Value;                          // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Ratio;                          // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConfig_KeyconfigItems                        K2Node_CustomEvent_Type_1;                         // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BE5[0x3];                                     // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_Slider_C*                    K2Node_CustomEvent_Target;                         // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE6[0x3];                                     // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGamePadCameraSpeedRatePitch_OutValue;  // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGamePadCameraSpeedRateYaw_OutValue;    // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConfig_KeyconfigItems                        K2Node_CustomEvent_Type;                           // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0645(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0646(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMoveInputCommandInterval                   K2Node_Select_Default_2;                           // 0x0647(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE7[0x3];                                     // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x0650(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0660(0x0018)()
	bool                                          CallFunc_ContainsNoAssignedKey_Assigned;           // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_Map_Find_Value_1;                         // 0x0679(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x067A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x067B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BE8[0x4];                                     // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue;                       // 0x0680(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BE9[0x7];                                     // 0x0689(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_5;           // 0x0690(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BEA[0x7];                                     // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x06A8(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BEB[0x7];                                     // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_6;           // 0x06C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x06D8(0x0018)()
	TDelegate<void(int32 Index, EConfig_KeyconfigItems Type)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x06F0(0x0010)(ZeroConstructor, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_1;                       // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BEC[0x7];                                     // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_7;           // 0x0708(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BED[0x7];                                     // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0720(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BEE[0x3];                                     // 0x0739(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Value, float Ratio, EConfig_KeyconfigItems Type, class UKeyConfig_Slider_C* Target)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x073C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5BEF[0x4];                                     // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_8;           // 0x0750(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0760(0x0018)()
	bool                                          Temp_bool_Variable_6;                              // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF0[0x7];                                     // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverKeyInput_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0780(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBPlayerClassKeyConfigData            K2Node_Select_Default_3;                           // 0x0788(0x01C8)()
	struct FSBPlayerClassKeyConfigData            K2Node_Select_Default_4;                           // 0x0950(0x01C8)()
	class UOverKeyInput_C*                        CallFunc_Create_ReturnValue_2;                     // 0x0B18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverKeyInput_C*                        CallFunc_Create_ReturnValue_3;                     // 0x0B20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_5;            // 0x0B28(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_4;                     // 0x0B38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_6;            // 0x0B40(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_5;                     // 0x0B50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BF1[0x7];                                     // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0B60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0B68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF2[0x7];                                     // 0x0B69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerControllerBase*                K2Node_DynamicCast_AsSBPlayer_Controller_Base;     // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF3[0x7];                                     // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerControllerBase*                K2Node_DynamicCast_AsSBPlayer_Controller_Base_1;   // 0x0B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0B88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0B89(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0B8A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0B8B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_7;            // 0x0B8C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5BF4[0x4];                                     // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0BA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnableKey;                    // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF5[0x7];                                     // 0x0BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerControllerBase*                K2Node_DynamicCast_AsSBPlayer_Controller_Base_2;   // 0x0BB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Request_SaveKeyConfig_ReturnValue;        // 0x0BB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF6[0x6];                                     // 0x0BBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          K2Node_Select_Default_6;                           // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnassignablePadKey_IsUnassighnableKey;  // 0x0BCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF7[0x3];                                     // 0x0BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x0BD0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF8[0x7];                                     // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_9;           // 0x0BF0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x0C00(0x0018)()
	bool                                          CallFunc_ContainsNoAssignedKey_Assigned_1;         // 0x0C18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0C19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BF9[0x6];                                     // 0x0C1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_6;                     // 0x0C20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& DownKey)>   K2Node_CreateDelegate_OutputDelegate_8;            // 0x0C28(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BFA[0x3];                                     // 0x0C39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EConfig_KeyconfigItems KeyType)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0C3C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDispNoneDialog_IsNeedNoneDisp;          // 0x0C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BFB[0x3];                                     // 0x0C4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetKeyConfigSliderMinMax_Min;             // 0x0C50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetKeyConfigSliderMinMax_Max;             // 0x0C54(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetKeyConfigPersentageBias_ReturnValue;   // 0x0C58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetKeyConfigMouseBias_ReturnValue;        // 0x0C5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0C60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0C64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0C6C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0C74(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FKey& DownKey)>   K2Node_CreateDelegate_OutputDelegate_10;           // 0x0C78(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDispNoneDialog_IsNeedNoneDisp_1;        // 0x0C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BFC[0x3];                                     // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_7;                     // 0x0C90(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EConfig_KeyconfigItems KeyType)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0C98(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0CA8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BFD[0x7];                                     // 0x0CB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0CC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BFE[0x7];                                     // 0x0CC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerControllerBase*                K2Node_DynamicCast_AsSBPlayer_Controller_Base_3;   // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Request_SaveKeyConfig_ReturnValue_1;      // 0x0CD9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BFF[0x2];                                     // 0x0CDA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetKeyConfigMouseFixedValue_ReturnValue;  // 0x0CDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0CE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C00[0x3];                                     // 0x0CE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0CE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidKeyConfigWarnMsg_ReturnValue;        // 0x0CE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C01[0x7];                                     // 0x0CE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_10;          // 0x0CF0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x0D00(0x0018)()
	bool                                          CallFunc_IsWarningKey_bIsWarning;                  // 0x0D18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C02[0x7];                                     // 0x0D19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_IsWarningKey_WarningText;                 // 0x0D20(0x0018)()
	bool                                          Temp_bool_Variable_10;                             // 0x0D38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C03[0x7];                                     // 0x0D39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_7;                           // 0x0D40(0x0018)()
	bool                                          K2Node_Select_Default_8;                           // 0x0D58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C04[0x7];                                     // 0x0D59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_InKey;                          // 0x0D60(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_ValidKeyConfigWarnMsg_ReturnValue_1;      // 0x0D78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWarningKey_bIsWarning_1;                // 0x0D79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C05[0x6];                                     // 0x0D7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_IsWarningKey_WarningText_1;               // 0x0D80(0x0018)()
	bool                                          Temp_bool_Variable_11;                             // 0x0D98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_9;                           // 0x0D99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyConfig_C_ExecuteUbergraph_KeyConfig) == 0x000008, "Wrong alignment on KeyConfig_C_ExecuteUbergraph_KeyConfig");
static_assert(sizeof(KeyConfig_C_ExecuteUbergraph_KeyConfig) == 0x000DA0, "Wrong size on KeyConfig_C_ExecuteUbergraph_KeyConfig");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, EntryPoint) == 0x000000, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::EntryPoint' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_bool_Variable) == 0x000004, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_int_Variable) == 0x000008, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_byte_Variable) == 0x00001C, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_byte_Variable_1) == 0x00001D, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_byte_Variable_2) == 0x00001E, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_bool_Variable_1) == 0x00001F, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetPlayerManager_ReturnValue) == 0x000020, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetPlayerManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_byte_Variable_3) == 0x000028, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetTextFromAsset_ReturnValue) == 0x000030, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetPlayerManager_ReturnValue_1) == 0x000058, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetPlayerManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetNoAssignedTextId_TextId) == 0x000060, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetNoAssignedTextId_TextId' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000064, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000068, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsClassKeyConfigCustomized_ReturnValue) == 0x000090, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsClassKeyConfigCustomized_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_object_Variable) == 0x0000D8, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_MakeArray_Array) == 0x0000E0, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_Target_1) == 0x000108, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GenerateComboBox_LastRet1) == 0x000110, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GenerateComboBox_LastRet1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_SelectedItem) == 0x000120, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_SelectionType) == 0x000130, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_NextClass) == 0x000131, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_NextClass' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Map_Find_Value) == 0x000132, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Map_Find_ReturnValue) == 0x000133, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetPlayerManager_ReturnValue_2) == 0x000138, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetPlayerManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetClassCommonKeyConfig_ReturnValue) == 0x000140, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetClassCommonKeyConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsClassKeyConfigCustomized_ReturnValue_1) == 0x000308, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsClassKeyConfigCustomized_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetClassKeyConfig_ReturnValue) == 0x000310, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetClassKeyConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsValid_ReturnValue) == 0x0004D8, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_KeyType_1) == 0x0004D9, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_KeyType_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_DownKey_1) == 0x0004E0, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_DownKey_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsFunction3Key_ReturnValue) == 0x0004F8, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsFunction3Key_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000500, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsFunction2Key_ReturnValue) == 0x000518, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsFunction2Key_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsFunctionKey_ReturnValue) == 0x000519, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsFunctionKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_PadToKeyConfigKey_ReturnValue) == 0x00051A, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_PadToKeyConfigKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x00051B, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_BooleanOR_ReturnValue) == 0x00051C, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_BooleanOR_ReturnValue_1) == 0x00051D, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_BooleanOR_ReturnValue_2) == 0x00051E, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_KeyType) == 0x00051F, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_KeyType' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000520, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000521, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_BooleanOR_ReturnValue_3) == 0x000522, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_DownKey) == 0x000528, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_DownKey' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsValid_ReturnValue_1) == 0x000540, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_MouseToKeyConfigKey_ReturnValue) == 0x000541, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_MouseToKeyConfigKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_KeyToKeyConfigKey_ReturnValue) == 0x000542, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_KeyToKeyConfigKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsUnassignableMouseKey_IsUnassighnableKey) == 0x000543, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsUnassignableMouseKey_IsUnassighnableKey' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000544, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Not_PreBool_ReturnValue) == 0x000545, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Key_IsMouseButton_ReturnValue) == 0x000546, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Key_IsMouseButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Key_IsKeyboardKey_ReturnValue) == 0x000547, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Key_IsKeyboardKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_BooleanOR_ReturnValue_4) == 0x000548, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_BooleanOR_ReturnValue_5) == 0x000549, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_Result_4) == 0x00054A, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_Result_4' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_IsUnassignableKeyboardKey_IsUnassighnableKey) == 0x00054B, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_IsUnassignableKeyboardKey_IsUnassighnableKey' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00054C, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Not_PreBool_ReturnValue_1) == 0x00054D, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, K2Node_CustomEvent_bLock) == 0x00054E, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::K2Node_CustomEvent_bLock' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_object_Variable_1) == 0x000550, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetChangedTop_Target) == 0x000558, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetChangedTop_Target' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetChangedTop_bChanged) == 0x000560, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetChangedTop_bChanged' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_byte_Variable_4) == 0x000561, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x000568, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000578, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_C_ExecuteUbergraph_KeyConfig, Temp_bool_Variable_2) == 0x000590, "Member 'KeyConfig_C_ExecuteUbergraph_KeyConfig::Temp_bool_Variable_2' has a wrong offset!");
