#pragma once

 

// Package: KeyConfig_List

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Config_KeyconfigItems_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "Config_KeyConfigItemType_structs.hpp"
#include "KeyConfigType_structs.hpp"
#include "KeyAssignSet_structs.hpp"


namespace SDK::Params
{

// Function KeyConfig_List.KeyConfig_List_C.ResetSliderChanged
// 0x0020 (0x0020 - 0x0000)
struct KeyConfig_List_C_ResetSliderChanged final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKeyConfig_Slider_C*                    CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyConfig_List_C_ResetSliderChanged) == 0x000008, "Wrong alignment on KeyConfig_List_C_ResetSliderChanged");
static_assert(sizeof(KeyConfig_List_C_ResetSliderChanged) == 0x000020, "Wrong size on KeyConfig_List_C_ResetSliderChanged");
static_assert(offsetof(KeyConfig_List_C_ResetSliderChanged, Temp_int_Array_Index_Variable) == 0x000000, "Member 'KeyConfig_List_C_ResetSliderChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetSliderChanged, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'KeyConfig_List_C_ResetSliderChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetSliderChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'KeyConfig_List_C_ResetSliderChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetSliderChanged, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'KeyConfig_List_C_ResetSliderChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetSliderChanged, CallFunc_Array_Get_Item) == 0x000010, "Member 'KeyConfig_List_C_ResetSliderChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetSliderChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'KeyConfig_List_C_ResetSliderChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.UpdateData
// 0x0030 (0x0030 - 0x0000)
struct KeyConfig_List_C_UpdateData final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C59[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5A[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_ConfigSlot_C*                K2Node_DynamicCast_AsKey_Config_Config_Slot;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyConfig_List_C_UpdateData) == 0x000008, "Wrong alignment on KeyConfig_List_C_UpdateData");
static_assert(sizeof(KeyConfig_List_C_UpdateData) == 0x000030, "Wrong size on KeyConfig_List_C_UpdateData");
static_assert(offsetof(KeyConfig_List_C_UpdateData, Temp_int_Array_Index_Variable) == 0x000000, "Member 'KeyConfig_List_C_UpdateData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'KeyConfig_List_C_UpdateData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'KeyConfig_List_C_UpdateData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, CallFunc_Array_Get_Item) == 0x000010, "Member 'KeyConfig_List_C_UpdateData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'KeyConfig_List_C_UpdateData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, K2Node_DynamicCast_AsKey_Config_Config_Slot) == 0x000020, "Member 'KeyConfig_List_C_UpdateData::K2Node_DynamicCast_AsKey_Config_Config_Slot' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'KeyConfig_List_C_UpdateData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_UpdateData, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'KeyConfig_List_C_UpdateData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.CalcTop
// 0x0040 (0x0040 - 0x0000)
struct KeyConfig_List_C_CalcTop final
{
public:
	int32                                         Limit;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Top;                                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pos;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5B[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5C[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_CalcTop) == 0x000008, "Wrong alignment on KeyConfig_List_C_CalcTop");
static_assert(sizeof(KeyConfig_List_C_CalcTop) == 0x000040, "Wrong size on KeyConfig_List_C_CalcTop");
static_assert(offsetof(KeyConfig_List_C_CalcTop, Limit) == 0x000000, "Member 'KeyConfig_List_C_CalcTop::Limit' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, Top) == 0x000004, "Member 'KeyConfig_List_C_CalcTop::Top' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, Pos) == 0x000008, "Member 'KeyConfig_List_C_CalcTop::Pos' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, Temp_int_Variable) == 0x00000C, "Member 'KeyConfig_List_C_CalcTop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'KeyConfig_List_C_CalcTop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'KeyConfig_List_C_CalcTop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'KeyConfig_List_C_CalcTop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00001C, "Member 'KeyConfig_List_C_CalcTop::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_Array_Get_Item) == 0x000020, "Member 'KeyConfig_List_C_CalcTop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_GetDesiredSize_ReturnValue) == 0x000028, "Member 'KeyConfig_List_C_CalcTop::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_BreakVector2D_X) == 0x000030, "Member 'KeyConfig_List_C_CalcTop::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_BreakVector2D_Y) == 0x000034, "Member 'KeyConfig_List_C_CalcTop::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CalcTop, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'KeyConfig_List_C_CalcTop::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ResetInputModes
// 0x0030 (0x0030 - 0x0000)
struct KeyConfig_List_C_ResetInputModes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5D[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_ConfigSlot_C*                K2Node_DynamicCast_AsKey_Config_Config_Slot;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyConfig_List_C_ResetInputModes) == 0x000008, "Wrong alignment on KeyConfig_List_C_ResetInputModes");
static_assert(sizeof(KeyConfig_List_C_ResetInputModes) == 0x000030, "Wrong size on KeyConfig_List_C_ResetInputModes");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'KeyConfig_List_C_ResetInputModes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'KeyConfig_List_C_ResetInputModes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'KeyConfig_List_C_ResetInputModes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'KeyConfig_List_C_ResetInputModes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, CallFunc_Array_Get_Item) == 0x000010, "Member 'KeyConfig_List_C_ResetInputModes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'KeyConfig_List_C_ResetInputModes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, K2Node_DynamicCast_AsKey_Config_Config_Slot) == 0x000020, "Member 'KeyConfig_List_C_ResetInputModes::K2Node_DynamicCast_AsKey_Config_Config_Slot' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ResetInputModes, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'KeyConfig_List_C_ResetInputModes::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.GetNoneTop
// 0x0038 (0x0038 - 0x0000)
struct KeyConfig_List_C_GetNoneTop final
{
public:
	class UKeyConfig_ConfigSlot_C*                AsKey_Config_Config_Slot;                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChanged;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C5F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C60[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_ConfigSlot_C*                K2Node_DynamicCast_AsKey_Config_Config_Slot;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C61[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_GetNoneTop) == 0x000008, "Wrong alignment on KeyConfig_List_C_GetNoneTop");
static_assert(sizeof(KeyConfig_List_C_GetNoneTop) == 0x000038, "Wrong size on KeyConfig_List_C_GetNoneTop");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, AsKey_Config_Config_Slot) == 0x000000, "Member 'KeyConfig_List_C_GetNoneTop::AsKey_Config_Config_Slot' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, bChanged) == 0x000008, "Member 'KeyConfig_List_C_GetNoneTop::bChanged' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, Temp_int_Variable) == 0x00000C, "Member 'KeyConfig_List_C_GetNoneTop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'KeyConfig_List_C_GetNoneTop::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'KeyConfig_List_C_GetNoneTop::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'KeyConfig_List_C_GetNoneTop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, K2Node_DynamicCast_AsKey_Config_Config_Slot) == 0x000028, "Member 'KeyConfig_List_C_GetNoneTop::K2Node_DynamicCast_AsKey_Config_Config_Slot' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'KeyConfig_List_C_GetNoneTop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'KeyConfig_List_C_GetNoneTop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetNoneTop, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'KeyConfig_List_C_GetNoneTop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.HasNone
// 0x0060 (0x0060 - 0x0000)
struct KeyConfig_List_C_HasNone final
{
public:
	bool                                          bHasNone;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C62[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKeyConfigType                         CallFunc_Array_Get_Item;                           // 0x0010(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C63[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKeyConfig_ConfigSlot_C*                K2Node_DynamicCast_AsKey_Config_Config_Slot;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C64[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_HasNone) == 0x000008, "Wrong alignment on KeyConfig_List_C_HasNone");
static_assert(sizeof(KeyConfig_List_C_HasNone) == 0x000060, "Wrong size on KeyConfig_List_C_HasNone");
static_assert(offsetof(KeyConfig_List_C_HasNone, bHasNone) == 0x000000, "Member 'KeyConfig_List_C_HasNone::bHasNone' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, Temp_int_Array_Index_Variable) == 0x000004, "Member 'KeyConfig_List_C_HasNone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'KeyConfig_List_C_HasNone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'KeyConfig_List_C_HasNone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_Array_Get_Item) == 0x000010, "Member 'KeyConfig_List_C_HasNone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'KeyConfig_List_C_HasNone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'KeyConfig_List_C_HasNone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000035, "Member 'KeyConfig_List_C_HasNone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'KeyConfig_List_C_HasNone::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, K2Node_DynamicCast_AsKey_Config_Config_Slot) == 0x000040, "Member 'KeyConfig_List_C_HasNone::K2Node_DynamicCast_AsKey_Config_Config_Slot' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'KeyConfig_List_C_HasNone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_HasNone, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000050, "Member 'KeyConfig_List_C_HasNone::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.GetChangedTop
// 0x0058 (0x0058 - 0x0000)
struct KeyConfig_List_C_GetChangedTop final
{
public:
	class UUserWidget*                            Target;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChanged;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C65[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C66[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C67[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_Radio_C*                     K2Node_DynamicCast_AsKey_Config_Radio;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C68[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_Slider_C*                    K2Node_DynamicCast_AsKey_Config_Slider;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C69[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_ConfigSlot_C*                K2Node_DynamicCast_AsKey_Config_Config_Slot;       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C6A[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_GetChangedTop) == 0x000008, "Wrong alignment on KeyConfig_List_C_GetChangedTop");
static_assert(sizeof(KeyConfig_List_C_GetChangedTop) == 0x000058, "Wrong size on KeyConfig_List_C_GetChangedTop");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, Target) == 0x000000, "Member 'KeyConfig_List_C_GetChangedTop::Target' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, bChanged) == 0x000008, "Member 'KeyConfig_List_C_GetChangedTop::bChanged' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, Temp_int_Variable) == 0x00000C, "Member 'KeyConfig_List_C_GetChangedTop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'KeyConfig_List_C_GetChangedTop::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'KeyConfig_List_C_GetChangedTop::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'KeyConfig_List_C_GetChangedTop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, K2Node_DynamicCast_AsKey_Config_Radio) == 0x000028, "Member 'KeyConfig_List_C_GetChangedTop::K2Node_DynamicCast_AsKey_Config_Radio' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'KeyConfig_List_C_GetChangedTop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'KeyConfig_List_C_GetChangedTop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, K2Node_DynamicCast_AsKey_Config_Slider) == 0x000038, "Member 'KeyConfig_List_C_GetChangedTop::K2Node_DynamicCast_AsKey_Config_Slider' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'KeyConfig_List_C_GetChangedTop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, K2Node_DynamicCast_AsKey_Config_Config_Slot) == 0x000048, "Member 'KeyConfig_List_C_GetChangedTop::K2Node_DynamicCast_AsKey_Config_Config_Slot' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'KeyConfig_List_C_GetChangedTop::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_GetChangedTop, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'KeyConfig_List_C_GetChangedTop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ApplyKeyConfigDatas
// 0x01C8 (0x01C8 - 0x0000)
struct KeyConfig_List_C_ApplyKeyConfigDatas final
{
public:
	struct FSBPlayerClassKeyConfigData            SBPlayerClassKeyConfigData;                        // 0x0000(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(KeyConfig_List_C_ApplyKeyConfigDatas) == 0x000008, "Wrong alignment on KeyConfig_List_C_ApplyKeyConfigDatas");
static_assert(sizeof(KeyConfig_List_C_ApplyKeyConfigDatas) == 0x0001C8, "Wrong size on KeyConfig_List_C_ApplyKeyConfigDatas");
static_assert(offsetof(KeyConfig_List_C_ApplyKeyConfigDatas, SBPlayerClassKeyConfigData) == 0x000000, "Member 'KeyConfig_List_C_ApplyKeyConfigDatas::SBPlayerClassKeyConfigData' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.CreateChildWidget
// 0x00A8 (0x00A8 - 0x0000)
struct KeyConfig_List_C_CreateChildWidget final
{
public:
	struct FKeyConfigType                         ConfigureType;                                     // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UUserWidget*                            Child;                                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConfig_KeyConfigItemType                     ItemType;                                          // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6B[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ChildWidget;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKeyConfig_Slider_C*                    CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C6C[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVSpacer_C*                             CallFunc_Create_ReturnValue_1;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKeyConfig_Title_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKeyConfig_ConfigSlot_C*                CallFunc_Create_ReturnValue_3;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, EConfig_KeyconfigItems Type)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UKeyConfig_Radio_C*                     CallFunc_Create_ReturnValue_4;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewValue, float Ratio, EConfig_KeyconfigItems Type, class UKeyConfig_Slider_C* Target)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UKeySettingLabel_C*                     CallFunc_Create_ReturnValue_5;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBookmarkDelete_C*                      CallFunc_Create_ReturnValue_6;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_CreateChildWidget) == 0x000008, "Wrong alignment on KeyConfig_List_C_CreateChildWidget");
static_assert(sizeof(KeyConfig_List_C_CreateChildWidget) == 0x0000A8, "Wrong size on KeyConfig_List_C_CreateChildWidget");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, ConfigureType) == 0x000000, "Member 'KeyConfig_List_C_CreateChildWidget::ConfigureType' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, Child) == 0x000020, "Member 'KeyConfig_List_C_CreateChildWidget::Child' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, ItemType) == 0x000028, "Member 'KeyConfig_List_C_CreateChildWidget::ItemType' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, ChildWidget) == 0x000030, "Member 'KeyConfig_List_C_CreateChildWidget::ChildWidget' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue) == 0x000038, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'KeyConfig_List_C_CreateChildWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue_1) == 0x000048, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue_2) == 0x000050, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue_3) == 0x000058, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'KeyConfig_List_C_CreateChildWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'KeyConfig_List_C_CreateChildWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue_4) == 0x000080, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'KeyConfig_List_C_CreateChildWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue_5) == 0x000098, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CreateChildWidget, CallFunc_Create_ReturnValue_6) == 0x0000A0, "Member 'KeyConfig_List_C_CreateChildWidget::CallFunc_Create_ReturnValue_6' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ApplyPadKeyConfig
// 0x0088 (0x0088 - 0x0000)
struct KeyConfig_List_C_ApplyPadKeyConfig final
{
public:
	struct FSBGamePadSettings                     SBGamePadSettings;                                 // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(KeyConfig_List_C_ApplyPadKeyConfig) == 0x000008, "Wrong alignment on KeyConfig_List_C_ApplyPadKeyConfig");
static_assert(sizeof(KeyConfig_List_C_ApplyPadKeyConfig) == 0x000088, "Wrong size on KeyConfig_List_C_ApplyPadKeyConfig");
static_assert(offsetof(KeyConfig_List_C_ApplyPadKeyConfig, SBGamePadSettings) == 0x000000, "Member 'KeyConfig_List_C_ApplyPadKeyConfig::SBGamePadSettings' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ApplyKeyboardMouseData
// 0x0130 (0x0130 - 0x0000)
struct KeyConfig_List_C_ApplyKeyboardMouseData final
{
public:
	struct FSBKeyboardSettings                    SBKeyboardSettings;                                // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSBMouseSettings                       SBMouseSettings;                                   // 0x0098(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(KeyConfig_List_C_ApplyKeyboardMouseData) == 0x000008, "Wrong alignment on KeyConfig_List_C_ApplyKeyboardMouseData");
static_assert(sizeof(KeyConfig_List_C_ApplyKeyboardMouseData) == 0x000130, "Wrong size on KeyConfig_List_C_ApplyKeyboardMouseData");
static_assert(offsetof(KeyConfig_List_C_ApplyKeyboardMouseData, SBKeyboardSettings) == 0x000000, "Member 'KeyConfig_List_C_ApplyKeyboardMouseData::SBKeyboardSettings' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_ApplyKeyboardMouseData, SBMouseSettings) == 0x000098, "Member 'KeyConfig_List_C_ApplyKeyboardMouseData::SBMouseSettings' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.CheckChangedKey
// 0x0390 (0x0390 - 0x0000)
struct KeyConfig_List_C_CheckChangedKey final
{
public:
	struct FSBPlayerClassKeyConfigData            Base;                                              // 0x0000(0x01C8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSBPlayerClassKeyConfigData            Now;                                               // 0x01C8(0x01C8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(KeyConfig_List_C_CheckChangedKey) == 0x000008, "Wrong alignment on KeyConfig_List_C_CheckChangedKey");
static_assert(sizeof(KeyConfig_List_C_CheckChangedKey) == 0x000390, "Wrong size on KeyConfig_List_C_CheckChangedKey");
static_assert(offsetof(KeyConfig_List_C_CheckChangedKey, Base) == 0x000000, "Member 'KeyConfig_List_C_CheckChangedKey::Base' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CheckChangedKey, Now) == 0x0001C8, "Member 'KeyConfig_List_C_CheckChangedKey::Now' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.OnChangeSlider
// 0x0018 (0x0018 - 0x0000)
struct KeyConfig_List_C_OnChangeSlider final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConfig_KeyconfigItems                        Type;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6D[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_Slider_C*                    Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_OnChangeSlider) == 0x000008, "Wrong alignment on KeyConfig_List_C_OnChangeSlider");
static_assert(sizeof(KeyConfig_List_C_OnChangeSlider) == 0x000018, "Wrong size on KeyConfig_List_C_OnChangeSlider");
static_assert(offsetof(KeyConfig_List_C_OnChangeSlider, Value) == 0x000000, "Member 'KeyConfig_List_C_OnChangeSlider::Value' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_OnChangeSlider, Ratio) == 0x000004, "Member 'KeyConfig_List_C_OnChangeSlider::Ratio' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_OnChangeSlider, Type) == 0x000008, "Member 'KeyConfig_List_C_OnChangeSlider::Type' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_OnChangeSlider, Target) == 0x000010, "Member 'KeyConfig_List_C_OnChangeSlider::Target' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.OnChangeRadio
// 0x0008 (0x0008 - 0x0000)
struct KeyConfig_List_C_OnChangeRadio final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConfig_KeyconfigItems                        Type;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_OnChangeRadio) == 0x000004, "Wrong alignment on KeyConfig_List_C_OnChangeRadio");
static_assert(sizeof(KeyConfig_List_C_OnChangeRadio) == 0x000008, "Wrong size on KeyConfig_List_C_OnChangeRadio");
static_assert(offsetof(KeyConfig_List_C_OnChangeRadio, Param_Index) == 0x000000, "Member 'KeyConfig_List_C_OnChangeRadio::Param_Index' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_OnChangeRadio, Type) == 0x000004, "Member 'KeyConfig_List_C_OnChangeRadio::Type' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ApplySliders
// 0x01C8 (0x01C8 - 0x0000)
struct KeyConfig_List_C_ApplySliders final
{
public:
	struct FSBPlayerClassKeyConfigData            KeyConfigData;                                     // 0x0000(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(KeyConfig_List_C_ApplySliders) == 0x000008, "Wrong alignment on KeyConfig_List_C_ApplySliders");
static_assert(sizeof(KeyConfig_List_C_ApplySliders) == 0x0001C8, "Wrong size on KeyConfig_List_C_ApplySliders");
static_assert(offsetof(KeyConfig_List_C_ApplySliders, KeyConfigData) == 0x000000, "Member 'KeyConfig_List_C_ApplySliders::KeyConfigData' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ApplyRadio
// 0x01C8 (0x01C8 - 0x0000)
struct KeyConfig_List_C_ApplyRadio final
{
public:
	struct FSBPlayerClassKeyConfigData            KeyConfigData;                                     // 0x0000(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(KeyConfig_List_C_ApplyRadio) == 0x000008, "Wrong alignment on KeyConfig_List_C_ApplyRadio");
static_assert(sizeof(KeyConfig_List_C_ApplyRadio) == 0x0001C8, "Wrong size on KeyConfig_List_C_ApplyRadio");
static_assert(offsetof(KeyConfig_List_C_ApplyRadio, KeyConfigData) == 0x000000, "Member 'KeyConfig_List_C_ApplyRadio::KeyConfigData' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.CheckChangedSlider
// 0x0398 (0x0398 - 0x0000)
struct KeyConfig_List_C_CheckChangedSlider final
{
public:
	class UKeyConfig_Slider_C*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBPlayerClassKeyConfigData            Base;                                              // 0x0008(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSBPlayerClassKeyConfigData            Now;                                               // 0x01D0(0x01C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(KeyConfig_List_C_CheckChangedSlider) == 0x000008, "Wrong alignment on KeyConfig_List_C_CheckChangedSlider");
static_assert(sizeof(KeyConfig_List_C_CheckChangedSlider) == 0x000398, "Wrong size on KeyConfig_List_C_CheckChangedSlider");
static_assert(offsetof(KeyConfig_List_C_CheckChangedSlider, Target) == 0x000000, "Member 'KeyConfig_List_C_CheckChangedSlider::Target' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CheckChangedSlider, Base) == 0x000008, "Member 'KeyConfig_List_C_CheckChangedSlider::Base' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_CheckChangedSlider, Now) == 0x0001D0, "Member 'KeyConfig_List_C_CheckChangedSlider::Now' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct KeyConfig_List_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyConfig_List_C_PreConstruct) == 0x000001, "Wrong alignment on KeyConfig_List_C_PreConstruct");
static_assert(sizeof(KeyConfig_List_C_PreConstruct) == 0x000001, "Wrong size on KeyConfig_List_C_PreConstruct");
static_assert(offsetof(KeyConfig_List_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'KeyConfig_List_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.KeyChangeWait
// 0x0010 (0x0010 - 0x0000)
struct KeyConfig_List_C_KeyChangeWait final
{
public:
	EConfig_KeyconfigItems                        KeyType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6E[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_ConfigSlot_C*                Caller;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_KeyChangeWait) == 0x000008, "Wrong alignment on KeyConfig_List_C_KeyChangeWait");
static_assert(sizeof(KeyConfig_List_C_KeyChangeWait) == 0x000010, "Wrong size on KeyConfig_List_C_KeyChangeWait");
static_assert(offsetof(KeyConfig_List_C_KeyChangeWait, KeyType) == 0x000000, "Member 'KeyConfig_List_C_KeyChangeWait::KeyType' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_KeyChangeWait, Caller) == 0x000008, "Member 'KeyConfig_List_C_KeyChangeWait::Caller' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.PadChangeWait
// 0x0010 (0x0010 - 0x0000)
struct KeyConfig_List_C_PadChangeWait final
{
public:
	EConfig_KeyconfigItems                        KeyType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C6F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKeyConfig_ConfigSlot_C*                Caller;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyConfig_List_C_PadChangeWait) == 0x000008, "Wrong alignment on KeyConfig_List_C_PadChangeWait");
static_assert(sizeof(KeyConfig_List_C_PadChangeWait) == 0x000010, "Wrong size on KeyConfig_List_C_PadChangeWait");
static_assert(offsetof(KeyConfig_List_C_PadChangeWait, KeyType) == 0x000000, "Member 'KeyConfig_List_C_PadChangeWait::KeyType' has a wrong offset!");
static_assert(offsetof(KeyConfig_List_C_PadChangeWait, Caller) == 0x000008, "Member 'KeyConfig_List_C_PadChangeWait::Caller' has a wrong offset!");

// Function KeyConfig_List.KeyConfig_List_C.ExecuteUbergraph_KeyConfig_List
// 0x2330 (0x2330 - 0x0000)
struct KeyConfig_List_C_ExecuteUbergraph_KeyConfig_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_12;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_13;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_14;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_15;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_16;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_17;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_18;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_19;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_20;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_21;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_22;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_23;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_24;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_25;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_26;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_27;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_28;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_29;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_30;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_31;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_32;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_33;                             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_34;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_35;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_36;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_37;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_38;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_39;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_40;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_41;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_42;                             // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_43;                             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_44;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
