#pragma once

 

// Package: LibraryMenu

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "ELibraryMenuType_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LibraryMenu.LibraryMenu_C.ExecuteUbergraph_LibraryMenu
// 0x01C8 (0x01C8 - 0x0000)
struct LibraryMenu_C_ExecuteUbergraph_LibraryMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result, TArray<struct FSBAchievementInfo>& AchievementList)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WasSuccessful;                        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E08[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RetCode;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBLibraryPictureBookType                     K2Node_Event_type;                                 // 0x0030(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E09[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MainPage;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubPage;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E0A[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ButtonId_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0B[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_5;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_6;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELibraryMenuType                              K2Node_CustomEvent_InputPin;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0C[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_7;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E0D[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0E[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAchievementComponent*          CallFunc_GetPlayerAchievementComponent_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAchievementsLoadedFromDB_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E0F[0x1];                                     // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_8;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_9;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_10;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x00AC(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E10[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAchievementInfo>             K2Node_CustomEvent_AchievementList;                // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_11;            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_12;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_13;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E11[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E12[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBTheaterComponent*                    CallFunc_GetTheaterComponent_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_14;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E13[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetLoadDemoList_ReturnValue;              // 0x00F8(0x0010)(ReferenceParm)
	class FString                                 K2Node_Event_InBookMarkType;                       // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ELibraryMenuType                              CallFunc_BookmarkTypeToMenueType_ReturnValue;      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELibraryMenuType                              CallFunc_BookmarkTypeToMenueType_ReturnValue_1;    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E14[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_15;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E15[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_16;            // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELibraryMenuType                              Temp_byte_Variable;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E16[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_ButtonId;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E17[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_17;            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E18[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_18;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_19;            // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELibraryMenuType                              Temp_byte_Variable_1;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E19[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0158(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1A[0x3];                                     // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result, int32 RetCode)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1B[0x3];                                     // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBAchievementInfo>             CallFunc_GetAchievementList_ReturnValue;           // 0x0178(0x0010)(ConstParm, ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoginBonusBtnEnable_Enable;             // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELibraryMenuType                              Temp_byte_Variable_2;                              // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1C[0x1];                                     // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidAddLibraryPic_ReturnValue;           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELibraryMenuType                              Temp_byte_Variable_3;                              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E1D[0x2];                                     // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAchievementComponent*          CallFunc_GetPlayerAchievementComponent_ReturnValue_1; // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x01A8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1E[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x01AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRunRequiredDataInfoList_ReturnValue;    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1F[0x6];                                     // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAchievementComponent*          CallFunc_GetPlayerAchievementComponent_ReturnValue_2; // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu) == 0x000008, "Wrong alignment on LibraryMenu_C_ExecuteUbergraph_LibraryMenu");
static_assert(sizeof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu) == 0x0001C8, "Wrong size on LibraryMenu_C_ExecuteUbergraph_LibraryMenu");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, EntryPoint) == 0x000000, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000018, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_2) == 0x00001C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_3) == 0x000020, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_4) == 0x000024, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_WasSuccessful) == 0x000029, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_WasSuccessful' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_RetCode) == 0x00002C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_type) == 0x000030, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_type' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_MainPage) == 0x000034, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_SubPage) == 0x000038, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_SubPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_Animation) == 0x000040, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_ComponentBoundEvent_ButtonId_1) == 0x000048, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_ComponentBoundEvent_ButtonId_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00004C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_SwitchInteger_CmpSuccess) == 0x00004D, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_5) == 0x000060, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_6) == 0x000064, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CustomEvent_InputPin) == 0x000068, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000069, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00006A, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_7) == 0x00006C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, Temp_int_Variable) == 0x000078, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000080, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetPlayerAchievementComponent_ReturnValue) == 0x000090, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetPlayerAchievementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_IsAchievementsLoadedFromDB_ReturnValue) == 0x000098, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_IsAchievementsLoadedFromDB_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00009A, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_8) == 0x0000A0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_9) == 0x0000A4, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_10) == 0x0000A8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CustomEvent_Result_1) == 0x0000AC, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CustomEvent_AchievementList) == 0x0000B0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CustomEvent_AchievementList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_11) == 0x0000C0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_12) == 0x0000C4, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000C8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_13) == 0x0000D0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_DynamicCast_AsSBPlayer_Controller_1) == 0x0000D8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_DynamicCast_AsSBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetTheaterComponent_ReturnValue) == 0x0000E8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetTheaterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_14) == 0x0000F0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetLoadDemoList_ReturnValue) == 0x0000F8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetLoadDemoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Event_InBookMarkType) == 0x000108, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Event_InBookMarkType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_BookmarkTypeToMenueType_ReturnValue) == 0x000118, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_BookmarkTypeToMenueType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_BookmarkTypeToMenueType_ReturnValue_1) == 0x000119, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_BookmarkTypeToMenueType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_15) == 0x00011C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetVisibility_ReturnValue) == 0x000120, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000121, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_16) == 0x000124, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, Temp_byte_Variable) == 0x000128, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_ComponentBoundEvent_ButtonId) == 0x00012C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_ComponentBoundEvent_ButtonId' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Select_Default) == 0x000130, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_PlayAnimation_ReturnValue_2) == 0x000138, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_17) == 0x000140, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000144, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_18) == 0x000148, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralInt_ReturnValue_19) == 0x00014C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralInt_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, Temp_byte_Variable_1) == 0x000150, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Select_Default_1) == 0x000154, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, Temp_bool_Variable) == 0x000158, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x00015C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetNetworkDataCache_IsValid) == 0x00016C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetNetworkDataCache_IsValid' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetNetworkDataCache_ReturnValue) == 0x000170, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetAchievementList_ReturnValue) == 0x000178, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetAchievementList_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000188, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_IsLoginBonusBtnEnable_Enable) == 0x000189, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_IsLoginBonusBtnEnable_Enable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, Temp_byte_Variable_2) == 0x00018A, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Select_Default_2) == 0x00018C, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_ValidAddLibraryPic_ReturnValue) == 0x000190, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_ValidAddLibraryPic_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, Temp_byte_Variable_3) == 0x000191, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_Select_Default_3) == 0x000194, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetSBPlayerController_ReturnValue) == 0x000198, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetPlayerAchievementComponent_ReturnValue_1) == 0x0001A0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetPlayerAchievementComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CustomEvent_Result) == 0x0001A8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, K2Node_CustomEvent_RetCode) == 0x0001AC, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_IsValid_ReturnValue_1) == 0x0001B0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_IsRunRequiredDataInfoList_ReturnValue) == 0x0001B1, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_IsRunRequiredDataInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetSBPlayerController_ReturnValue_1) == 0x0001B8, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetSBPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_ExecuteUbergraph_LibraryMenu, CallFunc_GetPlayerAchievementComponent_ReturnValue_2) == 0x0001C0, "Member 'LibraryMenu_C_ExecuteUbergraph_LibraryMenu::CallFunc_GetPlayerAchievementComponent_ReturnValue_2' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.OnLoadAchievementDataDelegate_Event
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_C_OnLoadAchievementDataDelegate_Event final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E20[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_OnLoadAchievementDataDelegate_Event) == 0x000004, "Wrong alignment on LibraryMenu_C_OnLoadAchievementDataDelegate_Event");
static_assert(sizeof(LibraryMenu_C_OnLoadAchievementDataDelegate_Event) == 0x000008, "Wrong size on LibraryMenu_C_OnLoadAchievementDataDelegate_Event");
static_assert(offsetof(LibraryMenu_C_OnLoadAchievementDataDelegate_Event, Result) == 0x000000, "Member 'LibraryMenu_C_OnLoadAchievementDataDelegate_Event::Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_OnLoadAchievementDataDelegate_Event, RetCode) == 0x000004, "Member 'LibraryMenu_C_OnLoadAchievementDataDelegate_Event::RetCode' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature final
{
public:
	int32                                         ButtonId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(sizeof(LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature");
static_assert(offsetof(LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature, ButtonId) == 0x000000, "Member 'LibraryMenu_C_BndEvt__LibraryMenu_SubButtonList_K2Node_ComponentBoundEvent_1_OnClick__DelegateSignature::ButtonId' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.OnSameMenuBookmarkAccessNew
// 0x0010 (0x0010 - 0x0000)
struct LibraryMenu_C_OnSameMenuBookmarkAccessNew final
{
public:
	class FString                                 InBookMarkType;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_OnSameMenuBookmarkAccessNew) == 0x000008, "Wrong alignment on LibraryMenu_C_OnSameMenuBookmarkAccessNew");
static_assert(sizeof(LibraryMenu_C_OnSameMenuBookmarkAccessNew) == 0x000010, "Wrong size on LibraryMenu_C_OnSameMenuBookmarkAccessNew");
static_assert(offsetof(LibraryMenu_C_OnSameMenuBookmarkAccessNew, InBookMarkType) == 0x000000, "Member 'LibraryMenu_C_OnSameMenuBookmarkAccessNew::InBookMarkType' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.OnLoadAchivementDelegate_event
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_C_OnLoadAchivementDelegate_event final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E21[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAchievementInfo>             AchievementList;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LibraryMenu_C_OnLoadAchivementDelegate_event) == 0x000008, "Wrong alignment on LibraryMenu_C_OnLoadAchivementDelegate_event");
static_assert(sizeof(LibraryMenu_C_OnLoadAchivementDelegate_event) == 0x000018, "Wrong size on LibraryMenu_C_OnLoadAchivementDelegate_event");
static_assert(offsetof(LibraryMenu_C_OnLoadAchivementDelegate_event, Result) == 0x000000, "Member 'LibraryMenu_C_OnLoadAchivementDelegate_event::Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_OnLoadAchivementDelegate_event, AchievementList) == 0x000008, "Member 'LibraryMenu_C_OnLoadAchivementDelegate_event::AchievementList' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.SelectTab
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_C_SelectTab final
{
public:
	ELibraryMenuType                              InputPin;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_SelectTab) == 0x000001, "Wrong alignment on LibraryMenu_C_SelectTab");
static_assert(sizeof(LibraryMenu_C_SelectTab) == 0x000001, "Wrong size on LibraryMenu_C_SelectTab");
static_assert(offsetof(LibraryMenu_C_SelectTab, InputPin) == 0x000000, "Member 'LibraryMenu_C_SelectTab::InputPin' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature final
{
public:
	int32                                         ButtonId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(sizeof(LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature");
static_assert(offsetof(LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature, ButtonId) == 0x000000, "Member 'LibraryMenu_C_BndEvt__CommandMenuCommonSubButtonList_K2Node_ComponentBoundEvent_0_OnClick__DelegateSignature::ButtonId' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_OnAnimationFinished) == 0x000008, "Wrong alignment on LibraryMenu_C_OnAnimationFinished");
static_assert(sizeof(LibraryMenu_C_OnAnimationFinished) == 0x000008, "Wrong size on LibraryMenu_C_OnAnimationFinished");
static_assert(offsetof(LibraryMenu_C_OnAnimationFinished, Animation) == 0x000000, "Member 'LibraryMenu_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.OnSubMenuUpdate
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_C_OnSubMenuUpdate final
{
public:
	int32                                         MainPage;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubPage;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_OnSubMenuUpdate) == 0x000004, "Wrong alignment on LibraryMenu_C_OnSubMenuUpdate");
static_assert(sizeof(LibraryMenu_C_OnSubMenuUpdate) == 0x000008, "Wrong size on LibraryMenu_C_OnSubMenuUpdate");
static_assert(offsetof(LibraryMenu_C_OnSubMenuUpdate, MainPage) == 0x000000, "Member 'LibraryMenu_C_OnSubMenuUpdate::MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_OnSubMenuUpdate, SubPage) == 0x000004, "Member 'LibraryMenu_C_OnSubMenuUpdate::SubPage' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.GetIdListCallback
// 0x000C (0x000C - 0x0000)
struct LibraryMenu_C_GetIdListCallback final
{
public:
	bool                                          WasSuccessful;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E22[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBLibraryPictureBookType                     Type;                                              // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_GetIdListCallback) == 0x000004, "Wrong alignment on LibraryMenu_C_GetIdListCallback");
static_assert(sizeof(LibraryMenu_C_GetIdListCallback) == 0x00000C, "Wrong size on LibraryMenu_C_GetIdListCallback");
static_assert(offsetof(LibraryMenu_C_GetIdListCallback, WasSuccessful) == 0x000000, "Member 'LibraryMenu_C_GetIdListCallback::WasSuccessful' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_GetIdListCallback, RetCode) == 0x000004, "Member 'LibraryMenu_C_GetIdListCallback::RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_GetIdListCallback, Type) == 0x000008, "Member 'LibraryMenu_C_GetIdListCallback::Type' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.Setup Selected Menu
// 0x0088 (0x0088 - 0x0000)
struct LibraryMenu_C_Setup_Selected_Menu final
{
public:
	ELibraryMenuType                              InSelectedMenuType;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E23[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E24[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 MenuButtonListId)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class ULibraryMenu_Monster_C*                 CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULibraryMenu_Bookmark_C*                CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class ULibraryMenu_Theater_C*                 CallFunc_Create_ReturnValue_2;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E25[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E26[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULibraryMenu_Achievement_C*             CallFunc_Create_ReturnValue_3;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULibraryMenu_LoginBonus_C*              CallFunc_Create_ReturnValue_4;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_C_Setup_Selected_Menu) == 0x000008, "Wrong alignment on LibraryMenu_C_Setup_Selected_Menu");
static_assert(sizeof(LibraryMenu_C_Setup_Selected_Menu) == 0x000088, "Wrong size on LibraryMenu_C_Setup_Selected_Menu");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, InSelectedMenuType) == 0x000000, "Member 'LibraryMenu_C_Setup_Selected_Menu::InSelectedMenuType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LibraryMenu_C_Setup_Selected_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'LibraryMenu_C_Setup_Selected_Menu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'LibraryMenu_C_Setup_Selected_Menu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_Create_ReturnValue) == 0x000028, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'LibraryMenu_C_Setup_Selected_Menu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'LibraryMenu_C_Setup_Selected_Menu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_Create_ReturnValue_2) == 0x000058, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_AddChildToCanvas_ReturnValue) == 0x000068, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_Create_ReturnValue_3) == 0x000078, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_C_Setup_Selected_Menu, CallFunc_Create_ReturnValue_4) == 0x000080, "Member 'LibraryMenu_C_Setup_Selected_Menu::CallFunc_Create_ReturnValue_4' has a wrong offset!");

// Function LibraryMenu.LibraryMenu_C.SetupMenuButtonExcrametion
// 0x0308 (0x0308 - 0x0000)
struct LibraryMenu_C_SetupMenuButtonExcrametion final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDefaultShowAllRead;                              // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E27[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             TutorialHelpDB;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBCharactersLogComponent*              LogComponent;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CheckNameList;                                     // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 CheckList;                                         // 0x0028(0x0010)(Edit, BlueprintVisible)
	class USBLibrarySaveManager*                  SaveManager;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectNum;                                         // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E28[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_3;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_4;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_5;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_1;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
