#pragma once

 

// Package: LibraryMenu_Imagine

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.AllReadImagine__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature");
static_assert(sizeof(LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature");
static_assert(offsetof(LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature, Param_Index) == 0x000000, "Member 'LibraryMenu_Imagine_C_AllReadImagine__DelegateSignature::Param_Index' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.ExecuteUbergraph_LibraryMenu_Imagine
// 0x0220 (0x0220 - 0x0000)
struct LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELibraryImagineType                           Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_ListIndex;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_NewParam;               // 0x0018(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_ItemIndex;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedCategoryListIndex_SelectedCategoryListIndex; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedID_Output;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4655[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELibraryImagineType                           Temp_byte_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4656[0x2];                                     // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MainPage;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubPage;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4657[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InBookMarkType;                       // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4658[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULibraryMenu_ListItemIcon_C*            K2Node_DynamicCast_AsLibrary_Menu_List_Item_Icon;  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4659[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULibraryMenu_ListItemIcon_C*            K2Node_DynamicCast_AsLibrary_Menu_List_Item_Icon_1; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465A[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterImagine>               CallFunc_GetImagineList_OutList;                   // 0x00E8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465B[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_Array_Get_Item;                           // 0x0100(0x00B0)()
	int32                                         K2Node_Select_Default_1;                           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_2;                           // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_465C[0x1];                                     // 0x01B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x01B8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsAnimInOutPlaying_OutIsPlaying;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465D[0x2];                                     // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsSecretItem_Result;                      // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465E[0x1];                                     // 0x01DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_WasSuccessful;                        // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465F[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_RetCode;                              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBLibraryPictureBookType                     K2Node_Event_type;                                 // 0x01F0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4660[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x01F8(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0208(0x0018)()
};
static_assert(alignof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine) == 0x000008, "Wrong alignment on LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine");
static_assert(sizeof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine) == 0x000220, "Wrong size on LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, EntryPoint) == 0x000000, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::EntryPoint' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_int_Variable) == 0x000004, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_int_Variable_1) == 0x000008, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_bool_Variable) == 0x00000C, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000D, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000E, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000F, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_bool_Variable_1) == 0x000010, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_byte_Variable) == 0x000011, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_bool_Variable_2) == 0x000012, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_bool_Variable_3) == 0x000013, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_CustomEvent_ListIndex) == 0x000014, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_CustomEvent_ListIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_ComponentBoundEvent_NewParam) == 0x000018, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_ComponentBoundEvent_NewParam' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_ComponentBoundEvent_ItemIndex) == 0x000030, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_ComponentBoundEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetSelectedCategoryListIndex_SelectedCategoryListIndex) == 0x000034, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetSelectedCategoryListIndex_SelectedCategoryListIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetSelectedID_Output) == 0x000038, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetSelectedID_Output' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetTextFromAsset_ReturnValue) == 0x000040, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000068, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_IsEditor_ReturnValue) == 0x000090, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, Temp_byte_Variable_1) == 0x000091, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Event_MainPage) == 0x000094, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Event_MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Event_SubPage) == 0x000098, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Event_SubPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Select_Default) == 0x00009C, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Event_InBookMarkType) == 0x0000A0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Event_InBookMarkType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Not_PreBool_ReturnValue) == 0x0000B0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0000B1, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetChildAt_ReturnValue) == 0x0000B8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_DynamicCast_AsLibrary_Menu_List_Item_Icon) == 0x0000C0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_DynamicCast_AsLibrary_Menu_List_Item_Icon' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetChildAt_ReturnValue_1) == 0x0000D0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_DynamicCast_AsLibrary_Menu_List_Item_Icon_1) == 0x0000D8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_DynamicCast_AsLibrary_Menu_List_Item_Icon_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetImagineList_OutList) == 0x0000E8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetImagineList_OutList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_IsVisible_ReturnValue) == 0x0000F8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Array_Get_Item) == 0x000100, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Select_Default_1) == 0x0001B0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Select_Default_2) == 0x0001B4, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0001B5, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Select_Default_3) == 0x0001B6, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_ComponentBoundEvent_Filters) == 0x0001B8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_IsAnimInOutPlaying_OutIsPlaying) == 0x0001C8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_IsAnimInOutPlaying_OutIsPlaying' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C9, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_CreateDelegate_OutputDelegate) == 0x0001CC, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_IsSecretItem_Result) == 0x0001DC, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_IsSecretItem_Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001DD, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_SwitchEnum_CmpSuccess) == 0x0001DE, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetSBPlayerController_ReturnValue) == 0x0001E0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Event_WasSuccessful) == 0x0001E8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Event_WasSuccessful' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Event_RetCode) == 0x0001EC, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Event_RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, K2Node_Event_type) == 0x0001F0, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::K2Node_Event_type' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_GetSBRetMessage_ReturnValue) == 0x0001F8, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000208, "Member 'LibraryMenu_Imagine_C_ExecuteUbergraph_LibraryMenu_Imagine::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.GetIdListCallback
// 0x000C (0x000C - 0x0000)
struct LibraryMenu_Imagine_C_GetIdListCallback final
{
public:
	bool                                          WasSuccessful;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4661[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBLibraryPictureBookType                     Type;                                              // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Imagine_C_GetIdListCallback) == 0x000004, "Wrong alignment on LibraryMenu_Imagine_C_GetIdListCallback");
static_assert(sizeof(LibraryMenu_Imagine_C_GetIdListCallback) == 0x00000C, "Wrong size on LibraryMenu_Imagine_C_GetIdListCallback");
static_assert(offsetof(LibraryMenu_Imagine_C_GetIdListCallback, WasSuccessful) == 0x000000, "Member 'LibraryMenu_Imagine_C_GetIdListCallback::WasSuccessful' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_GetIdListCallback, RetCode) == 0x000004, "Member 'LibraryMenu_Imagine_C_GetIdListCallback::RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_GetIdListCallback, Type) == 0x000008, "Member 'LibraryMenu_Imagine_C_GetIdListCallback::Type' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature final
{
public:
	TArray<struct FFilterGroup>                   Filters;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature) == 0x000008, "Wrong alignment on LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature");
static_assert(sizeof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature) == 0x000010, "Wrong size on LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature");
static_assert(offsetof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature, Filters) == 0x000000, "Member 'LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Imagine_FilterSelector_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature::Filters' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.OnSameMenuBookmarkAccessNew
// 0x0010 (0x0010 - 0x0000)
struct LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew final
{
public:
	class FString                                 InBookMarkType;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew) == 0x000008, "Wrong alignment on LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew");
static_assert(sizeof(LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew) == 0x000010, "Wrong size on LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew");
static_assert(offsetof(LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew, InBookMarkType) == 0x000000, "Member 'LibraryMenu_Imagine_C_OnSameMenuBookmarkAccessNew::InBookMarkType' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.OnSubMenuUpdate
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_Imagine_C_OnSubMenuUpdate final
{
public:
	int32                                         MainPage;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubPage;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Imagine_C_OnSubMenuUpdate) == 0x000004, "Wrong alignment on LibraryMenu_Imagine_C_OnSubMenuUpdate");
static_assert(sizeof(LibraryMenu_Imagine_C_OnSubMenuUpdate) == 0x000008, "Wrong size on LibraryMenu_Imagine_C_OnSubMenuUpdate");
static_assert(offsetof(LibraryMenu_Imagine_C_OnSubMenuUpdate, MainPage) == 0x000000, "Member 'LibraryMenu_Imagine_C_OnSubMenuUpdate::MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_OnSubMenuUpdate, SubPage) == 0x000004, "Member 'LibraryMenu_Imagine_C_OnSubMenuUpdate::SubPage' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature");
static_assert(sizeof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature");
static_assert(offsetof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature, ItemIndex) == 0x000000, "Member 'LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Weapon_CategoryList_Type1_K2Node_ComponentBoundEvent_0_CategoryChanged__DelegateSignature::ItemIndex' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature) == 0x000008, "Wrong alignment on LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature");
static_assert(sizeof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature) == 0x000018, "Wrong size on LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature");
static_assert(offsetof(LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature, NewParam) == 0x000000, "Member 'LibraryMenu_Imagine_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_13_OnTextChange__DelegateSignature::NewParam' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.OnClickImagineEvent
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Imagine_C_OnClickImagineEvent final
{
public:
	int32                                         ListIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Imagine_C_OnClickImagineEvent) == 0x000004, "Wrong alignment on LibraryMenu_Imagine_C_OnClickImagineEvent");
static_assert(sizeof(LibraryMenu_Imagine_C_OnClickImagineEvent) == 0x000004, "Wrong size on LibraryMenu_Imagine_C_OnClickImagineEvent");
static_assert(offsetof(LibraryMenu_Imagine_C_OnClickImagineEvent, ListIndex) == 0x000000, "Member 'LibraryMenu_Imagine_C_OnClickImagineEvent::ListIndex' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.CreateCategoryList
// 0x00A0 (0x00A0 - 0x0000)
struct LibraryMenu_Imagine_C_CreateCategoryList final
{
public:
	TArray<int32>                                 TmpEnhanceImagineCategoryList;                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4662[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4663[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetImagineArtsTypeName_OutTypeName;       // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4664[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4665[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4666[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Imagine_C_CreateCategoryList) == 0x000008, "Wrong alignment on LibraryMenu_Imagine_C_CreateCategoryList");
static_assert(sizeof(LibraryMenu_Imagine_C_CreateCategoryList) == 0x0000A0, "Wrong size on LibraryMenu_Imagine_C_CreateCategoryList");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, TmpEnhanceImagineCategoryList) == 0x000000, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::TmpEnhanceImagineCategoryList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, Temp_int_Array_Index_Variable) == 0x000018, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, K2Node_MakeArray_Array) == 0x000020, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, Temp_int_Array_Index_Variable_1) == 0x000030, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_AddUnique_ReturnValue) == 0x000044, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_Get_Item) == 0x000048, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_Get_Item_1) == 0x00004C, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_GetTextFromAsset_ReturnValue) == 0x000058, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_GetImagineArtsTypeName_OutTypeName) == 0x000068, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_GetImagineArtsTypeName_OutTypeName' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_Length_ReturnValue_2) == 0x00007C, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000084, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, Temp_int_Loop_Counter_Variable_2) == 0x000088, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Less_IntInt_ReturnValue_1) == 0x00008C, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Add_IntInt_ReturnValue_2) == 0x000090, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, K2Node_SwitchEnum_CmpSuccess) == 0x000094, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Array_Length_ReturnValue_3) == 0x000098, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateCategoryList, CallFunc_Less_IntInt_ReturnValue_2) == 0x00009C, "Member 'LibraryMenu_Imagine_C_CreateCategoryList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function LibraryMenu_Imagine.LibraryMenu_Imagine_C.CreateImagineList
// 0x0428 (0x0428 - 0x0000)
struct LibraryMenu_Imagine_C_CreateImagineList final
{
public:
	bool                                          TmpIsHyoui;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TmpIsSecret;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4667[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULibraryMenu_ListItemIcon_C*            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4668[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4669[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLibrarySaveManager_IsValid;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466A[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBLibrarySaveManager*                  CallFunc_GetLibrarySaveManager_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466B[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLibrarySaveData                     CallFunc_LoadLibraryData_ReturnValue;              // 0x0060(0x0218)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466C[0x2];                                     // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466D[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_Array_Get_Item_1;                         // 0x0288(0x00B0)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466E[0x3];                                     // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0344(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_466F[0x3];                                     // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBImagineInfo                         CallFunc_GetDataTableRowFromName_OutRow;           // 0x0350(0x0048)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4670[0x6];                                     // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMasterImagineText_ReturnValue;         // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x03B0(0x0018)()
	bool                                          CallFunc_IsReadImagineData_ReturnValue;            // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSecretItem_Result;                      // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4671[0x2];                                     // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ListIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x03CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4672[0x2];                                     // 0x03DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x03E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x03E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x03E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4673[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSerchKeyword_SerchKeyword;             // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4674[0x6];                                     // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4675[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0414(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Imagine_C_CreateImagineList) == 0x000008, "Wrong alignment on LibraryMenu_Imagine_C_CreateImagineList");
static_assert(sizeof(LibraryMenu_Imagine_C_CreateImagineList) == 0x000428, "Wrong size on LibraryMenu_Imagine_C_CreateImagineList");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, TmpIsHyoui) == 0x000000, "Member 'LibraryMenu_Imagine_C_CreateImagineList::TmpIsHyoui' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, TmpIsSecret) == 0x000001, "Member 'LibraryMenu_Imagine_C_CreateImagineList::TmpIsSecret' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'LibraryMenu_Imagine_C_CreateImagineList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, CallFunc_Create_ReturnValue) == 0x000008, "Member 'LibraryMenu_Imagine_C_CreateImagineList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, CallFunc_GetPlayerId_ReturnValue) == 0x000010, "Member 'LibraryMenu_Imagine_C_CreateImagineList::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'LibraryMenu_Imagine_C_CreateImagineList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'LibraryMenu_Imagine_C_CreateImagineList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, Temp_int_Array_Index_Variable) == 0x000028, "Member 'LibraryMenu_Imagine_C_CreateImagineList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, CallFunc_GetCharacterId_ReturnValue) == 0x000030, "Member 'LibraryMenu_Imagine_C_CreateImagineList::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'LibraryMenu_Imagine_C_CreateImagineList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Imagine_C_CreateImagineList, CallFunc_Array_Get_Item) == 0x000044, "Member 'LibraryMenu_Imagine_C_CreateImagineList::CallFunc_Array_Get_Item' has a wrong offset!");
