#pragma once

 

// Package: LibraryMenu_Achievement

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.UpdateNewIcon__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature final
{
public:
	int32                                         MenuButtonListId;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature");
static_assert(sizeof(LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature");
static_assert(offsetof(LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature, MenuButtonListId) == 0x000000, "Member 'LibraryMenu_Achievement_C_UpdateNewIcon__DelegateSignature::MenuButtonListId' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.ExecuteUbergraph_LibraryMenu_Achievement
// 0x0380 (0x0380 - 0x0000)
struct LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FFC[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUMG_ProductDetailMenu_C* Sender)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result, int32 RetCode)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result_3;                       // 0x0048(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FFD[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAchievementInfo>             K2Node_CustomEvent_AchievementList;                // 0x0050(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(bool Result, TArray<struct FSBAchievementInfo>& AchievementList)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetAchievementId_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FFE[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentAcceptedResult_C*    CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_4;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_5;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_2;                       // 0x00A0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FFF[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAchievementId_ReturnValue_1;           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6000[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedOptionIndex_ReturnValue;       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6001[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x00D5(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6002[0x2];                                     // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode_2;                      // 0x00D8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0100(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	TDelegate<void(bool Result, int32 RetCode)>   K2Node_CreateDelegate_OutputDelegate_9;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0139(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6003[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x013C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBAchievementRewardData               K2Node_CustomEvent_AchievementRewardData;          // 0x0140(0x0070)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6004[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAchievementId_ReturnValue_2;           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMasterReward                        K2Node_ComponentBoundEvent_InMasterReward;         // 0x01BC(0x0014)(NoDestructor)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x01D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6005[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6006[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProductDetailMenu_C*               CallFunc_Create_ReturnValue_1;                     // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ProductDetailMenu_C*               K2Node_CustomEvent_Sender;                         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ItemIndex;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndex_ReturnValue;                     // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0210(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0238(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0260(0x0028)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6007[0x4];                                     // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULibraryMenu_AchievementListItem_C*     K2Node_DynamicCast_AsLibrary_Menu_Achievement_List_Item; // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6008[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result, int32 RetCode, struct FSBAchievementRewardData& AchievementRewardData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x02C0(0x0010)(ZeroConstructor, NoDestructor)
	class UMailAttachmentsAcceptWindow_C*         CallFunc_Create_ReturnValue_2;                     // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ValidTokenOverflow_ReturnValue;           // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6009[0x5];                                     // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_SBUtcNow_ReturnValue;                     // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBMailData>                    K2Node_ComponentBoundEvent_outRewardsData;         // 0x02E8(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_ComponentBoundEvent_outRewardsIds;          // 0x02F8(0x0010)(ReferenceParm)
	TArray<struct FSBMailData>                    CallFunc_GetAchievementReward_outMailData;         // 0x0308(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsOverflow_ReturnValue;                   // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVanishment_ReturnValue;                 // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600A[0x6];                                     // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue_1;    // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600B[0x7];                                     // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue_2;    // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result, int32 RetCode)>   K2Node_CreateDelegate_OutputDelegate_12;           // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue_3;    // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue_4;    // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunRequiredDataInfoList_ReturnValue;    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600C[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue_5;    // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAchievementComponent*          CallFunc_GetAchievementComponent_ReturnValue_6;    // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBCharacterAchievementDataInfo> CallFunc_GetDataInfoListCache_ReturnValue;         // 0x0370(0x0010)(ReferenceParm)
};
static_assert(alignof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement) == 0x000008, "Wrong alignment on LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement");
static_assert(sizeof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement) == 0x000380, "Wrong size on LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, EntryPoint) == 0x000000, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::EntryPoint' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue) == 0x000008, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_Result_3) == 0x000048, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_Result_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_AchievementList) == 0x000050, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_AchievementList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementId_ReturnValue) == 0x000070, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Create_ReturnValue) == 0x000078, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_4) == 0x000080, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_5) == 0x000090, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_Result_2) == 0x0000A0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_Result_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementId_ReturnValue_1) == 0x0000A4, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_ComponentBoundEvent_SelectedItem) == 0x0000A8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_ComponentBoundEvent_SelectionType) == 0x0000B8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetSelectedOptionIndex_ReturnValue) == 0x0000BC, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetSelectedOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000C0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetValidValue_ReturnValue) == 0x0000C1, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C4, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000D4, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_Result_1) == 0x0000D5, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_RetCode_2) == 0x0000D8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_RetCode_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000DC, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000EC, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_RetCode_1) == 0x0000FC, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetSBRetMessage_ReturnValue) == 0x000100, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_9) == 0x000128, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_MakeLiteralByte_ReturnValue) == 0x000138, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_Result) == 0x000139, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_RetCode) == 0x00013C, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_AchievementRewardData) == 0x000140, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_AchievementRewardData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_BooleanAND_ReturnValue) == 0x0001B1, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Not_PreBool_ReturnValue) == 0x0001B2, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001B3, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsValid_ReturnValue) == 0x0001B4, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementId_ReturnValue_2) == 0x0001B8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_ComponentBoundEvent_InMasterReward) == 0x0001BC, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_ComponentBoundEvent_InMasterReward' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAllChildren_ReturnValue) == 0x0001D0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0001E0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Array_Length_ReturnValue) == 0x0001E4, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Less_IntInt_ReturnValue) == 0x0001E8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001F0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Create_ReturnValue_1) == 0x0001F8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CustomEvent_Sender) == 0x000200, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_ComponentBoundEvent_ItemIndex) == 0x000208, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_ComponentBoundEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetIndex_ReturnValue) == 0x00020C, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_MakeStruct_SlateColor) == 0x000210, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_MakeStruct_SlateColor_1) == 0x000238, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_MakeStruct_SlateColor_2) == 0x000260, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, Temp_int_Array_Index_Variable) == 0x000288, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Array_Get_Item) == 0x000290, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_DynamicCast_AsLibrary_Menu_Achievement_List_Item) == 0x000298, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_DynamicCast_AsLibrary_Menu_Achievement_List_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_DynamicCast_bSuccess) == 0x0002A0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002A1, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsValid_ReturnValue_1) == 0x0002A2, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetUIManager_IsValid) == 0x0002A3, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetUIManager_IsValid' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetUIManager_ReturnValue) == 0x0002A8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_10) == 0x0002B0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_11) == 0x0002C0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_Create_ReturnValue_2) == 0x0002D0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsChecked_ReturnValue) == 0x0002D8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsChecked_ReturnValue_1) == 0x0002D9, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsChecked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_ValidTokenOverflow_ReturnValue) == 0x0002DA, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_ValidTokenOverflow_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_SBUtcNow_ReturnValue) == 0x0002E0, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_SBUtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_ComponentBoundEvent_outRewardsData) == 0x0002E8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_ComponentBoundEvent_outRewardsData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_ComponentBoundEvent_outRewardsIds) == 0x0002F8, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_ComponentBoundEvent_outRewardsIds' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementReward_outMailData) == 0x000308, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementReward_outMailData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsOverflow_ReturnValue) == 0x000318, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsOverflow_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsVanishment_ReturnValue) == 0x000319, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsVanishment_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue_1) == 0x000320, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_BooleanOR_ReturnValue) == 0x000328, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue_2) == 0x000330, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, K2Node_CreateDelegate_OutputDelegate_12) == 0x000338, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue_3) == 0x000348, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue_4) == 0x000350, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_IsRunRequiredDataInfoList_ReturnValue) == 0x000358, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_IsRunRequiredDataInfoList_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue_5) == 0x000360, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetAchievementComponent_ReturnValue_6) == 0x000368, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetAchievementComponent_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement, CallFunc_GetDataInfoListCache_ReturnValue) == 0x000370, "Member 'LibraryMenu_Achievement_C_ExecuteUbergraph_LibraryMenu_Achievement::CallFunc_GetDataInfoListCache_ReturnValue' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature final
{
public:
	TArray<struct FSBMailData>                    OutRewardsData;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 OutRewardsIds;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature) == 0x000008, "Wrong alignment on LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature");
static_assert(sizeof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature) == 0x000020, "Wrong size on LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature");
static_assert(offsetof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature, OutRewardsData) == 0x000000, "Member 'LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature::OutRewardsData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature, OutRewardsIds) == 0x000010, "Member 'LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_9_OnClicked_AchievementRewardsBtn__DelegateSignature::OutRewardsIds' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature");
static_assert(sizeof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature");
static_assert(offsetof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature, ItemIndex) == 0x000000, "Member 'LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_CategoryList_Type1_K2Node_ComponentBoundEvent_5_CategoryChanged__DelegateSignature::ItemIndex' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.OnCloseDetailMenu
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_Achievement_C_OnCloseDetailMenu final
{
public:
	class UUMG_ProductDetailMenu_C*               Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Achievement_C_OnCloseDetailMenu) == 0x000008, "Wrong alignment on LibraryMenu_Achievement_C_OnCloseDetailMenu");
static_assert(sizeof(LibraryMenu_Achievement_C_OnCloseDetailMenu) == 0x000008, "Wrong size on LibraryMenu_Achievement_C_OnCloseDetailMenu");
static_assert(offsetof(LibraryMenu_Achievement_C_OnCloseDetailMenu, Sender) == 0x000000, "Member 'LibraryMenu_Achievement_C_OnCloseDetailMenu::Sender' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature final
{
public:
	struct FSBMasterReward                        InMasterReward;                                    // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature");
static_assert(sizeof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature) == 0x000014, "Wrong size on LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature");
static_assert(offsetof(LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature, InMasterReward) == 0x000000, "Member 'LibraryMenu_Achievement_C_BndEvt__LibraryMenu_Achievement_LibraryMenu_AchievementDetails_K2Node_ComponentBoundEvent_0_OnClickRewardIcon__DelegateSignature::InMasterReward' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.OnGetAchievementRewardsDelegate_Event
// 0x0078 (0x0078 - 0x0000)
struct LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBAchievementRewardData               AchievementRewardData;                             // 0x0008(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event) == 0x000008, "Wrong alignment on LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event");
static_assert(sizeof(LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event) == 0x000078, "Wrong size on LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event");
static_assert(offsetof(LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event, Result) == 0x000000, "Member 'LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event::Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event, RetCode) == 0x000004, "Member 'LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event::RetCode' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event, AchievementRewardData) == 0x000008, "Member 'LibraryMenu_Achievement_C_OnGetAchievementRewardsDelegate_Event::AchievementRewardData' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.CallErrorMessage
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Achievement_C_CallErrorMessage final
{
public:
	int32                                         RetCode;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Achievement_C_CallErrorMessage) == 0x000004, "Wrong alignment on LibraryMenu_Achievement_C_CallErrorMessage");
static_assert(sizeof(LibraryMenu_Achievement_C_CallErrorMessage) == 0x000004, "Wrong size on LibraryMenu_Achievement_C_CallErrorMessage");
static_assert(offsetof(LibraryMenu_Achievement_C_CallErrorMessage, RetCode) == 0x000000, "Member 'LibraryMenu_Achievement_C_CallErrorMessage::RetCode' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.OnLoadAchievementDataDelegate_Event
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event) == 0x000004, "Wrong alignment on LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event");
static_assert(sizeof(LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event) == 0x000008, "Wrong size on LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event");
static_assert(offsetof(LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event, Result) == 0x000000, "Member 'LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event::Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event, RetCode) == 0x000004, "Member 'LibraryMenu_Achievement_C_OnLoadAchievementDataDelegate_Event::RetCode' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'LibraryMenu_Achievement_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_3_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.OnSaveAchievementSelectedDelegate_Event
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event) == 0x000001, "Wrong alignment on LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event");
static_assert(sizeof(LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event) == 0x000001, "Wrong size on LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event");
static_assert(offsetof(LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event, Result) == 0x000000, "Member 'LibraryMenu_Achievement_C_OnSaveAchievementSelectedDelegate_Event::Result' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.OnLoadAchievementDelegate
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_Achievement_C_OnLoadAchievementDelegate final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_600F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAchievementInfo>             AchievementList;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LibraryMenu_Achievement_C_OnLoadAchievementDelegate) == 0x000008, "Wrong alignment on LibraryMenu_Achievement_C_OnLoadAchievementDelegate");
static_assert(sizeof(LibraryMenu_Achievement_C_OnLoadAchievementDelegate) == 0x000018, "Wrong size on LibraryMenu_Achievement_C_OnLoadAchievementDelegate");
static_assert(offsetof(LibraryMenu_Achievement_C_OnLoadAchievementDelegate, Result) == 0x000000, "Member 'LibraryMenu_Achievement_C_OnLoadAchievementDelegate::Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Achievement_C_OnLoadAchievementDelegate, AchievementList) == 0x000008, "Member 'LibraryMenu_Achievement_C_OnLoadAchievementDelegate::AchievementList' has a wrong offset!");

// Function LibraryMenu_Achievement.LibraryMenu_Achievement_C.Initialize
// 0x0058 (0x0058 - 0x0000)
struct LibraryMenu_Achievement_C_Initialize final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6010[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6011[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
