#pragma once

 

// Package: LibraryMenu_Monster_ElementData

#include "Basic.hpp"


namespace SDK::Params
{

// Function LibraryMenu_Monster_ElementData.LibraryMenu_Monster_ElementData_C.Init
// 0x0058 (0x0058 - 0x0000)
struct LibraryMenu_Monster_ElementData_C_Init final
{
public:
	const class UImage*                           Temp_object_Variable;                              // 0x0000(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_11;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_12;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_13;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_14;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_15;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_16;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_17;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_18;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_19;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_ElementData_C_Init) == 0x000008, "Wrong alignment on LibraryMenu_Monster_ElementData_C_Init");
static_assert(sizeof(LibraryMenu_Monster_ElementData_C_Init) == 0x000058, "Wrong size on LibraryMenu_Monster_ElementData_C_Init");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, Temp_object_Variable) == 0x000000, "Member 'LibraryMenu_Monster_ElementData_C_Init::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_1) == 0x00000C, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_2) == 0x000010, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_3) == 0x000014, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_4) == 0x000018, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_5) == 0x00001C, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_6) == 0x000020, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_7) == 0x000024, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_8) == 0x000028, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_9) == 0x00002C, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_10) == 0x000030, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_11) == 0x000034, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_12) == 0x000038, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_13) == 0x00003C, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_14) == 0x000040, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_15) == 0x000044, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_16) == 0x000048, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_17) == 0x00004C, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_18) == 0x000050, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Init, CallFunc_Array_Add_ReturnValue_19) == 0x000054, "Member 'LibraryMenu_Monster_ElementData_C_Init::CallFunc_Array_Add_ReturnValue_19' has a wrong offset!");

// Function LibraryMenu_Monster_ElementData.LibraryMenu_Monster_ElementData_C.ResetIconVisibility
// 0x0020 (0x0020 - 0x0000)
struct LibraryMenu_Monster_ElementData_C_ResetIconVisibility final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility) == 0x000008, "Wrong alignment on LibraryMenu_Monster_ElementData_C_ResetIconVisibility");
static_assert(sizeof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility) == 0x000020, "Wrong size on LibraryMenu_Monster_ElementData_C_ResetIconVisibility");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, Temp_int_Array_Index_Variable) == 0x000000, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, CallFunc_Array_Get_Item) == 0x000010, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_ResetIconVisibility, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'LibraryMenu_Monster_ElementData_C_ResetIconVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LibraryMenu_Monster_ElementData.LibraryMenu_Monster_ElementData_C.Set Icon Data
// 0x0040 (0x0040 - 0x0000)
struct LibraryMenu_Monster_ElementData_C_Set_Icon_Data final
{
public:
	TArray<int32>                                 VisibleIndexList;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Offset;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Target;                                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopEnd;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA1[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA2[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA3[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data) == 0x000008, "Wrong alignment on LibraryMenu_Monster_ElementData_C_Set_Icon_Data");
static_assert(sizeof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data) == 0x000040, "Wrong size on LibraryMenu_Monster_ElementData_C_Set_Icon_Data");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, VisibleIndexList) == 0x000000, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::VisibleIndexList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, Offset) == 0x000010, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::Offset' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, Target) == 0x000014, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::Target' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, LoopEnd) == 0x000018, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::LoopEnd' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, Temp_int_Variable) == 0x00001C, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_Array_Get_Item) == 0x000028, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_ElementData_C_Set_Icon_Data, CallFunc_Array_LastIndex_ReturnValue) == 0x00003C, "Member 'LibraryMenu_Monster_ElementData_C_Set_Icon_Data::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");

}

