#pragma once

 

// Package: LibraryMenu_ItemDetails

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "EPictureBookMakeListSortType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.OnChangeFilter__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature final
{
public:
	EPictureBookMakeListSortType                  Param_SortType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature) == 0x000001, "Wrong alignment on LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature");
static_assert(sizeof(LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature) == 0x000001, "Wrong size on LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature");
static_assert(offsetof(LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature, Param_SortType) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_OnChangeFilter__DelegateSignature::Param_SortType' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.ExecuteUbergraph_LibraryMenu_ItemDetails
// 0x01B8 (0x01B8 - 0x0000)
struct LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF2[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF3[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF4[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InItemIndex;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemMasterData_IsExists;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF6[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        CallFunc_GetItemMasterData_ReturnValue;            // 0x0048(0x00D0)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF7[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterGender                            CallFunc_GetGender_ReturnValue;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AF8[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetItemIconTexture_OutIconTexture;        // 0x0140(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AF9[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5AFA[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFB[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFC[0x5];                                     // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPictureBook_MakeListItem_C*            CallFunc_Create_ReturnValue;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFD[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails) == 0x000008, "Wrong alignment on LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails");
static_assert(sizeof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails) == 0x0001B8, "Wrong size on LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, EntryPoint) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, Temp_object_Variable) == 0x000008, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, Temp_int_Variable) == 0x000010, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000015, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_DynamicCast_AsTexture_2D) == 0x000020, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_CustomEvent_InItemIndex) == 0x00002C, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_CustomEvent_InItemIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetMasterDataManager_IsValid) == 0x000030, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetMasterDataManager_ReturnValue) == 0x000038, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetItemMasterData_IsExists) == 0x000040, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetItemMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetItemMasterData_ReturnValue) == 0x000048, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetItemMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_Greater_IntInt_ReturnValue) == 0x000118, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000120, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_CustomEvent_Loaded) == 0x000128, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_DynamicCast_AsSBPlayer_Character) == 0x000130, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetGender_ReturnValue) == 0x000139, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetGender_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetItemIconTexture_OutIconTexture) == 0x000140, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetItemIconTexture_OutIconTexture' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000168, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_Event_IsDesignTime) == 0x000169, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_CreateDelegate_OutputDelegate) == 0x00016C, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_ComponentBoundEvent_SelectedItem) == 0x000180, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_ComponentBoundEvent_SelectionType) == 0x000190, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetSelectedIndex_ReturnValue) == 0x000194, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_Conv_IntToByte_ReturnValue) == 0x000198, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_GetValidValue_ReturnValue) == 0x000199, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, K2Node_SwitchEnum_CmpSuccess) == 0x00019A, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_Create_ReturnValue) == 0x0001A0, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0001A8, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails, CallFunc_AddChild_ReturnValue) == 0x0001B0, "Member 'LibraryMenu_ItemDetails_C_ExecuteUbergraph_LibraryMenu_ItemDetails::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'LibraryMenu_ItemDetails_C_BndEvt__LibraryMenu_ItemDetails_ComboBox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_ItemDetails_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_PreConstruct) == 0x000001, "Wrong alignment on LibraryMenu_ItemDetails_C_PreConstruct");
static_assert(sizeof(LibraryMenu_ItemDetails_C_PreConstruct) == 0x000001, "Wrong size on LibraryMenu_ItemDetails_C_PreConstruct");
static_assert(offsetof(LibraryMenu_ItemDetails_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.SetItemImage
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_ItemDetails_C_SetItemImage final
{
public:
	int32                                         InItemIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_SetItemImage) == 0x000004, "Wrong alignment on LibraryMenu_ItemDetails_C_SetItemImage");
static_assert(sizeof(LibraryMenu_ItemDetails_C_SetItemImage) == 0x000004, "Wrong size on LibraryMenu_ItemDetails_C_SetItemImage");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemImage, InItemIndex) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_SetItemImage::InItemIndex' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.OnLoaded_809AD089417D6D92E51C08859E31E5BD
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD) == 0x000008, "Wrong alignment on LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD");
static_assert(sizeof(LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD) == 0x000008, "Wrong size on LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD");
static_assert(offsetof(LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD, Loaded) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_OnLoaded_809AD089417D6D92E51C08859E31E5BD::Loaded' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.Initialize
// 0x0040 (0x0040 - 0x0000)
struct LibraryMenu_ItemDetails_C_Initialize final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AFE[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_Initialize) == 0x000008, "Wrong alignment on LibraryMenu_ItemDetails_C_Initialize");
static_assert(sizeof(LibraryMenu_ItemDetails_C_Initialize) == 0x000040, "Wrong size on LibraryMenu_ItemDetails_C_Initialize");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, Temp_int_Array_Index_Variable) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LibraryMenu_ItemDetails_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LibraryMenu_ItemDetails_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, K2Node_MakeArray_Array) == 0x000010, "Member 'LibraryMenu_ItemDetails_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, CallFunc_Array_Get_Item) == 0x000020, "Member 'LibraryMenu_ItemDetails_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000028, "Member 'LibraryMenu_ItemDetails_C_Initialize::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'LibraryMenu_ItemDetails_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'LibraryMenu_ItemDetails_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.SetDetailsVisibility
// 0x00E8 (0x00E8 - 0x0000)
struct LibraryMenu_ItemDetails_C_SetDetailsVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5AFF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        K2Node_MakeStruct_ItemMasterData;                  // 0x0008(0x00D0)()
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B00[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_ItemDetails_C_SetDetailsVisibility) == 0x000008, "Wrong alignment on LibraryMenu_ItemDetails_C_SetDetailsVisibility");
static_assert(sizeof(LibraryMenu_ItemDetails_C_SetDetailsVisibility) == 0x0000E8, "Wrong size on LibraryMenu_ItemDetails_C_SetDetailsVisibility");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetDetailsVisibility, bVisible) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_SetDetailsVisibility::bVisible' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetDetailsVisibility, K2Node_MakeStruct_ItemMasterData) == 0x000008, "Member 'LibraryMenu_ItemDetails_C_SetDetailsVisibility::K2Node_MakeStruct_ItemMasterData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetDetailsVisibility, CallFunc_GetVisibility_ReturnValue) == 0x0000D8, "Member 'LibraryMenu_ItemDetails_C_SetDetailsVisibility::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetDetailsVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D9, "Member 'LibraryMenu_ItemDetails_C_SetDetailsVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetDetailsVisibility, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'LibraryMenu_ItemDetails_C_SetDetailsVisibility::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function LibraryMenu_ItemDetails.LibraryMenu_ItemDetails_C.SetItemData
// 0x0650 (0x0650 - 0x0000)
struct LibraryMenu_ItemDetails_C_SetItemData final
{
public:
	struct FItemMasterData                        InItemMasterData;                                  // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSBSyntheAbilityData                   SyntheAbilityMax;                                  // 0x00D0(0x001C)(Edit, BlueprintVisible, NoDestructor)
	struct FSBSyntheAbilityData                   SyntheAbilityMin;                                  // 0x00EC(0x001C)(Edit, BlueprintVisible, NoDestructor)
	struct FSBAbilityTextData                     FusionItemText;                                    // 0x0108(0x0050)(Edit, BlueprintVisible)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B01[0x2];                                     // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01A0(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B02[0x7];                                     // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01C0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0200(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B03[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetItemText_ReturnValue;                  // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemText_ReturnValue_1;                // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B04[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0248(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0260(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemText_ReturnValue_2;                // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0298(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02B0(0x0018)()
	class FString                                 CallFunc_GetItemText_ReturnValue_3;                // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindFusionItemMaster_IsValid;             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B05[0x3];                                     // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_FindFusionItemMaster_OutFusionItemMaster; // 0x02DC(0x0018)(NoDestructor)
	uint8                                         Pad_5B06[0x4];                                     // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x02F8(0x0018)()
	struct FSBSyntheAbilityData                   CallFunc_FindSyntheAbilityPickupMasterDataFromP2P_MinAccuracy; // 0x0310(0x001C)(NoDestructor)
	struct FSBSyntheAbilityData                   CallFunc_FindSyntheAbilityPickupMasterDataFromP2P_MaxAccuracy; // 0x032C(0x001C)(NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0348(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B07[0x7];                                     // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0390(0x0010)(ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B08[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x03A8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B09[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x03F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFusionItemTextCollection_bIsValid;     // 0x0403(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0A[0x4];                                     // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAbilityTextData                     CallFunc_GetFusionItemTextCollection_ReturnValue;  // 0x0408(0x0050)(ConstParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0458(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0B[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0478(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0490(0x0018)()
	class FString                                 Temp_string_Variable;                              // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0C[0x6];                                     // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x04C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x04D0(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0D[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x04F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0530(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_3;                              // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B0E[0x2];                                     // 0x0546(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B0F[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0560(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B10[0x7];                                     // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0580(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B11[0x6];                                     // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x05B0(0x0018)()
	class FText                                   K2Node_Select_Default_5;                           // 0x05C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x05E0(0x0018)()
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x05F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x0608(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0620(0x0018)()
	class FText                                   K2Node_Select_Default_6;                           // 0x0638(0x0018)()
};
static_assert(alignof(LibraryMenu_ItemDetails_C_SetItemData) == 0x000008, "Wrong alignment on LibraryMenu_ItemDetails_C_SetItemData");
static_assert(sizeof(LibraryMenu_ItemDetails_C_SetItemData) == 0x000650, "Wrong size on LibraryMenu_ItemDetails_C_SetItemData");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, InItemMasterData) == 0x000000, "Member 'LibraryMenu_ItemDetails_C_SetItemData::InItemMasterData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, SyntheAbilityMax) == 0x0000D0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::SyntheAbilityMax' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, SyntheAbilityMin) == 0x0000EC, "Member 'LibraryMenu_ItemDetails_C_SetItemData::SyntheAbilityMin' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, FusionItemText) == 0x000108, "Member 'LibraryMenu_ItemDetails_C_SetItemData::FusionItemText' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue) == 0x000158, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable) == 0x000159, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00015A, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00015B, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable_1) == 0x00015C, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00015D, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_IntToText_ReturnValue) == 0x0001A0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001B8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001C0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000200, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000218, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_SwitchEnum_CmpSuccess) == 0x000219, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetItemText_ReturnValue) == 0x000220, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetItemText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetItemText_ReturnValue_1) == 0x000230, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetItemText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000240, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue) == 0x000248, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_FloatToText_ReturnValue) == 0x000260, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_IntToString_ReturnValue) == 0x000278, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetItemText_ReturnValue_2) == 0x000288, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetItemText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000298, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002B0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetItemText_ReturnValue_3) == 0x0002C8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetItemText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_FindFusionItemMaster_IsValid) == 0x0002D8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_FindFusionItemMaster_IsValid' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_FindFusionItemMaster_OutFusionItemMaster) == 0x0002DC, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_FindFusionItemMaster_OutFusionItemMaster' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0002F8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_FindSyntheAbilityPickupMasterDataFromP2P_MinAccuracy) == 0x000310, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_FindSyntheAbilityPickupMasterDataFromP2P_MinAccuracy' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_FindSyntheAbilityPickupMasterDataFromP2P_MaxAccuracy) == 0x00032C, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_FindSyntheAbilityPickupMasterDataFromP2P_MaxAccuracy' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeStruct_FormatArgumentData_2) == 0x000348, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000388, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeArray_Array) == 0x000390, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x0003A0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeStruct_FormatArgumentData_3) == 0x0003A8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_BooleanOR_ReturnValue) == 0x0003E8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeArray_Array_1) == 0x0003F0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000400, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x000401, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_BooleanOR_ReturnValue_1) == 0x000402, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetFusionItemTextCollection_bIsValid) == 0x000403, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetFusionItemTextCollection_bIsValid' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetFusionItemTextCollection_ReturnValue) == 0x000408, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetFusionItemTextCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000458, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable_2) == 0x000470, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000478, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000490, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_string_Variable) == 0x0004A8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_Select_Default) == 0x0004B8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0004B9, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_Select_Default_1) == 0x0004C0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_6) == 0x0004D0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0004E8, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeStruct_FormatArgumentData_4) == 0x0004F0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_MakeArray_Array_2) == 0x000530, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable_3) == 0x000540, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000541, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_Select_Default_2) == 0x000542, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000543, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000544, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable_4) == 0x000545, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000548, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_Select_Default_3) == 0x000558, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Conv_StringToText_ReturnValue_7) == 0x000560, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Conv_StringToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable_5) == 0x000578, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_Format_ReturnValue) == 0x000580, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, K2Node_Select_Default_4) == 0x000598, "Member 'LibraryMenu_ItemDetails_C_SetItemData::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, Temp_bool_Variable_6) == 0x000599, "Member 'LibraryMenu_ItemDetails_C_SetItemData::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_ItemDetails_C_SetItemData, CallFunc_GetTextFromAsset_ReturnValue) == 0x0005A0, "Member 'LibraryMenu_ItemDetails_C_SetItemData::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
