#pragma once

 

// Package: LibraryMenu_Bookmark

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "ST_TutorialExtendData_structs.hpp"
#include "ST_TutorialExtendDataMain_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LibraryMenu_Bookmark.LibraryMenu_Bookmark_C.OnClickDetail__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature");
static_assert(sizeof(LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature");
static_assert(offsetof(LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature, Param_Index) == 0x000000, "Member 'LibraryMenu_Bookmark_C_OnClickDetail__DelegateSignature::Param_Index' has a wrong offset!");

// Function LibraryMenu_Bookmark.LibraryMenu_Bookmark_C.ExecuteUbergraph_LibraryMenu_Bookmark
// 0x0758 (0x0758 - 0x0000)
struct LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidTutorialTerm_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A4[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A5[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46A6[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_wildcard_Variable;                            // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TutorialExtendData                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A7[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46A8[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTutorialHelpData                    CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0050(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A9[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AA[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TutorialExtendDataMain             CallFunc_Array_Get_Item;                           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AB[0x2];                                     // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AC[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AD[0x2];                                     // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x00F0(0x0010)(ReferenceParm)
	class FName                                   Temp_wildcard_Variable_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBTutorialHelpData                    CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0110(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AE[0x6];                                     // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventTermActive_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46AF[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B0[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_TutorialExtendData                 CallFunc_GetDataTableRowFromName_OutRow_3;         // 0x0190(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_3;    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B1[0x2];                                     // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TutorialExtendDataMain             CallFunc_Array_Get_Item_2;                         // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B2[0x2];                                     // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue_1;               // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_2;        // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_3;        // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B3[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x01C8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_3;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B4[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_wildcard_Variable_2;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue_2;               // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46B5[0x7];                                     // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTutorialHelpData                    CallFunc_GetDataTableRowFromName_OutRow_4;         // 0x01F8(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_4;    // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B6[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_TutorialExtendData                 CallFunc_GetDataTableRowFromName_OutRow_5;         // 0x0258(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_5;    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B7[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_TutorialExtendDataMain             CallFunc_Array_Get_Item_4;                         // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x027E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x027F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46B8[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InBookMarkType;                       // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MainPage;                             // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubPage;                              // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ListIndex;                      // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46B9[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_NewParam;               // 0x02B8(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BA[0x6];                                     // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSerchKeyword_SerchKeyword;             // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BB[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BC[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharactersLogComponent*              CallFunc_GetCharacterLogComponent_ReturnValue;     // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnlockTutorialHelp_ReturnValue;         // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BD[0x2];                                     // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BE[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46BF[0x3];                                     // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_wildcard_Variable_3;                          // 0x032C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C0[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TutorialExtendData                 CallFunc_GetDataTableRowFromName_OutRow_6;         // 0x0340(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_6;    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C1[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C2[0x7];                                     // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharactersLogComponent*              CallFunc_GetCharacterLogComponent_ReturnValue_1;   // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_TutorialExtendDataMain             CallFunc_Array_Get_Item_5;                         // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnlockTutorialHelp_ReturnValue_1;       // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C3[0x2];                                     // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C4[0x4];                                     // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTutorialHelpData                    CallFunc_GetDataTableRowFromName_OutRow_7;         // 0x0390(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_7;    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue_3;               // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C5[0x2];                                     // 0x03EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C6[0x3];                                     // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTutorialHelpData                    CallFunc_Array_Get_Item_6;                         // 0x03F8(0x0058)()
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C7[0x3];                                     // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C8[0x4];                                     // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULibraryMenu_ListItem_C*                CallFunc_Create_ReturnValue;                       // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0470(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ListIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0484(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46C9[0x3];                                     // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46CA[0x3];                                     // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x04A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x04B0(0x0018)()
	bool                                          CallFunc_GetLibrarySaveManager_IsValid;            // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46CB[0x7];                                     // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBLibrarySaveManager*                  CallFunc_GetLibrarySaveManager_ReturnValue;        // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46CC[0x7];                                     // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBLibrarySaveData                     CallFunc_LoadLibraryData_ReturnValue;              // 0x04F8(0x0218)()
	class FName                                   CallFunc_Map_Find_Value_1;                         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadListItem_ReturnValue;               // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46CD[0x2];                                     // 0x071A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_ItemIndex;              // 0x071C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedID_Output;                     // 0x0720(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46CE[0x4];                                     // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0728(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetReadBookmarkList_ReturnValue;          // 0x0738(0x0010)(ReferenceParm)
	TArray<struct FSBTutorialHelpData>            CallFunc_SortTutorialHelpDataArray_ReturnValue;    // 0x0748(0x0010)(ReferenceParm)
};
static_assert(alignof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark) == 0x000008, "Wrong alignment on LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark");
static_assert(sizeof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark) == 0x000758, "Wrong size on LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, EntryPoint) == 0x000000, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::EntryPoint' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_ValidTutorialTerm_ReturnValue) == 0x000004, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_ValidTutorialTerm_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetClassType_ReturnValue) == 0x000021, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_wildcard_Variable) == 0x000024, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Loop_Counter_Variable_2) == 0x00002C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000040, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Add_IntInt_ReturnValue_2) == 0x000044, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000050, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000A8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable_1) == 0x0000AC, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanAND_ReturnValue) == 0x0000B0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable_2) == 0x0000B4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Loop_Counter_Variable_3) == 0x0000B8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000BC, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable_3) == 0x0000C0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable_4) == 0x0000C4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000D5, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable_5) == 0x0000D8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanOR_ReturnValue) == 0x0000DC, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Loop_Counter_Variable_4) == 0x0000E0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000E4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Array_Index_Variable_6) == 0x0000E8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0000EC, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000ED, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0000F0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_wildcard_Variable_1) == 0x000100, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Get_Item_1) == 0x000108, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000110, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000168, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000169, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Conv_NameToString_ReturnValue) == 0x000170, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_IsEventTermActive_ReturnValue) == 0x000180, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_IsEventTermActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000184, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanOR_ReturnValue_1) == 0x000188, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_OutRow_3) == 0x000190, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_OutRow_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_ReturnValue_3) == 0x0001A0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanAND_ReturnValue_1) == 0x0001A1, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Length_ReturnValue_1) == 0x0001A4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Get_Item_2) == 0x0001A8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Less_IntInt_ReturnValue) == 0x0001B4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001B5, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Length_ReturnValue_2) == 0x0001B8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetClassType_ReturnValue_1) == 0x0001BC, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetClassType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_bool_True_if_break_was_hit_Variable_2) == 0x0001BD, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_bool_True_if_break_was_hit_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0001BE, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanOR_ReturnValue_2) == 0x0001BF, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Not_PreBool_ReturnValue_2) == 0x0001C0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_bool_True_if_break_was_hit_Variable_3) == 0x0001C1, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_bool_True_if_break_was_hit_Variable_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0001C8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Get_Item_3) == 0x0001D8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Length_ReturnValue_3) == 0x0001E0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001E4, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E5, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_wildcard_Variable_2) == 0x0001E8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetClassType_ReturnValue_2) == 0x0001F0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetClassType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_OutRow_4) == 0x0001F8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_OutRow_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_ReturnValue_4) == 0x000250, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_OutRow_5) == 0x000258, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_OutRow_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetDataTableRowFromName_ReturnValue_5) == 0x000268, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetDataTableRowFromName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Get_Item_4) == 0x00026C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Array_Length_ReturnValue_4) == 0x000278, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Less_IntInt_ReturnValue_2) == 0x00027C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00027D, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanAND_ReturnValue_2) == 0x00027E, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00027F, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanOR_ReturnValue_3) == 0x000280, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_Event_InBookMarkType) == 0x000288, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_Event_InBookMarkType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_Event_MainPage) == 0x000298, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_Event_MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_Event_SubPage) == 0x00029C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_Event_SubPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x0002A0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_CustomEvent_ListIndex) == 0x0002B0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_CustomEvent_ListIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_ComponentBoundEvent_NewParam) == 0x0002B8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_ComponentBoundEvent_NewParam' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002D0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0002D1, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0002D8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetSerchKeyword_SerchKeyword) == 0x0002E0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetSerchKeyword_SerchKeyword' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetController_ReturnValue) == 0x0002F0, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Contains_ReturnValue) == 0x0002F8, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000300, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, K2Node_DynamicCast_bSuccess) == 0x000308, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_GetCharacterLogComponent_ReturnValue) == 0x000310, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_GetCharacterLogComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000318, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_IsUnlockTutorialHelp_ReturnValue) == 0x000319, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_IsUnlockTutorialHelp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_int_Loop_Counter_Variable_5) == 0x00031C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Less_IntInt_ReturnValue_3) == 0x000320, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_Add_IntInt_ReturnValue_5) == 0x000324, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, CallFunc_BooleanAND_ReturnValue_3) == 0x000328, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark, Temp_wildcard_Variable_3) == 0x00032C, "Member 'LibraryMenu_Bookmark_C_ExecuteUbergraph_LibraryMenu_Bookmark::Temp_wildcard_Variable_3' has a wrong offset!");
