#pragma once

 

// Package: LibraryMenu_Monster

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.AllReadMonster__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Monster_C_AllReadMonster__DelegateSignature final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_AllReadMonster__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Monster_C_AllReadMonster__DelegateSignature");
static_assert(sizeof(LibraryMenu_Monster_C_AllReadMonster__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Monster_C_AllReadMonster__DelegateSignature");
static_assert(offsetof(LibraryMenu_Monster_C_AllReadMonster__DelegateSignature, Param_Index) == 0x000000, "Member 'LibraryMenu_Monster_C_AllReadMonster__DelegateSignature::Param_Index' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.ExecuteUbergraph_LibraryMenu_Monster
// 0x02B0 (0x02B0 - 0x0000)
struct LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EnemyId;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FFD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InBookMarkType;                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MainPage;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubPage;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Visible_1;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FFE[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EnemyCharacterId;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESBLibraryEnemyViewSetting                    K2Node_CustomEvent_ViewSetting;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBLibraryEnemyWeaponSetting                  K2Node_CustomEvent_WeaponSetting;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FFF[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7000[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBEnemyCharacter*                      CallFunc_GetCaptureModel_EnemyCharacter;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7001[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, class FName EnemyId)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FSBLibraryEnemySetting                 CallFunc_GetDataTableRowFromName_OutRow;           // 0x0080(0x0060)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7002[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBEnemyCharacter*                      CallFunc_GetCaptureModel_EnemyCharacter_1;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HumanoidEnemyBase_C*                K2Node_DynamicCast_AsBP_Humanoid_Enemy_Base;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7003[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7004[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7005[0x1];                                     // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Visible)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_3;            // 0x012C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x013C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0178(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_ComponentBoundEvent_NewParam;               // 0x0190(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7006[0x6];                                     // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7007[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBLibraryEnemyData>            CallFunc_GetLibraryEnemyList_EnemyList;            // 0x01D8(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7008[0x5];                                     // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7009[0x7];                                     // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharactersLogComponent*              CallFunc_GetCharacterLogComponent_ReturnValue;     // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_700A[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_ItemIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedID_Output;                     // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBTextTableHash                       CallFunc_Conv_SBTextTableHashToInt_ReturnValue;    // 0x0234(0x0004)(NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_7;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	class USBCharactersLogComponent*              CallFunc_GetCharacterLogComponent_ReturnValue_1;   // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0258(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0280(0x0028)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_700B[0x2];                                     // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster) == 0x000008, "Wrong alignment on LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster");
static_assert(sizeof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster) == 0x0002B0, "Wrong size on LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, EntryPoint) == 0x000000, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::EntryPoint' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_Index) == 0x000004, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_EnemyId) == 0x000008, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_EnemyId' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_PlaySE_ReturnValue) == 0x000010, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_Event_InBookMarkType) == 0x000018, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_Event_InBookMarkType' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_Event_MainPage) == 0x000028, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_Event_MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_Event_SubPage) == 0x00002C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_Event_SubPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_Enable) == 0x000030, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_Visible_1) == 0x000031, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_Visible_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_EnemyCharacterId) == 0x000038, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_EnemyCharacterId' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_ViewSetting) == 0x000048, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_ViewSetting' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_WeaponSetting) == 0x000049, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_WeaponSetting' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate) == 0x00004C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetCaptureModel_EnemyCharacter) == 0x000060, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetCaptureModel_EnemyCharacter' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_1) == 0x000070, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetDataTableRowFromName_OutRow) == 0x000080, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetCaptureModel_EnemyCharacter_1) == 0x0000F0, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetCaptureModel_EnemyCharacter_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_DynamicCast_AsBP_Humanoid_Enemy_Base) == 0x0000F8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_DynamicCast_AsBP_Humanoid_Enemy_Base' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_Array_Length_ReturnValue_1) == 0x000104, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000108, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_PlayAnimation_ReturnValue_1) == 0x000110, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_BooleanOR_ReturnValue) == 0x000118, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_BooleanAND_ReturnValue) == 0x000119, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00011A, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_2) == 0x00011C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_3) == 0x00012C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_Event_MyGeometry) == 0x00013C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_Event_InDeltaTime) == 0x000174, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_Event_Animation) == 0x000178, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_4) == 0x000180, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_ComponentBoundEvent_NewParam) == 0x000190, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_ComponentBoundEvent_NewParam' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_IsValid_ReturnValue) == 0x0001A8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_IsValid_ReturnValue_1) == 0x0001A9, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetPlayerController_ReturnValue) == 0x0001B0, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001B8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x0001C8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetLibraryEnemyList_EnemyList) == 0x0001D8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetLibraryEnemyList_EnemyList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001E8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001F0, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0001F8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0001F9, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_EqualEqual_ObjectObject_ReturnValue_2) == 0x0001FA, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_EqualEqual_ObjectObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetSBPlayerController_ReturnValue) == 0x000200, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_Result) == 0x000208, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetCharacterLogComponent_ReturnValue) == 0x000210, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetCharacterLogComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_6) == 0x000218, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CustomEvent_Visible) == 0x000228, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CustomEvent_Visible' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_ComponentBoundEvent_ItemIndex) == 0x00022C, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_ComponentBoundEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetSelectedID_Output) == 0x000230, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetSelectedID_Output' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_Conv_SBTextTableHashToInt_ReturnValue) == 0x000234, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_Conv_SBTextTableHashToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetSBPlayerController_ReturnValue_1) == 0x000238, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetSBPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_CreateDelegate_OutputDelegate_7) == 0x000240, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_GetCharacterLogComponent_ReturnValue_1) == 0x000250, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_GetCharacterLogComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_MakeStruct_SlateColor) == 0x000258, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, K2Node_MakeStruct_SlateColor_1) == 0x000280, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_Not_PreBool_ReturnValue) == 0x0002A8, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_BooleanAND_ReturnValue_1) == 0x0002A9, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002AC, "Member 'LibraryMenu_Monster_C_ExecuteUbergraph_LibraryMenu_Monster::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.AreaListSelect
// 0x000C (0x000C - 0x0000)
struct LibraryMenu_Monster_C_AreaListSelect final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EnemyId;                                           // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_AreaListSelect) == 0x000004, "Wrong alignment on LibraryMenu_Monster_C_AreaListSelect");
static_assert(sizeof(LibraryMenu_Monster_C_AreaListSelect) == 0x00000C, "Wrong size on LibraryMenu_Monster_C_AreaListSelect");
static_assert(offsetof(LibraryMenu_Monster_C_AreaListSelect, Param_Index) == 0x000000, "Member 'LibraryMenu_Monster_C_AreaListSelect::Param_Index' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_AreaListSelect, EnemyId) == 0x000004, "Member 'LibraryMenu_Monster_C_AreaListSelect::EnemyId' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature) == 0x000004, "Wrong alignment on LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature");
static_assert(sizeof(LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature) == 0x000004, "Wrong size on LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature");
static_assert(offsetof(LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature, ItemIndex) == 0x000000, "Member 'LibraryMenu_Monster_C_BndEvt__LibraryMenu_Monster_CategoryList_Type1_K2Node_ComponentBoundEvent_2_CategoryChanged__DelegateSignature::ItemIndex' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.AreaListVisibleChange
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_Monster_C_AreaListVisibleChange final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Monster_C_AreaListVisibleChange) == 0x000001, "Wrong alignment on LibraryMenu_Monster_C_AreaListVisibleChange");
static_assert(sizeof(LibraryMenu_Monster_C_AreaListVisibleChange) == 0x000001, "Wrong size on LibraryMenu_Monster_C_AreaListVisibleChange");
static_assert(offsetof(LibraryMenu_Monster_C_AreaListVisibleChange, Visible) == 0x000000, "Member 'LibraryMenu_Monster_C_AreaListVisibleChange::Visible' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.OnEnemyDataLoaded
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_Monster_C_OnEnemyDataLoaded final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Monster_C_OnEnemyDataLoaded) == 0x000001, "Wrong alignment on LibraryMenu_Monster_C_OnEnemyDataLoaded");
static_assert(sizeof(LibraryMenu_Monster_C_OnEnemyDataLoaded) == 0x000001, "Wrong size on LibraryMenu_Monster_C_OnEnemyDataLoaded");
static_assert(offsetof(LibraryMenu_Monster_C_OnEnemyDataLoaded, Result) == 0x000000, "Member 'LibraryMenu_Monster_C_OnEnemyDataLoaded::Result' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature final
{
public:
	class FText                                   NewParam;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature) == 0x000008, "Wrong alignment on LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature");
static_assert(sizeof(LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature) == 0x000018, "Wrong size on LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature");
static_assert(offsetof(LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature, NewParam) == 0x000000, "Member 'LibraryMenu_Monster_C_BndEvt__LibraryMenu_Search_K2Node_ComponentBoundEvent_19_OnTextChange__DelegateSignature::NewParam' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_Monster_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_OnAnimationFinished) == 0x000008, "Wrong alignment on LibraryMenu_Monster_C_OnAnimationFinished");
static_assert(sizeof(LibraryMenu_Monster_C_OnAnimationFinished) == 0x000008, "Wrong size on LibraryMenu_Monster_C_OnAnimationFinished");
static_assert(offsetof(LibraryMenu_Monster_C_OnAnimationFinished, Animation) == 0x000000, "Member 'LibraryMenu_Monster_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.Tick
// 0x003C (0x003C - 0x0000)
struct LibraryMenu_Monster_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_Tick) == 0x000004, "Wrong alignment on LibraryMenu_Monster_C_Tick");
static_assert(sizeof(LibraryMenu_Monster_C_Tick) == 0x00003C, "Wrong size on LibraryMenu_Monster_C_Tick");
static_assert(offsetof(LibraryMenu_Monster_C_Tick, MyGeometry) == 0x000000, "Member 'LibraryMenu_Monster_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_Tick, InDeltaTime) == 0x000038, "Member 'LibraryMenu_Monster_C_Tick::InDeltaTime' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.ModelLoadRequest
// 0x0018 (0x0018 - 0x0000)
struct LibraryMenu_Monster_C_ModelLoadRequest final
{
public:
	class FString                                 EnemyCharacterId;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESBLibraryEnemyViewSetting                    ViewSetting;                                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBLibraryEnemyWeaponSetting                  WeaponSetting;                                     // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_ModelLoadRequest) == 0x000008, "Wrong alignment on LibraryMenu_Monster_C_ModelLoadRequest");
static_assert(sizeof(LibraryMenu_Monster_C_ModelLoadRequest) == 0x000018, "Wrong size on LibraryMenu_Monster_C_ModelLoadRequest");
static_assert(offsetof(LibraryMenu_Monster_C_ModelLoadRequest, EnemyCharacterId) == 0x000000, "Member 'LibraryMenu_Monster_C_ModelLoadRequest::EnemyCharacterId' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ModelLoadRequest, ViewSetting) == 0x000010, "Member 'LibraryMenu_Monster_C_ModelLoadRequest::ViewSetting' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_ModelLoadRequest, WeaponSetting) == 0x000011, "Member 'LibraryMenu_Monster_C_ModelLoadRequest::WeaponSetting' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.SetModelVisibility
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_Monster_C_SetModelVisibility final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Monster_C_SetModelVisibility) == 0x000001, "Wrong alignment on LibraryMenu_Monster_C_SetModelVisibility");
static_assert(sizeof(LibraryMenu_Monster_C_SetModelVisibility) == 0x000001, "Wrong size on LibraryMenu_Monster_C_SetModelVisibility");
static_assert(offsetof(LibraryMenu_Monster_C_SetModelVisibility, Visible) == 0x000000, "Member 'LibraryMenu_Monster_C_SetModelVisibility::Visible' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.SetModelControllEnabled
// 0x0001 (0x0001 - 0x0000)
struct LibraryMenu_Monster_C_SetModelControllEnabled final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Monster_C_SetModelControllEnabled) == 0x000001, "Wrong alignment on LibraryMenu_Monster_C_SetModelControllEnabled");
static_assert(sizeof(LibraryMenu_Monster_C_SetModelControllEnabled) == 0x000001, "Wrong size on LibraryMenu_Monster_C_SetModelControllEnabled");
static_assert(offsetof(LibraryMenu_Monster_C_SetModelControllEnabled, Enable) == 0x000000, "Member 'LibraryMenu_Monster_C_SetModelControllEnabled::Enable' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.OnSubMenuUpdate
// 0x0008 (0x0008 - 0x0000)
struct LibraryMenu_Monster_C_OnSubMenuUpdate final
{
public:
	int32                                         MainPage;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubPage;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_OnSubMenuUpdate) == 0x000004, "Wrong alignment on LibraryMenu_Monster_C_OnSubMenuUpdate");
static_assert(sizeof(LibraryMenu_Monster_C_OnSubMenuUpdate) == 0x000008, "Wrong size on LibraryMenu_Monster_C_OnSubMenuUpdate");
static_assert(offsetof(LibraryMenu_Monster_C_OnSubMenuUpdate, MainPage) == 0x000000, "Member 'LibraryMenu_Monster_C_OnSubMenuUpdate::MainPage' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_OnSubMenuUpdate, SubPage) == 0x000004, "Member 'LibraryMenu_Monster_C_OnSubMenuUpdate::SubPage' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.OnSameMenuBookmarkAccessNew
// 0x0010 (0x0010 - 0x0000)
struct LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew final
{
public:
	class FString                                 InBookMarkType;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew) == 0x000008, "Wrong alignment on LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew");
static_assert(sizeof(LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew) == 0x000010, "Wrong size on LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew");
static_assert(offsetof(LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew, InBookMarkType) == 0x000000, "Member 'LibraryMenu_Monster_C_OnSameMenuBookmarkAccessNew::InBookMarkType' has a wrong offset!");

// Function LibraryMenu_Monster.LibraryMenu_Monster_C.CreateCategoryList
// 0x00D0 (0x00D0 - 0x0000)
struct LibraryMenu_Monster_C_CreateCategoryList final
{
public:
	TArray<struct FSBTextTableHash>               CategoryIndexData;                                 // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FString                                 CategoryText;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSBTextTableHash                       RaceId;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar_0;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_700C[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_700D[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_700E[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTextTableHash                       CallFunc_Conv_SBTextTableHashToInt_ReturnValue;    // 0x0044(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBTextTableHash                       CallFunc_Array_Get_Item;                           // 0x0058(0x0004)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_IntToSBTextTableHash_ReturnValue;    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_IntToSBTextTableHash_ReturnValue_1;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBTextTableHash                       CallFunc_IsReadCategory_readId;                    // 0x0064(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadCategory_isRead;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEnable_SBTextTableHash_ReturnValue;    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_700F[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7010[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndex_ReturnValue;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndex_ReturnValue_1;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7011[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetLibraryEnemyRaceIndexList_IndexList;   // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7012[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_IntToSBTextTableHash_ReturnValue_2;  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEnable_SBTextTableHash_ReturnValue_1;  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7013[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnemyRaceIdName_ReturnValue;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllRead_ReturnValue;                    // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LibraryMenu_Monster_C_CreateCategoryList) == 0x000008, "Wrong alignment on LibraryMenu_Monster_C_CreateCategoryList");
static_assert(sizeof(LibraryMenu_Monster_C_CreateCategoryList) == 0x0000D0, "Wrong size on LibraryMenu_Monster_C_CreateCategoryList");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CategoryIndexData) == 0x000000, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CategoryIndexData' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CategoryText) == 0x000010, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CategoryText' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, RaceId) == 0x000020, "Member 'LibraryMenu_Monster_C_CreateCategoryList::RaceId' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, NewLocalVar_0) == 0x000024, "Member 'LibraryMenu_Monster_C_CreateCategoryList::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, Temp_int_Variable) == 0x000028, "Member 'LibraryMenu_Monster_C_CreateCategoryList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, Temp_int_Variable_1) == 0x00002C, "Member 'LibraryMenu_Monster_C_CreateCategoryList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_IntToByte_ReturnValue) == 0x000030, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_GetValidValue_ReturnValue) == 0x000038, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000039, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000040, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_SBTextTableHashToInt_ReturnValue) == 0x000044, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_SBTextTableHashToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000048, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'LibraryMenu_Monster_C_CreateCategoryList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'LibraryMenu_Monster_C_CreateCategoryList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Array_Get_Item) == 0x000058, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_IntToSBTextTableHash_ReturnValue) == 0x00005C, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_IntToSBTextTableHash_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Conv_IntToSBTextTableHash_ReturnValue_1) == 0x000060, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Conv_IntToSBTextTableHash_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_IsReadCategory_readId) == 0x000064, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_IsReadCategory_readId' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_IsReadCategory_isRead) == 0x000068, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_IsReadCategory_isRead' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_NotEnable_SBTextTableHash_ReturnValue) == 0x000069, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_NotEnable_SBTextTableHash_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Not_PreBool_ReturnValue) == 0x00006A, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Array_Length_ReturnValue) == 0x00006C, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_GetIndex_ReturnValue) == 0x000074, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_GetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_GetIndex_ReturnValue_1) == 0x000078, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_GetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_GetLibraryEnemyRaceIndexList_IndexList) == 0x000080, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_GetLibraryEnemyRaceIndexList_IndexList' has a wrong offset!");
static_assert(offsetof(LibraryMenu_Monster_C_CreateCategoryList, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'LibraryMenu_Monster_C_CreateCategoryList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
