#pragma once

 

// Package: MailAttachmentAcceptHead

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.ExecuteUbergraph_MailAttachmentAcceptHead
// 0x00E8 (0x00E8 - 0x0000)
struct MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86EB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UExpandableArea*                        K2Node_ComponentBoundEvent_Area;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsExpanded;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86EC[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86ED[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StorageNo;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86EE[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Storage_Text_Text;                    // 0x0040(0x0018)()
	struct FSBMailAttachment                      K2Node_CustomEvent_inAttachment;                   // 0x0058(0x0040)()
	int32                                         CallFunc_FindAttachments_Attachment;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86EF[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailAttachmentAcceptBody_C*            CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F0[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F1[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F2[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_2;                           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead");
static_assert(sizeof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead) == 0x0000E8, "Wrong size on MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, EntryPoint) == 0x000000, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::EntryPoint' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_ComponentBoundEvent_Area) == 0x000008, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_ComponentBoundEvent_Area' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_ComponentBoundEvent_bIsExpanded) == 0x000010, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_ComponentBoundEvent_bIsExpanded' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_bool_Variable) == 0x000011, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_bool_Variable_1) == 0x000012, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_object_Variable) == 0x000018, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_object_Variable_1) == 0x000020, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_Select_Default) == 0x000028, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_Event_IsDesignTime) == 0x000030, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_PlaySE_ReturnValue) == 0x000034, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_CustomEvent_StorageNo) == 0x000038, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_CustomEvent_StorageNo' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00003D, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00003E, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_Get_Storage_Text_Text) == 0x000040, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_Get_Storage_Text_Text' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_CustomEvent_inAttachment) == 0x000058, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_CustomEvent_inAttachment' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_FindAttachments_Attachment) == 0x000098, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_FindAttachments_Attachment' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_AddChild_ReturnValue) == 0x0000B0, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_bool_Variable_2) == 0x0000B8, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_int_Variable) == 0x0000BC, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C0, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C4, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, Temp_bool_Variable_3) == 0x0000C8, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_Select_Default_1) == 0x0000D0, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_Select_Default_2) == 0x0000D8, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead, K2Node_Select_Default_3) == 0x0000E0, "Member 'MailAttachmentAcceptHead_C_ExecuteUbergraph_MailAttachmentAcceptHead::K2Node_Select_Default_3' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature final
{
public:
	class UExpandableArea*                        Area;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExpanded;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature");
static_assert(sizeof(MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature) == 0x000010, "Wrong size on MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature");
static_assert(offsetof(MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature, Area) == 0x000000, "Member 'MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature::Area' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature, bIsExpanded) == 0x000008, "Member 'MailAttachmentAcceptHead_C_BndEvt__MailAttachmentAcceptHead_Expandable_K2Node_ComponentBoundEvent_0_OnExpandableAreaExpansionChanged__DelegateSignature::bIsExpanded' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.AddAttachment
// 0x0040 (0x0040 - 0x0000)
struct MailAttachmentAcceptHead_C_AddAttachment final
{
public:
	struct FSBMailAttachment                      InAttachment;                                      // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(MailAttachmentAcceptHead_C_AddAttachment) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_AddAttachment");
static_assert(sizeof(MailAttachmentAcceptHead_C_AddAttachment) == 0x000040, "Wrong size on MailAttachmentAcceptHead_C_AddAttachment");
static_assert(offsetof(MailAttachmentAcceptHead_C_AddAttachment, InAttachment) == 0x000000, "Member 'MailAttachmentAcceptHead_C_AddAttachment::InAttachment' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.SetStorageNo
// 0x0004 (0x0004 - 0x0000)
struct MailAttachmentAcceptHead_C_SetStorageNo final
{
public:
	int32                                         Param_StorageNo;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailAttachmentAcceptHead_C_SetStorageNo) == 0x000004, "Wrong alignment on MailAttachmentAcceptHead_C_SetStorageNo");
static_assert(sizeof(MailAttachmentAcceptHead_C_SetStorageNo) == 0x000004, "Wrong size on MailAttachmentAcceptHead_C_SetStorageNo");
static_assert(offsetof(MailAttachmentAcceptHead_C_SetStorageNo, Param_StorageNo) == 0x000000, "Member 'MailAttachmentAcceptHead_C_SetStorageNo::Param_StorageNo' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MailAttachmentAcceptHead_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentAcceptHead_C_PreConstruct) == 0x000001, "Wrong alignment on MailAttachmentAcceptHead_C_PreConstruct");
static_assert(sizeof(MailAttachmentAcceptHead_C_PreConstruct) == 0x000001, "Wrong size on MailAttachmentAcceptHead_C_PreConstruct");
static_assert(offsetof(MailAttachmentAcceptHead_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MailAttachmentAcceptHead_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.Get Storage Text
// 0x0070 (0x0070 - 0x0000)
struct MailAttachmentAcceptHead_C_Get_Storage_Text final
{
public:
	int32                                         Param_StorageNo;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86F3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F4[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0034(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F5[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x003C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0040(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0044(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(MailAttachmentAcceptHead_C_Get_Storage_Text) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_Get_Storage_Text");
static_assert(sizeof(MailAttachmentAcceptHead_C_Get_Storage_Text) == 0x000070, "Wrong size on MailAttachmentAcceptHead_C_Get_Storage_Text");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Param_StorageNo) == 0x000000, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Param_StorageNo' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Text) == 0x000008, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Text' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_bool_Variable) == 0x000020, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000021, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000022, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000023, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_int_Variable) == 0x000024, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_int_Variable_1) == 0x000028, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_bool_Variable_1) == 0x00002C, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, K2Node_Select_Default) == 0x000030, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_int_Variable_2) == 0x000034, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_bool_Variable_2) == 0x000038, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, K2Node_Select_Default_1) == 0x00003C, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, Temp_int_Variable_3) == 0x000040, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, K2Node_Select_Default_2) == 0x000044, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, CallFunc_GetTextFromAsset_ReturnValue) == 0x000048, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_Get_Storage_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'MailAttachmentAcceptHead_C_Get_Storage_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.FindAttachments
// 0x00A0 (0x00A0 - 0x0000)
struct MailAttachmentAcceptHead_C_FindAttachments final
{
public:
	struct FSBMailAttachment                      Find;                                              // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Attachment;                                        // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86F6[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      CallFunc_Array_Get_Item;                           // 0x0058(0x0040)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentAcceptHead_C_FindAttachments) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_FindAttachments");
static_assert(sizeof(MailAttachmentAcceptHead_C_FindAttachments) == 0x0000A0, "Wrong size on MailAttachmentAcceptHead_C_FindAttachments");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, Find) == 0x000000, "Member 'MailAttachmentAcceptHead_C_FindAttachments::Find' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, Attachment) == 0x000040, "Member 'MailAttachmentAcceptHead_C_FindAttachments::Attachment' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, Temp_int_Array_Index_Variable) == 0x000044, "Member 'MailAttachmentAcceptHead_C_FindAttachments::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'MailAttachmentAcceptHead_C_FindAttachments::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_Array_Get_Item) == 0x000058, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000099, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00009A, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_FindAttachments, CallFunc_BooleanAND_ReturnValue) == 0x00009B, "Member 'MailAttachmentAcceptHead_C_FindAttachments::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.GenerateAttachmentList
// 0x0110 (0x0110 - 0x0000)
struct MailAttachmentAcceptHead_C_GenerateAttachmentList final
{
public:
	int32                                         StorageAddCount;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StorageCount;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                WorkStorage;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StorageCapacity;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86F7[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailAttachmentAcceptBody_C*            AttachmentBody;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailAttachmentAcceptBody_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailAttachmentAcceptBody_C*            CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapacity_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isAnyDuplicate_Duplicate;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F8[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86F9[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemsNum_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMailAttachment                      CallFunc_Array_Get_Item;                           // 0x0058(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isAnyOverFlow_Overflow;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86FA[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86FB[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMailAttachment                      CallFunc_Array_Get_Item_1;                         // 0x00C8(0x0040)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentAcceptHead_C_GenerateAttachmentList) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_GenerateAttachmentList");
static_assert(sizeof(MailAttachmentAcceptHead_C_GenerateAttachmentList) == 0x000110, "Wrong size on MailAttachmentAcceptHead_C_GenerateAttachmentList");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, StorageAddCount) == 0x000000, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::StorageAddCount' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, StorageCount) == 0x000004, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::StorageCount' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, WorkStorage) == 0x000008, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::WorkStorage' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, StorageCapacity) == 0x000010, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::StorageCapacity' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, AttachmentBody) == 0x000018, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::AttachmentBody' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Create_ReturnValue) == 0x000020, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, Temp_int_Array_Index_Variable) == 0x000038, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_GetCapacity_ReturnValue) == 0x000040, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_GetCapacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_isAnyDuplicate_Duplicate) == 0x000044, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_isAnyDuplicate_Duplicate' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000045, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000046, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000047, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_BooleanOR_ReturnValue_1) == 0x000049, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_GetItemsNum_ReturnValue) == 0x000054, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_GetItemsNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Array_Get_Item) == 0x000058, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Add_IntInt_ReturnValue_2) == 0x00009C, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_AddChild_ReturnValue) == 0x0000A0, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_GetStorage_ReturnValue) == 0x0000A8, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_isAnyOverFlow_Overflow) == 0x0000B0, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_isAnyOverFlow_Overflow' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, Temp_int_Loop_Counter_Variable_1) == 0x0000B4, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_AddChild_ReturnValue_1) == 0x0000B8, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C0, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000C4, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Array_Get_Item_1) == 0x0000C8, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_GenerateAttachmentList, CallFunc_Less_IntInt_ReturnValue_2) == 0x00010C, "Member 'MailAttachmentAcceptHead_C_GenerateAttachmentList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.isAnyOverFlow
// 0x0040 (0x0040 - 0x0000)
struct MailAttachmentAcceptHead_C_IsAnyOverFlow final
{
public:
	bool                                          Overflow;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86FC[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverflowType;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnFlag;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86FD[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86FE[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailAttachmentAcceptBody_C*            K2Node_DynamicCast_AsMail_Attachment_Accept_Body;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86FF[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOverflowType_Type;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverflow_OverFlow;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentAcceptHead_C_IsAnyOverFlow) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_IsAnyOverFlow");
static_assert(sizeof(MailAttachmentAcceptHead_C_IsAnyOverFlow) == 0x000040, "Wrong size on MailAttachmentAcceptHead_C_IsAnyOverFlow");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, Overflow) == 0x000000, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::Overflow' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, OverflowType) == 0x000004, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::OverflowType' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, ReturnFlag) == 0x000008, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::ReturnFlag' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, Temp_int_Variable) == 0x00000C, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, K2Node_DynamicCast_AsMail_Attachment_Accept_Body) == 0x000028, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::K2Node_DynamicCast_AsMail_Attachment_Accept_Body' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_GetOverflowType_Type) == 0x000034, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_GetOverflowType_Type' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_Max_ReturnValue) == 0x000038, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyOverFlow, CallFunc_IsOverflow_OverFlow) == 0x00003C, "Member 'MailAttachmentAcceptHead_C_IsAnyOverFlow::CallFunc_IsOverflow_OverFlow' has a wrong offset!");

// Function MailAttachmentAcceptHead.MailAttachmentAcceptHead_C.isAnyDuplicate
// 0x0048 (0x0048 - 0x0000)
struct MailAttachmentAcceptHead_C_IsAnyDuplicate final
{
public:
	bool                                          Duplicate;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8700[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OverflowType;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnFlag;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8701[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8702[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8703[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailAttachmentAcceptBody_C*            K2Node_DynamicCast_AsMail_Attachment_Accept_Body;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDuplicate_Duplicate;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8704[0x1];                                     // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOverflowType_Type;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailAttachmentAcceptHead_C_IsAnyDuplicate) == 0x000008, "Wrong alignment on MailAttachmentAcceptHead_C_IsAnyDuplicate");
static_assert(sizeof(MailAttachmentAcceptHead_C_IsAnyDuplicate) == 0x000048, "Wrong size on MailAttachmentAcceptHead_C_IsAnyDuplicate");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, Duplicate) == 0x000000, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::Duplicate' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, OverflowType) == 0x000004, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::OverflowType' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, ReturnFlag) == 0x000008, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::ReturnFlag' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00000C, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, Temp_int_Variable) == 0x000010, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentAcceptHead_C_IsAnyDuplicate, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'MailAttachmentAcceptHead_C_IsAnyDuplicate::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
