#pragma once

 

// Package: MailAttachmentsAcceptWindow

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "EAcceptWindowType_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.ExecuteUbergraph_MailAttachmentsAcceptWindow
// 0x0268 (0x0268 - 0x0000)
struct MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAcceptWindowType                             Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F09[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0A[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_ProductDetailMenu_C*               CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAcceptWindowType                             Temp_byte_Variable_6;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0B[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUMG_ProductDetailMenu_C* Sender)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_8;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0C[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailList_attachment_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F0D[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0E[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailAttachmentAcceptHead_C*            CallFunc_Create_ReturnValue_2;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0F[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F10[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBMailData>                    K2Node_CustomEvent_MailDatas;                      // 0x00B8(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F11[0x1];                                     // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F12[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0108(0x0028)()
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F13[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F14[0x1];                                     // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0150(0x0018)()
	bool                                          CallFunc_CheckEquip_Equip;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F15[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEquip_Equip_1;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F16[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0178(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F17[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F18[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01B0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAccountTypeMail_ReturnValue;            // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTransferMail_ReturnValue;               // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F19[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x01D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x01F8(0x0028)()
	class UUMG_ProductDetailMenu_C*               K2Node_CustomEvent_Sender;                         // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1A[0x3];                                     // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_5;                           // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1B[0x2];                                     // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_17;                              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1C[0x3];                                     // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1D[0x3];                                     // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow) == 0x000008, "Wrong alignment on MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow) == 0x000268, "Wrong size on MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, EntryPoint) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_bool_Variable) == 0x000004, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable) == 0x000005, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_1) == 0x000006, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable) == 0x000008, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_1) == 0x00000C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_2) == 0x000010, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_3) == 0x000014, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_4) == 0x000018, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_5) == 0x00001C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_6) == 0x000020, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_7) == 0x000024, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_bool_Variable_1) == 0x000028, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_2) == 0x000029, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_3) == 0x00002A, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_bool_Variable_2) == 0x00002B, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_4) == 0x00002C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_5) == 0x00002D, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Create_ReturnValue) == 0x000030, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_6) == 0x000038, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_8) == 0x00004C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_9) == 0x000050, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_10) == 0x000054, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_11) == 0x000058, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_12) == 0x00005C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_13) == 0x000060, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_14) == 0x000064, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_14' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_15) == 0x000068, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_15' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Create_ReturnValue_1) == 0x000070, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_16) == 0x000078, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_16' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x00007C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_7) == 0x000094, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Create_ReturnValue_2) == 0x000098, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000A0, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_PlaySE_ReturnValue) == 0x0000A4, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Event_IsDesignTime) == 0x0000A8, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_AddChild_ReturnValue) == 0x0000B0, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_CustomEvent_MailDatas) == 0x0000B8, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_CustomEvent_MailDatas' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000C8, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_bool_Variable_3) == 0x0000C9, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_8) == 0x0000CA, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_MakeStruct_Margin) == 0x0000CC, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_MakeStruct_SlateColor) == 0x0000E0, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_MakeStruct_SlateColor_1) == 0x000108, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000130, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_ComponentBoundEvent_bIsChecked) == 0x000131, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_ComponentBoundEvent_SelectedItem) == 0x000138, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_ComponentBoundEvent_SelectionType) == 0x000148, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_byte_Variable_9) == 0x000149, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_SwitchEnum_CmpSuccess) == 0x00014A, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Array_Length_ReturnValue) == 0x00014C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Conv_IntToText_ReturnValue) == 0x000150, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_CheckEquip_Equip) == 0x000168, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_CheckEquip_Equip' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_SwitchEnum_CmpSuccess_1) == 0x000169, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Array_Length_ReturnValue_1) == 0x00016C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_CheckEquip_Equip_1) == 0x000170, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_CheckEquip_Equip_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000178, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default) == 0x000190, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_GetCharacterName_ReturnValue) == 0x000198, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_GetCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_bool_Variable_4) == 0x0001A8, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Conv_StringToText_ReturnValue) == 0x0001B0, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default_1) == 0x0001C8, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_IsAccountTypeMail_ReturnValue) == 0x0001C9, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_IsAccountTypeMail_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default_2) == 0x0001CA, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_IsTransferMail_ReturnValue) == 0x0001CB, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_IsTransferMail_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default_3) == 0x0001CC, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_MakeStruct_SlateColor_2) == 0x0001D0, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_MakeStruct_SlateColor_3) == 0x0001F8, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_CustomEvent_Sender) == 0x000220, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_IsValid_ReturnValue) == 0x000228, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default_4) == 0x00022C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default_5) == 0x000230, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000234, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, K2Node_Select_Default_6) == 0x000235, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, Temp_int_Variable_17) == 0x000238, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::Temp_int_Variable_17' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_IsValid_ReturnValue_1) == 0x00023C, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Percent_IntInt_ReturnValue) == 0x000240, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Divide_IntInt_ReturnValue) == 0x000244, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_AddChildToGrid_ReturnValue) == 0x000248, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000250, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_Add_IntInt_ReturnValue_1) == 0x000254, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_PlayAnimation_ReturnValue) == 0x000258, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000260, "Member 'MailAttachmentsAcceptWindow_C_ExecuteUbergraph_MailAttachmentsAcceptWindow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.OnCloseDetail
// 0x0008 (0x0008 - 0x0000)
struct MailAttachmentsAcceptWindow_C_OnCloseDetail final
{
public:
	class UUMG_ProductDetailMenu_C*               Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_OnCloseDetail) == 0x000008, "Wrong alignment on MailAttachmentsAcceptWindow_C_OnCloseDetail");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_OnCloseDetail) == 0x000008, "Wrong size on MailAttachmentsAcceptWindow_C_OnCloseDetail");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_OnCloseDetail, Sender) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_OnCloseDetail::Sender' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'MailAttachmentsAcceptWindow_C_BndEvt__MailAttachmentsAcceptWindow_Cmb_ViewType_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_BndEvt__CB_OverflowSellItem_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_BndEvt__CB_DisappearToken_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.SetMailData
// 0x0010 (0x0010 - 0x0000)
struct MailAttachmentsAcceptWindow_C_SetMailData final
{
public:
	TArray<struct FSBMailData>                    Param_MailDatas;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_SetMailData) == 0x000008, "Wrong alignment on MailAttachmentsAcceptWindow_C_SetMailData");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_SetMailData) == 0x000010, "Wrong size on MailAttachmentsAcceptWindow_C_SetMailData");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_SetMailData, Param_MailDatas) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_SetMailData::Param_MailDatas' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MailAttachmentsAcceptWindow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_PreConstruct) == 0x000001, "Wrong alignment on MailAttachmentsAcceptWindow_C_PreConstruct");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_PreConstruct) == 0x000001, "Wrong size on MailAttachmentsAcceptWindow_C_PreConstruct");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.GenerateAttachmentGrid
// 0x01F8 (0x01F8 - 0x0000)
struct MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid final
{
public:
	int32                                         AddNum;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailList_attachment_C*                 CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetOverflowIconStatus_IconStatus;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetOverflowIconStatus_MarkFlag;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1F[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailData                            CallFunc_Array_Get_Item;                           // 0x0060(0x0190)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid) == 0x000008, "Wrong alignment on MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid");
static_assert(sizeof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid) == 0x0001F8, "Wrong size on MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, AddNum) == 0x000000, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::AddNum' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, Temp_int_Variable) == 0x000010, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, K2Node_MakeStruct_Margin) == 0x000014, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Create_ReturnValue) == 0x000028, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_GetOverflowIconStatus_IconStatus) == 0x000030, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_GetOverflowIconStatus_IconStatus' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_GetOverflowIconStatus_MarkFlag) == 0x000040, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_GetOverflowIconStatus_MarkFlag' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Percent_IntInt_ReturnValue) == 0x000048, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Divide_IntInt_ReturnValue) == 0x00004C, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_AddChildToGrid_ReturnValue) == 0x000050, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Array_Get_Item) == 0x000060, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid, CallFunc_Less_IntInt_ReturnValue) == 0x0001F0, "Member 'MailAttachmentsAcceptWindow_C_GenerateAttachmentGrid::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MailAttachmentsAcceptWindow.MailAttachmentsAcceptWindow_C.GenerateStorageList
// 0x03E8 (0x03E8 - 0x0000)
struct MailAttachmentsAcceptWindow_C_GenerateStorageList final
{
public:
	struct FSBMailAttachment                      Attachment;                                        // 0x0000(0x0040)(Edit, BlueprintVisible)
	class UMailAttachmentAcceptHead_C*            Storage;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StorageNo;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F20[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UMailAttachmentAcceptHead_C*> StorageData;                                       // 0x0050(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	ESBRewardItemType                             Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
