#pragma once

 

// Package: MailListAttachmentAcceptedResult

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "EAcceptWindowType_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MailListAttachmentAcceptedResult.MailListAttachmentAcceptedResult_C.ExecuteUbergraph_MailListAttachmentAcceptedResult
// 0x08D8 (0x08D8 - 0x0000)
struct MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAcceptWindowType                             Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C1[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C2[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C3[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C4[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C5[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C6[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C7[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87C8[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C9[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_2;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_3;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_4;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBAchievementRewardData               K2Node_CustomEvent_Data_1;                         // 0x00C8(0x0070)()
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_5;                     // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_4;                   // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment;                // 0x0150(0x0040)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CA[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAchievementRewardedStampData        CallFunc_Array_Get_Item_1;                         // 0x0194(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_1;              // 0x01A0(0x0040)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CB[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_2;              // 0x01E8(0x0040)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CC[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_3;              // 0x0230(0x0040)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CD[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_4;              // 0x0278(0x0040)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CE[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_5;              // 0x02C0(0x0040)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87CF[0x7];                                     // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_6;              // 0x0308(0x0040)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D0[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_7;              // 0x0350(0x0040)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D1[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_8;              // 0x0398(0x0040)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D2[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_9;              // 0x03E0(0x0040)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D3[0x3];                                     // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOwnItemInfo                           CallFunc_Array_Get_Item_2;                         // 0x0428(0x0118)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0545(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0546(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0547(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_6;                     // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_5;                   // 0x0550(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D4[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_7;                     // 0x0560(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87D5[0x4];                                     // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_6;                   // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCharacterToken                      CallFunc_Array_Get_Item_3;                         // 0x0578(0x000C)(NoDestructor)
	int32                                         Temp_int_Variable_6;                               // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMailAttachment                      K2Node_MakeStruct_SBMailAttachment_10;             // 0x0588(0x0040)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x05C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x05CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_7;                               // 0x05CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D6[0x3];                                     // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_9;                               // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailListAttachmentContainerBox_C*      K2Node_DynamicCast_AsMail_List_Attachment_Container_Box; // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D7[0x2];                                     // 0x05FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_8;                     // 0x0600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D8[0x7];                                     // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_7;                   // 0x0610(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87D9[0x6];                                     // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_9;                     // 0x0620(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87DA[0x7];                                     // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_8;                   // 0x0630(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_10;                    // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87DB[0x7];                                     // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_9;                   // 0x0648(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0650(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0661(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87DC[0x6];                                     // 0x0662(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMailListAttachmentContainerBox_C*      CallFunc_Create_ReturnValue_11;                    // 0x0668(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87DD[0x3];                                     // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_10;                  // 0x0678(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0680(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x06A8(0x0028)()
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87DE[0x4];                                     // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailRewardData                      K2Node_CustomEvent_Data;                           // 0x06D8(0x0180)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_87DF[0x3];                                     // 0x0859(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_11;                  // 0x0860(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0868(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0890(0x0028)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x08B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x08B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87E0[0x2];                                     // 0x08BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_11;                              // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87E1[0x4];                                     // 0x08C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult) == 0x000008, "Wrong alignment on MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult");
static_assert(sizeof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult) == 0x0008D8, "Wrong size on MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, EntryPoint) == 0x000000, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::EntryPoint' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable) == 0x000014, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_1) == 0x000018, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_byte_Variable) == 0x000020, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Array_Index_Variable) == 0x000028, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue) == 0x000030, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_2) == 0x000038, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Conv_IntToByte_ReturnValue) == 0x000040, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000041, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_3) == 0x000048, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00004C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_GetValidValue_ReturnValue) == 0x00004D, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_SwitchEnum_CmpSuccess) == 0x00004E, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Add_IntInt_ReturnValue_2) == 0x000054, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_MakeLiteralByte_ReturnValue) == 0x00005C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_4) == 0x000060, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000064, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_bool_Variable) == 0x000065, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Loop_Counter_Variable_2) == 0x000068, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Add_IntInt_ReturnValue_3) == 0x00006C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Array_Index_Variable_2) == 0x000070, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue) == 0x000080, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_5) == 0x000088, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00008C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Add_IntInt_ReturnValue_4) == 0x000090, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_2) == 0x000098, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_3) == 0x0000A0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_1) == 0x0000A8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_2) == 0x0000B0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_4) == 0x0000B8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_3) == 0x0000C0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_CustomEvent_Data_1) == 0x0000C8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_5) == 0x000138, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_4) == 0x000140, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Get_Item) == 0x000148, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Length_ReturnValue) == 0x00014C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment) == 0x000150, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Less_IntInt_ReturnValue) == 0x000190, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Get_Item_1) == 0x000194, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Length_ReturnValue_1) == 0x00019C, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_1) == 0x0001A0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_2) == 0x0001E8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Greater_IntInt_ReturnValue) == 0x000228, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_3) == 0x000230, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000270, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_4) == 0x000278, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_4' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0002B8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_5) == 0x0002C0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_5' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000300, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_6) == 0x000308, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_6' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000348, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_7) == 0x000350, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_7' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000390, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_8) == 0x000398, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_8' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x0003D8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_9) == 0x0003E0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_9' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x000420, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Length_ReturnValue_2) == 0x000424, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Get_Item_2) == 0x000428, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Length_ReturnValue_3) == 0x000540, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Less_IntInt_ReturnValue_2) == 0x000544, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue) == 0x000545, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_1) == 0x000546, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_2) == 0x000547, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_6) == 0x000548, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_5) == 0x000550, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_3) == 0x000558, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_7) == 0x000560, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Array_Index_Variable_3) == 0x000568, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_6) == 0x000570, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Array_Get_Item_3) == 0x000578, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_6) == 0x000584, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_MakeStruct_SBMailAttachment_10) == 0x000588, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_MakeStruct_SBMailAttachment_10' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_4) == 0x0005C8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_5) == 0x0005C9, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_6) == 0x0005CA, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_7) == 0x0005CB, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_7) == 0x0005CC, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_GetChildrenCount_ReturnValue) == 0x0005D0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Subtract_IntInt_ReturnValue) == 0x0005D4, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_8) == 0x0005D8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_8) == 0x0005DC, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_9) == 0x0005E0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, Temp_int_Variable_10) == 0x0005E4, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_GetChildAt_ReturnValue) == 0x0005E8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_DynamicCast_AsMail_List_Attachment_Container_Box) == 0x0005F0, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_DynamicCast_AsMail_List_Attachment_Container_Box' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, K2Node_DynamicCast_bSuccess) == 0x0005F8, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0005F9, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Add_IntInt_ReturnValue_5) == 0x0005FC, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_Create_ReturnValue_8) == 0x000600, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_Create_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_IsValid_ReturnValue_9) == 0x000608, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult, CallFunc_AddChild_ReturnValue_7) == 0x000610, "Member 'MailListAttachmentAcceptedResult_C_ExecuteUbergraph_MailListAttachmentAcceptedResult::CallFunc_AddChild_ReturnValue_7' has a wrong offset!");
