#pragma once

 

// Package: MapEditWindowPin

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MapEditWindowPin.MapEditWindowPin_C.OnPinVisible__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowPin_C_OnPinVisible__DelegateSignature final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowPin_C_OnPinVisible__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowPin_C_OnPinVisible__DelegateSignature");
static_assert(sizeof(MapEditWindowPin_C_OnPinVisible__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowPin_C_OnPinVisible__DelegateSignature");
static_assert(offsetof(MapEditWindowPin_C_OnPinVisible__DelegateSignature, IsOn) == 0x000000, "Member 'MapEditWindowPin_C_OnPinVisible__DelegateSignature::IsOn' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.ExecuteUbergraph_MapEditWindowPin
// 0x0008 (0x0008 - 0x0000)
struct MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin) == 0x000004, "Wrong alignment on MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin");
static_assert(sizeof(MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin) == 0x000008, "Wrong size on MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin");
static_assert(offsetof(MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin, EntryPoint) == 0x000000, "Member 'MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin::EntryPoint' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000004, "Member 'MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin, K2Node_ComponentBoundEvent_bIsChecked) == 0x000005, "Member 'MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin, K2Node_Event_IsDesignTime) == 0x000006, "Member 'MapEditWindowPin_C_ExecuteUbergraph_MapEditWindowPin::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowPin_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowPin_C_PreConstruct) == 0x000001, "Wrong alignment on MapEditWindowPin_C_PreConstruct");
static_assert(sizeof(MapEditWindowPin_C_PreConstruct) == 0x000001, "Wrong size on MapEditWindowPin_C_PreConstruct");
static_assert(offsetof(MapEditWindowPin_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MapEditWindowPin_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxOFF_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MapEditWindowPin_C_BndEvt__MapEditPinWindow_PinCheckBoxON_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.SetTitle
// 0x0004 (0x0004 - 0x0000)
struct MapEditWindowPin_C_SetTitle final
{
public:
	int32                                         InTextID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowPin_C_SetTitle) == 0x000004, "Wrong alignment on MapEditWindowPin_C_SetTitle");
static_assert(sizeof(MapEditWindowPin_C_SetTitle) == 0x000004, "Wrong size on MapEditWindowPin_C_SetTitle");
static_assert(offsetof(MapEditWindowPin_C_SetTitle, InTextID) == 0x000000, "Member 'MapEditWindowPin_C_SetTitle::InTextID' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.Set Pin Visible
// 0x0002 (0x0002 - 0x0000)
struct MapEditWindowPin_C_Set_Pin_Visible final
{
public:
	bool                                          PinChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowPin_C_Set_Pin_Visible) == 0x000001, "Wrong alignment on MapEditWindowPin_C_Set_Pin_Visible");
static_assert(sizeof(MapEditWindowPin_C_Set_Pin_Visible) == 0x000002, "Wrong size on MapEditWindowPin_C_Set_Pin_Visible");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible, PinChecked) == 0x000000, "Member 'MapEditWindowPin_C_Set_Pin_Visible::PinChecked' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'MapEditWindowPin_C_Set_Pin_Visible::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.Set Pin Visible ON
// 0x0005 (0x0005 - 0x0000)
struct MapEditWindowPin_C_Set_Pin_Visible_ON final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowPin_C_Set_Pin_Visible_ON) == 0x000001, "Wrong alignment on MapEditWindowPin_C_Set_Pin_Visible_ON");
static_assert(sizeof(MapEditWindowPin_C_Set_Pin_Visible_ON) == 0x000005, "Wrong size on MapEditWindowPin_C_Set_Pin_Visible_ON");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_ON, IsOn) == 0x000000, "Member 'MapEditWindowPin_C_Set_Pin_Visible_ON::IsOn' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_ON, Temp_bool_Variable) == 0x000001, "Member 'MapEditWindowPin_C_Set_Pin_Visible_ON::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_ON, Temp_byte_Variable) == 0x000002, "Member 'MapEditWindowPin_C_Set_Pin_Visible_ON::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_ON, Temp_byte_Variable_1) == 0x000003, "Member 'MapEditWindowPin_C_Set_Pin_Visible_ON::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_ON, K2Node_Select_Default) == 0x000004, "Member 'MapEditWindowPin_C_Set_Pin_Visible_ON::K2Node_Select_Default' has a wrong offset!");

// Function MapEditWindowPin.MapEditWindowPin_C.Set Pin Visible OFF
// 0x0005 (0x0005 - 0x0000)
struct MapEditWindowPin_C_Set_Pin_Visible_OFF final
{
public:
	bool                                          IsOFF;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowPin_C_Set_Pin_Visible_OFF) == 0x000001, "Wrong alignment on MapEditWindowPin_C_Set_Pin_Visible_OFF");
static_assert(sizeof(MapEditWindowPin_C_Set_Pin_Visible_OFF) == 0x000005, "Wrong size on MapEditWindowPin_C_Set_Pin_Visible_OFF");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_OFF, IsOFF) == 0x000000, "Member 'MapEditWindowPin_C_Set_Pin_Visible_OFF::IsOFF' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_OFF, Temp_bool_Variable) == 0x000001, "Member 'MapEditWindowPin_C_Set_Pin_Visible_OFF::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_OFF, Temp_byte_Variable) == 0x000002, "Member 'MapEditWindowPin_C_Set_Pin_Visible_OFF::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_OFF, Temp_byte_Variable_1) == 0x000003, "Member 'MapEditWindowPin_C_Set_Pin_Visible_OFF::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowPin_C_Set_Pin_Visible_OFF, K2Node_Select_Default) == 0x000004, "Member 'MapEditWindowPin_C_Set_Pin_Visible_OFF::K2Node_Select_Default' has a wrong offset!");

}

