#pragma once

 

// Package: MapEditWindowSize

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MapEditWindowSize.MapEditWindowSize_C.OnWindowSizeChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature) == 0x000004, "Wrong alignment on MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature) == 0x000004, "Wrong size on MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature, Number) == 0x000000, "Member 'MapEditWindowSize_C_OnWindowSizeChanged__DelegateSignature::Number' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.ExecuteUbergraph_MapEditWindowSize
// 0x000C (0x000C - 0x0000)
struct MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize) == 0x000004, "Wrong alignment on MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize");
static_assert(sizeof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize) == 0x00000C, "Wrong size on MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize");
static_assert(offsetof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize, EntryPoint) == 0x000000, "Member 'MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize::EntryPoint' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize, K2Node_ComponentBoundEvent_bIsChecked_3) == 0x000004, "Member 'MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize::K2Node_ComponentBoundEvent_bIsChecked_3' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize, K2Node_ComponentBoundEvent_bIsChecked_2) == 0x000005, "Member 'MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize::K2Node_ComponentBoundEvent_bIsChecked_2' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000006, "Member 'MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize, K2Node_ComponentBoundEvent_bIsChecked) == 0x000007, "Member 'MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize, K2Node_Event_IsDesignTime) == 0x000008, "Member 'MapEditWindowSize_C_ExecuteUbergraph_MapEditWindowSize::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowSize_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_PreConstruct) == 0x000001, "Wrong alignment on MapEditWindowSize_C_PreConstruct");
static_assert(sizeof(MapEditWindowSize_C_PreConstruct) == 0x000001, "Wrong size on MapEditWindowSize_C_PreConstruct");
static_assert(offsetof(MapEditWindowSize_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MapEditWindowSize_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size4_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size3_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size2_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'MapEditWindowSize_C_BndEvt__MapEditWindowSize_Size1_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.SetTitle
// 0x0004 (0x0004 - 0x0000)
struct MapEditWindowSize_C_SetTitle final
{
public:
	int32                                         InTextID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowSize_C_SetTitle) == 0x000004, "Wrong alignment on MapEditWindowSize_C_SetTitle");
static_assert(sizeof(MapEditWindowSize_C_SetTitle) == 0x000004, "Wrong size on MapEditWindowSize_C_SetTitle");
static_assert(offsetof(MapEditWindowSize_C_SetTitle, InTextID) == 0x000000, "Member 'MapEditWindowSize_C_SetTitle::InTextID' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize
// 0x0008 (0x0008 - 0x0000)
struct MapEditWindowSize_C_SetCheckWindowSize final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapEditWindowSize_C_SetCheckWindowSize) == 0x000004, "Wrong alignment on MapEditWindowSize_C_SetCheckWindowSize");
static_assert(sizeof(MapEditWindowSize_C_SetCheckWindowSize) == 0x000008, "Wrong size on MapEditWindowSize_C_SetCheckWindowSize");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize, Param_Index) == 0x000000, "Member 'MapEditWindowSize_C_SetCheckWindowSize::Param_Index' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'MapEditWindowSize_C_SetCheckWindowSize::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000005, "Member 'MapEditWindowSize_C_SetCheckWindowSize::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000006, "Member 'MapEditWindowSize_C_SetCheckWindowSize::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000007, "Member 'MapEditWindowSize_C_SetCheckWindowSize::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize1
// 0x0005 (0x0005 - 0x0000)
struct MapEditWindowSize_C_SetCheckWindowSize1 final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowSize_C_SetCheckWindowSize1) == 0x000001, "Wrong alignment on MapEditWindowSize_C_SetCheckWindowSize1");
static_assert(sizeof(MapEditWindowSize_C_SetCheckWindowSize1) == 0x000005, "Wrong size on MapEditWindowSize_C_SetCheckWindowSize1");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize1, IsOn) == 0x000000, "Member 'MapEditWindowSize_C_SetCheckWindowSize1::IsOn' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize1, Temp_bool_Variable) == 0x000001, "Member 'MapEditWindowSize_C_SetCheckWindowSize1::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize1, Temp_byte_Variable) == 0x000002, "Member 'MapEditWindowSize_C_SetCheckWindowSize1::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize1, Temp_byte_Variable_1) == 0x000003, "Member 'MapEditWindowSize_C_SetCheckWindowSize1::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize1, K2Node_Select_Default) == 0x000004, "Member 'MapEditWindowSize_C_SetCheckWindowSize1::K2Node_Select_Default' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize2
// 0x0005 (0x0005 - 0x0000)
struct MapEditWindowSize_C_SetCheckWindowSize2 final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowSize_C_SetCheckWindowSize2) == 0x000001, "Wrong alignment on MapEditWindowSize_C_SetCheckWindowSize2");
static_assert(sizeof(MapEditWindowSize_C_SetCheckWindowSize2) == 0x000005, "Wrong size on MapEditWindowSize_C_SetCheckWindowSize2");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize2, IsOn) == 0x000000, "Member 'MapEditWindowSize_C_SetCheckWindowSize2::IsOn' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize2, Temp_bool_Variable) == 0x000001, "Member 'MapEditWindowSize_C_SetCheckWindowSize2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize2, Temp_byte_Variable) == 0x000002, "Member 'MapEditWindowSize_C_SetCheckWindowSize2::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize2, Temp_byte_Variable_1) == 0x000003, "Member 'MapEditWindowSize_C_SetCheckWindowSize2::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize2, K2Node_Select_Default) == 0x000004, "Member 'MapEditWindowSize_C_SetCheckWindowSize2::K2Node_Select_Default' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize3
// 0x0005 (0x0005 - 0x0000)
struct MapEditWindowSize_C_SetCheckWindowSize3 final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowSize_C_SetCheckWindowSize3) == 0x000001, "Wrong alignment on MapEditWindowSize_C_SetCheckWindowSize3");
static_assert(sizeof(MapEditWindowSize_C_SetCheckWindowSize3) == 0x000005, "Wrong size on MapEditWindowSize_C_SetCheckWindowSize3");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize3, IsOn) == 0x000000, "Member 'MapEditWindowSize_C_SetCheckWindowSize3::IsOn' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize3, Temp_bool_Variable) == 0x000001, "Member 'MapEditWindowSize_C_SetCheckWindowSize3::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize3, Temp_byte_Variable) == 0x000002, "Member 'MapEditWindowSize_C_SetCheckWindowSize3::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize3, Temp_byte_Variable_1) == 0x000003, "Member 'MapEditWindowSize_C_SetCheckWindowSize3::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize3, K2Node_Select_Default) == 0x000004, "Member 'MapEditWindowSize_C_SetCheckWindowSize3::K2Node_Select_Default' has a wrong offset!");

// Function MapEditWindowSize.MapEditWindowSize_C.SetCheckWindowSize4
// 0x0005 (0x0005 - 0x0000)
struct MapEditWindowSize_C_SetCheckWindowSize4 final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapEditWindowSize_C_SetCheckWindowSize4) == 0x000001, "Wrong alignment on MapEditWindowSize_C_SetCheckWindowSize4");
static_assert(sizeof(MapEditWindowSize_C_SetCheckWindowSize4) == 0x000005, "Wrong size on MapEditWindowSize_C_SetCheckWindowSize4");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize4, IsOn) == 0x000000, "Member 'MapEditWindowSize_C_SetCheckWindowSize4::IsOn' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize4, Temp_bool_Variable) == 0x000001, "Member 'MapEditWindowSize_C_SetCheckWindowSize4::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize4, Temp_byte_Variable) == 0x000002, "Member 'MapEditWindowSize_C_SetCheckWindowSize4::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize4, Temp_byte_Variable_1) == 0x000003, "Member 'MapEditWindowSize_C_SetCheckWindowSize4::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MapEditWindowSize_C_SetCheckWindowSize4, K2Node_Select_Default) == 0x000004, "Member 'MapEditWindowSize_C_SetCheckWindowSize4::K2Node_Select_Default' has a wrong offset!");

}

