#pragma once

 

// Package: MapWidget_Map

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "QuestDetail_FinishStatus_structs.hpp"


namespace SDK::Params
{

// Function MapWidget_Map.MapWidget_Map_C.OnChangeToRegionMap__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature final
{
public:
	class FString                                 InRegionMapId;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature) == 0x000008, "Wrong alignment on MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature) == 0x000010, "Wrong size on MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature, InRegionMapId) == 0x000000, "Member 'MapWidget_Map_C_OnChangeToRegionMap__DelegateSignature::InRegionMapId' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnEndSavePinInfo__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature final
{
public:
	bool                                          IsResultSuccess;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMapErrorCode                               ErrorCode;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature) == 0x000001, "Wrong alignment on MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature) == 0x000002, "Wrong size on MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature, IsResultSuccess) == 0x000000, "Member 'MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature::IsResultSuccess' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature, ErrorCode) == 0x000001, "Member 'MapWidget_Map_C_OnEndSavePinInfo__DelegateSignature::ErrorCode' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnPinnedPinClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature final
{
public:
	class UMapWidget_MapPinnedPin_C*              InPinnedPin;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature) == 0x000008, "Wrong alignment on MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature) == 0x000008, "Wrong size on MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature, InPinnedPin) == 0x000000, "Member 'MapWidget_Map_C_OnPinnedPinClicked__DelegateSignature::InPinnedPin' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnShowErrorMessage__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct MapWidget_Map_C_OnShowErrorMessage__DelegateSignature final
{
public:
	int32                                         InMessageTextId;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnShowErrorMessage__DelegateSignature) == 0x000004, "Wrong alignment on MapWidget_Map_C_OnShowErrorMessage__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnShowErrorMessage__DelegateSignature) == 0x000004, "Wrong size on MapWidget_Map_C_OnShowErrorMessage__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnShowErrorMessage__DelegateSignature, InMessageTextId) == 0x000000, "Member 'MapWidget_Map_C_OnShowErrorMessage__DelegateSignature::InMessageTextId' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnSetMapScrollFunctionOnOff__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature final
{
public:
	bool                                          InIsScrollFunctionOn;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InScrollHVLength;                                  // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature) == 0x000004, "Wrong alignment on MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature) == 0x00000C, "Wrong size on MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature, InIsScrollFunctionOn) == 0x000000, "Member 'MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature::InIsScrollFunctionOn' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature, InScrollHVLength) == 0x000004, "Member 'MapWidget_Map_C_OnSetMapScrollFunctionOnOff__DelegateSignature::InScrollHVLength' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnUpdatePlayerIconPosition__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature final
{
public:
	struct FVector2D                              MapPosition;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ViewScale;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature) == 0x000004, "Wrong alignment on MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature) == 0x00000C, "Wrong size on MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature, MapPosition) == 0x000000, "Member 'MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature::MapPosition' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature, ViewScale) == 0x000008, "Member 'MapWidget_Map_C_OnUpdatePlayerIconPosition__DelegateSignature::ViewScale' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnInitPlayerIcon__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature final
{
public:
	struct FVector2D                              PlayerPosition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapSize;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature) == 0x000004, "Wrong alignment on MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature) == 0x000010, "Wrong size on MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature, PlayerPosition) == 0x000000, "Member 'MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature::PlayerPosition' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature, MapSize) == 0x000008, "Member 'MapWidget_Map_C_OnInitPlayerIcon__DelegateSignature::MapSize' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.OnQuestDetailForMapChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature) == 0x000001, "Wrong alignment on MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature");
static_assert(sizeof(MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature) == 0x000001, "Wrong size on MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature");
static_assert(offsetof(MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature, bIsOpen) == 0x000000, "Member 'MapWidget_Map_C_OnQuestDetailForMapChanged__DelegateSignature::bIsOpen' has a wrong offset!");

// Function MapWidget_Map.MapWidget_Map_C.ExecuteUbergraph_MapWidget_Map
// 0x0780 (0x0780 - 0x0000)
struct MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMapWidget_MapPinnedPin_C* InPinnedPin)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result, ESBMapErrorCode ErrorCode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMapWidget_MapPinnedPin_C* InPinnedPin)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ASBInterruptQuestInstance*        K2Node_CustomEvent_InInstance_1;                   // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGameInstance*                        K2Node_DynamicCast_AsSBGame_Instance;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A4[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBInterruptQuestManager*               CallFunc_GetInterruptQuestManager_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ASBInterruptQuestInstance*        K2Node_CustomEvent_InInstance;                     // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A5[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGameInstance*                        K2Node_DynamicCast_AsSBGame_Instance_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A6[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ASBInterruptQuestInstance* InInstance)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14A7[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBInterruptQuestManager*               CallFunc_GetInterruptQuestManager_ReturnValue_1;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A8[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EQuestDetail_FinishStatus FinishStatus, int32 QuestIndex)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x00BC(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMapErrorCode                               K2Node_CustomEvent_ErrorCode;                      // 0x00BD(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A9[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapWidget_MapPinnedPin_C*              K2Node_CustomEvent_InPinnedPin_1;                  // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14AA[0x6];                                     // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapWidget_MapPinnedPin_C*              K2Node_CustomEvent_InPinnedPin;                    // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMapIconZOrder_ReturnValue;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14AB[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestDetailForMap_C*                   CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14AC[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapWidget_MapPinnedPin_C*              K2Node_CustomEvent_Target_1;                       // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapWidget_MapPinnedPin_C*              K2Node_CustomEvent_Target;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14AD[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14AE[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSavingMapPinInfo_IsSavingMapPinInfo;    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14AF[0x5];                                     // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAdminComponent*                CallFunc_GetSBPlayerAdminComponent_ReturnValue;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B0[0x2];                                     // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMousePositionScaledByDPI_LocationX;    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMousePositionScaledByDPI_LocationY;    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMousePositionScaledByDPI_ReturnValue;  // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B1[0x3];                                     // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_CalcWorldPosition_WorldLocation;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAdminComponent*                CallFunc_GetSBPlayerAdminComponent_ReturnValue_1;  // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAdminFuncUnlocked_ReturnValue;          // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B2[0x1];                                     // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B3[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConvertParentMapId_ReturnValue;           // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWorldMapFlag_IsWorldMap;                // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result;                         // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B4[0x2];                                     // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerWarpComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestWarp_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B5[0x6];                                     // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMapBGConfigTableRow                 K2Node_CustomEvent_InMapBGConfig;                  // 0x01D0(0x0078)()
	class FString                                 K2Node_CustomEvent_InMapId;                        // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIBlocker_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ASBInterruptQuestInstance* InInstance)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B6[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0280(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B7[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B8[0x3];                                     // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14B9[0x4];                                     // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14BA[0x2];                                     // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_6;            // 0x0344(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0354(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x035C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMapWidget_Cloud_C*>             K2Node_MakeArray_Array;                            // 0x0370(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMapWidget_Cloud_C*                     CallFunc_Array_Get_Item;                           // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14BB[0x3];                                     // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14BC[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14BD[0x3];                                     // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x03A4(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x03B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14BE[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMapBGConfigTableRow                 CallFunc_FindMapBGConfigDB_OutMapBGConfigTableRow; // 0x03C0(0x0078)()
	bool                                          CallFunc_FindMapBGConfigDB_ReturnValue;            // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14BF[0x7];                                     // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMapBGConfigTableRow                 CallFunc_GetLoadData_LoadData;                     // 0x0440(0x0078)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C0[0x4];                                     // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMapBGConfigTableRow                 CallFunc_GetLoadData_LoadData_1;                   // 0x04E0(0x0078)()
	struct FSBMapBGConfigTableRow                 CallFunc_GetLoadData_LoadData_2;                   // 0x0558(0x0078)()
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMapBGConfigTableRow                 CallFunc_GetLoadData_LoadData_3;                   // 0x05F8(0x0078)()
	bool                                          CallFunc_GetMapBGConfigRowName_OutIsValid;         // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C1[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMapBGConfigRowName_OutRowName;         // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_5;                        // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_5;                        // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0692(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0693(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C2[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMapBGConfigTableRow                 CallFunc_GetLoadData_LoadData_4;                   // 0x0698(0x0078)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C3[0x7];                                     // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0718(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_Dialog_C*                           CallFunc_CreateDialog_OutputPin;                   // 0x0728(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C4[0x3];                                     // 0x0731(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InQuestId;                      // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestDetail_FinishStatus                     K2Node_CustomEvent_FinishStatus;                   // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C5[0x3];                                     // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_QuestIndex;                     // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C6[0x7];                                     // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMapBodySize_ReturnValue;               // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMapBodySize_ReturnValue_1;             // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_6;                        // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_6;                        // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_8;          // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14C7[0x3];                                     // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map) == 0x000008, "Wrong alignment on MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map");
static_assert(sizeof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map) == 0x000780, "Wrong size on MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, EntryPoint) == 0x000000, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::EntryPoint' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_InInstance_1) == 0x000048, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_InInstance_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_AsSBGame_Instance) == 0x000050, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_AsSBGame_Instance' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetInterruptQuestManager_ReturnValue) == 0x000060, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetInterruptQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_InInstance) == 0x000068, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_InInstance' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetGameInstance_ReturnValue_1) == 0x000078, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_AsSBGame_Instance_1) == 0x000080, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_AsSBGame_Instance_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CreateDelegate_OutputDelegate_3) == 0x00008C, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetInterruptQuestManager_ReturnValue_1) == 0x0000A0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetInterruptQuestManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000AC, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_Result_1) == 0x0000BC, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_ErrorCode) == 0x0000BD, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_InPinnedPin_1) == 0x0000C0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_InPinnedPin_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000C8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue_3) == 0x0000D1, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_InPinnedPin) == 0x0000D8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_InPinnedPin' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetMapIconZOrder_ReturnValue) == 0x0000E0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetMapIconZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000F0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_Target_1) == 0x0000F8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_Target_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_Target) == 0x000100, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, Temp_float_Variable) == 0x000108, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetPlayerController_ReturnValue) == 0x000110, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000118, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetPlayerController_ReturnValue_1) == 0x000128, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_AsSBPlayer_Controller_1) == 0x000130, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_AsSBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_DynamicCast_bSuccess_3) == 0x000138, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsSavingMapPinInfo_IsSavingMapPinInfo) == 0x000139, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsSavingMapPinInfo_IsSavingMapPinInfo' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_Not_PreBool_ReturnValue) == 0x00013A, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetPlayerController_ReturnValue_2) == 0x000140, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetSBPlayerAdminComponent_ReturnValue) == 0x000148, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetSBPlayerAdminComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue_4) == 0x000150, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue_5) == 0x000151, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetMousePositionScaledByDPI_LocationX) == 0x000154, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetMousePositionScaledByDPI_LocationX' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetMousePositionScaledByDPI_LocationY) == 0x000158, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetMousePositionScaledByDPI_LocationY' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetMousePositionScaledByDPI_ReturnValue) == 0x00015C, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetMousePositionScaledByDPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000160, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_MakeVector2D_ReturnValue) == 0x000170, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_CalcWorldPosition_WorldLocation) == 0x000178, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_CalcWorldPosition_WorldLocation' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetSBPlayerAdminComponent_ReturnValue_1) == 0x000180, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetSBPlayerAdminComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsValid_ReturnValue_6) == 0x000188, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsAdminFuncUnlocked_ReturnValue) == 0x000189, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsAdminFuncUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, Temp_bool_Variable) == 0x00018A, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, Temp_struct_Variable) == 0x00018C, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_ConvertParentMapId_ReturnValue) == 0x000198, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_ConvertParentMapId_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001A8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_IsWorldMapFlag_IsWorldMap) == 0x0001A9, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_IsWorldMapFlag_IsWorldMap' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001AA, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_Result) == 0x0001AB, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, Temp_bool_Variable_1) == 0x0001AC, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001AD, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0001B0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_GetComponentByClass_ReturnValue) == 0x0001B8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_Conv_StringToName_ReturnValue) == 0x0001C0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, CallFunc_RequestWarp_ReturnValue) == 0x0001C8, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::CallFunc_RequestWarp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_Event_IsDesignTime) == 0x0001C9, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_InMapBGConfig) == 0x0001D0, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_InMapBGConfig' has a wrong offset!");
static_assert(offsetof(MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map, K2Node_CustomEvent_InMapId) == 0x000248, "Member 'MapWidget_Map_C_ExecuteUbergraph_MapWidget_Map::K2Node_CustomEvent_InMapId' has a wrong offset!");
