#pragma once

 

// Package: MiniMapIcons

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MiniMapIcons.MiniMapIcons_C.ExecuteUbergraph_MiniMapIcons
// 0x05B8 (0x05B8 - 0x0000)
struct MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 InRetCode, bool bInIsExpiredStickerWeapons, TArray<class FString>& InExpiredStickerWeaponUniqueIds, struct FSBExpiredEquipmentData& InDirtyExpiredEquipmentData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bWasSuccessful)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_4;                       // 0x0064(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMapErrorCode                               K2Node_CustomEvent_ErrorCode_1;                    // 0x0065(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_715B[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715C[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DefaultGameInstance_C*              K2Node_DynamicCast_AsBP_Default_Game_Instance;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715D[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMiniMapIconPartyMember_C*              K2Node_CustomEvent_PartyMember_2;                  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DefaultGameInstance_C*              K2Node_DynamicCast_AsBP_Default_Game_Instance_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715E[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMiniMapIconPartyMember_C*              K2Node_CustomEvent_PartyMember_1;                  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMiniMapIconPartyMember_C*              K2Node_CustomEvent_PartyMember;                    // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDead;                         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_715F[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result_3;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAcceptedQuestErrorCode                       K2Node_CustomEvent_ErrorCode;                      // 0x00D9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7160[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode_2;                      // 0x00DC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceptedQuestInfo                     K2Node_CustomEvent_AcceptedQuestInfo;              // 0x00E0(0x0060)(ConstParm)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_2;                       // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7161[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_QuestIndex_1;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_QuestIndex;                     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestCompleteResult                          K2Node_CustomEvent_CompleteResult;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7162[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailRewardData                      K2Node_CustomEvent_MailRewardData;                 // 0x0160(0x0180)(ConstParm)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7163[0x3];                                     // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceptedQuestInfo                     K2Node_CustomEvent_PrevAcceptedQuestInfo;          // 0x02E8(0x0060)(ConstParm)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7164[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBCharacterData*                       CallFunc_GetCharacterData_ReturnValue;             // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_2;        // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMiniMapIconType                            Temp_byte_Variable;                                // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7165[0x2];                                     // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UMiniMapIconPartyMember_C* PartyMember, bool IsDead)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0374(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7166[0x4];                                     // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUnlockedQuestInfo>             K2Node_CustomEvent_QuestList;                      // 0x0388(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_3;        // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetNetworkDataCache_IsValid_1;            // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7167[0x6];                                     // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue_1;        // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBCharacterData*                       CallFunc_GetCharacterData_ReturnValue_1;           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InRetCode;                      // 0x03C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInIsExpiredStickerWeapons;     // 0x03C4(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7168[0x3];                                     // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_CustomEvent_InExpiredStickerWeaponUniqueIds; // 0x03C8(0x0010)(ConstParm, ReferenceParm)
	struct FSBExpiredEquipmentData                K2Node_CustomEvent_InDirtyExpiredEquipmentData;    // 0x03D8(0x0130)(ConstParm)
	ESBMiniMapIconType                            Temp_byte_Variable_1;                              // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMiniMapIconType                            K2Node_Select_Default;                             // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7169[0x1];                                     // 0x050B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x050C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetMiniMapIconZOrder_ReturnValue;         // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_setZOrder_CheckLog_ReturnValue;           // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716A[0x2];                                     // 0x0522(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result, ESBMapErrorCode ErrorCode)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0524(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_716B[0x4];                                     // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_4;        // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716C[0x7];                                     // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue; // 0x0550(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_5;        // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x0569(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716D[0x6];                                     // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue_1; // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue;             // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_1;           // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGameInstance*                        CallFunc_GetSBGameInstance_ReturnValue;            // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBFieldObjectManager*                  CallFunc_GetFieldObjectManager_ReturnValue;        // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGameInstance*                        CallFunc_GetSBGameInstance_ReturnValue_1;          // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBFieldObjectManager*                  CallFunc_GetFieldObjectManager_ReturnValue_1;      // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons) == 0x000008, "Wrong alignment on MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons");
static_assert(sizeof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons) == 0x0005B8, "Wrong size on MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, EntryPoint) == 0x000000, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::EntryPoint' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_4) == 0x000044, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_5) == 0x000054, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Result_4) == 0x000064, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Result_4' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_ErrorCode_1) == 0x000065, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000070, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetGameInstance_ReturnValue) == 0x000080, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsBP_Default_Game_Instance) == 0x000088, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsBP_Default_Game_Instance' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetGameInstance_ReturnValue_1) == 0x000098, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_PartyMember_2) == 0x0000A0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_PartyMember_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsBP_Default_Game_Instance_1) == 0x0000A8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsBP_Default_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_PartyMember_1) == 0x0000B8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_PartyMember_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_PartyMember) == 0x0000C0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_PartyMember' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_IsDead) == 0x0000C8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_IsDead' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000D0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Result_3) == 0x0000D8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Result_3' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_ErrorCode) == 0x0000D9, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_RetCode_2) == 0x0000DC, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_RetCode_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_AcceptedQuestInfo) == 0x0000E0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_AcceptedQuestInfo' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsSBPlayer_Controller_1) == 0x000140, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsSBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Result_2) == 0x000149, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Result_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_QuestIndex_1) == 0x00014C, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_QuestIndex_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_RetCode_1) == 0x000150, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_QuestIndex) == 0x000154, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_QuestIndex' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_CompleteResult) == 0x000158, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_CompleteResult' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_MailRewardData) == 0x000160, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_MailRewardData' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Result_1) == 0x0002E0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_RetCode) == 0x0002E4, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_PrevAcceptedQuestInfo) == 0x0002E8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_PrevAcceptedQuestInfo' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetNetworkDataCache_IsValid) == 0x000348, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetNetworkDataCache_IsValid' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetNetworkDataCache_ReturnValue) == 0x000350, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerController_ReturnValue_2) == 0x000358, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetCharacterData_ReturnValue) == 0x000360, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetCharacterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsSBPlayer_Controller_2) == 0x000368, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsSBPlayer_Controller_2' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_4) == 0x000370, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, Temp_byte_Variable) == 0x000371, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_6) == 0x000374, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_QuestList) == 0x000388, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_QuestList' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerController_ReturnValue_3) == 0x000398, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsSBPlayer_Controller_3) == 0x0003A0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsSBPlayer_Controller_3' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_5) == 0x0003A8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetNetworkDataCache_IsValid_1) == 0x0003A9, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetNetworkDataCache_IsValid_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetNetworkDataCache_ReturnValue_1) == 0x0003B0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetNetworkDataCache_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetCharacterData_ReturnValue_1) == 0x0003B8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetCharacterData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_InRetCode) == 0x0003C0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_InRetCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_bInIsExpiredStickerWeapons) == 0x0003C4, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_bInIsExpiredStickerWeapons' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_InExpiredStickerWeaponUniqueIds) == 0x0003C8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_InExpiredStickerWeaponUniqueIds' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_InDirtyExpiredEquipmentData) == 0x0003D8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_InDirtyExpiredEquipmentData' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, Temp_byte_Variable_1) == 0x000508, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, Temp_bool_Variable) == 0x000509, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_Select_Default) == 0x00050A, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_7) == 0x00050C, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetMiniMapIconZOrder_ReturnValue) == 0x00051C, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetMiniMapIconZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_setZOrder_CheckLog_ReturnValue) == 0x000520, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_setZOrder_CheckLog_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Result) == 0x000521, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CreateDelegate_OutputDelegate_8) == 0x000524, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerController_ReturnValue_4) == 0x000538, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsSBPlayer_Controller_4) == 0x000540, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsSBPlayer_Controller_4' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_6) == 0x000548, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerCharacterCommonComponent_ReturnValue) == 0x000550, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerCharacterCommonComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerController_ReturnValue_5) == 0x000558, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerController_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_AsSBPlayer_Controller_5) == 0x000560, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_AsSBPlayer_Controller_5' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_DynamicCast_bSuccess_7) == 0x000568, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_bWasSuccessful) == 0x000569, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetPlayerCharacterCommonComponent_ReturnValue_1) == 0x000570, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetPlayerCharacterCommonComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetEventExecutor_ReturnValue) == 0x000578, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetEventExecutor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetEventExecutor_ReturnValue_1) == 0x000580, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetEventExecutor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Sender) == 0x000588, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, K2Node_CustomEvent_Param) == 0x000590, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::K2Node_CustomEvent_Param' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetSBGameInstance_ReturnValue) == 0x000598, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetSBGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetFieldObjectManager_ReturnValue) == 0x0005A0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetFieldObjectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetSBGameInstance_ReturnValue_1) == 0x0005A8, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetSBGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons, CallFunc_GetFieldObjectManager_ReturnValue_1) == 0x0005B0, "Member 'MiniMapIcons_C_ExecuteUbergraph_MiniMapIcons::CallFunc_GetFieldObjectManager_ReturnValue_1' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.CustomEvent_2
// 0x0010 (0x0010 - 0x0000)
struct MiniMapIcons_C_CustomEvent_2 final
{
public:
	class UObject*                                Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Param;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniMapIcons_C_CustomEvent_2) == 0x000008, "Wrong alignment on MiniMapIcons_C_CustomEvent_2");
static_assert(sizeof(MiniMapIcons_C_CustomEvent_2) == 0x000010, "Wrong size on MiniMapIcons_C_CustomEvent_2");
static_assert(offsetof(MiniMapIcons_C_CustomEvent_2, Sender) == 0x000000, "Member 'MiniMapIcons_C_CustomEvent_2::Sender' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_CustomEvent_2, Param) == 0x000008, "Member 'MiniMapIcons_C_CustomEvent_2::Param' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnSaveQuestCheckList
// 0x0001 (0x0001 - 0x0000)
struct MiniMapIcons_C_OnSaveQuestCheckList final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniMapIcons_C_OnSaveQuestCheckList) == 0x000001, "Wrong alignment on MiniMapIcons_C_OnSaveQuestCheckList");
static_assert(sizeof(MiniMapIcons_C_OnSaveQuestCheckList) == 0x000001, "Wrong size on MiniMapIcons_C_OnSaveQuestCheckList");
static_assert(offsetof(MiniMapIcons_C_OnSaveQuestCheckList, bWasSuccessful) == 0x000000, "Member 'MiniMapIcons_C_OnSaveQuestCheckList::bWasSuccessful' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnGetMyCharacterInfo_Event_0
// 0x0001 (0x0001 - 0x0000)
struct MiniMapIcons_C_OnGetMyCharacterInfo_Event_0 final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniMapIcons_C_OnGetMyCharacterInfo_Event_0) == 0x000001, "Wrong alignment on MiniMapIcons_C_OnGetMyCharacterInfo_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnGetMyCharacterInfo_Event_0) == 0x000001, "Wrong size on MiniMapIcons_C_OnGetMyCharacterInfo_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnGetMyCharacterInfo_Event_0, Result) == 0x000000, "Member 'MiniMapIcons_C_OnGetMyCharacterInfo_Event_0::Result' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnClassChangeNotify_Event_0
// 0x0148 (0x0148 - 0x0000)
struct MiniMapIcons_C_OnClassChangeNotify_Event_0 final
{
public:
	int32                                         InRetCode;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInIsExpiredStickerWeapons;                        // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InExpiredStickerWeaponUniqueIds;                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSBExpiredEquipmentData                InDirtyExpiredEquipmentData;                       // 0x0018(0x0130)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MiniMapIcons_C_OnClassChangeNotify_Event_0) == 0x000008, "Wrong alignment on MiniMapIcons_C_OnClassChangeNotify_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnClassChangeNotify_Event_0) == 0x000148, "Wrong size on MiniMapIcons_C_OnClassChangeNotify_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnClassChangeNotify_Event_0, InRetCode) == 0x000000, "Member 'MiniMapIcons_C_OnClassChangeNotify_Event_0::InRetCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnClassChangeNotify_Event_0, bInIsExpiredStickerWeapons) == 0x000004, "Member 'MiniMapIcons_C_OnClassChangeNotify_Event_0::bInIsExpiredStickerWeapons' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnClassChangeNotify_Event_0, InExpiredStickerWeaponUniqueIds) == 0x000008, "Member 'MiniMapIcons_C_OnClassChangeNotify_Event_0::InExpiredStickerWeaponUniqueIds' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnClassChangeNotify_Event_0, InDirtyExpiredEquipmentData) == 0x000018, "Member 'MiniMapIcons_C_OnClassChangeNotify_Event_0::InDirtyExpiredEquipmentData' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnQuestListDelegete_Event_0
// 0x0010 (0x0010 - 0x0000)
struct MiniMapIcons_C_OnQuestListDelegete_Event_0 final
{
public:
	TArray<struct FUnlockedQuestInfo>             QuestList;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MiniMapIcons_C_OnQuestListDelegete_Event_0) == 0x000008, "Wrong alignment on MiniMapIcons_C_OnQuestListDelegete_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnQuestListDelegete_Event_0) == 0x000010, "Wrong size on MiniMapIcons_C_OnQuestListDelegete_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnQuestListDelegete_Event_0, QuestList) == 0x000000, "Member 'MiniMapIcons_C_OnQuestListDelegete_Event_0::QuestList' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnUpdateQuestProgressDelegate_Event_0
// 0x0068 (0x0068 - 0x0000)
struct MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0 final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_716F[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceptedQuestInfo                     PrevAcceptedQuestInfo;                             // 0x0008(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0) == 0x000008, "Wrong alignment on MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0) == 0x000068, "Wrong size on MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0, Result) == 0x000000, "Member 'MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0::Result' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0, RetCode) == 0x000004, "Member 'MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0::RetCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0, PrevAcceptedQuestInfo) == 0x000008, "Member 'MiniMapIcons_C_OnUpdateQuestProgressDelegate_Event_0::PrevAcceptedQuestInfo' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnCompleteQuestDelegate_Event_0
// 0x0190 (0x0190 - 0x0000)
struct MiniMapIcons_C_OnCompleteQuestDelegate_Event_0 final
{
public:
	int32                                         RetCode;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         QuestIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestCompleteResult                          CompleteResult;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7170[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMailRewardData                      MailRewardData;                                    // 0x0010(0x0180)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MiniMapIcons_C_OnCompleteQuestDelegate_Event_0) == 0x000008, "Wrong alignment on MiniMapIcons_C_OnCompleteQuestDelegate_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnCompleteQuestDelegate_Event_0) == 0x000190, "Wrong size on MiniMapIcons_C_OnCompleteQuestDelegate_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnCompleteQuestDelegate_Event_0, RetCode) == 0x000000, "Member 'MiniMapIcons_C_OnCompleteQuestDelegate_Event_0::RetCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnCompleteQuestDelegate_Event_0, QuestIndex) == 0x000004, "Member 'MiniMapIcons_C_OnCompleteQuestDelegate_Event_0::QuestIndex' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnCompleteQuestDelegate_Event_0, CompleteResult) == 0x000008, "Member 'MiniMapIcons_C_OnCompleteQuestDelegate_Event_0::CompleteResult' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnCompleteQuestDelegate_Event_0, MailRewardData) == 0x000010, "Member 'MiniMapIcons_C_OnCompleteQuestDelegate_Event_0::MailRewardData' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnCancelQuestDelegate_Event_0
// 0x0008 (0x0008 - 0x0000)
struct MiniMapIcons_C_OnCancelQuestDelegate_Event_0 final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7171[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuestIndex;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniMapIcons_C_OnCancelQuestDelegate_Event_0) == 0x000004, "Wrong alignment on MiniMapIcons_C_OnCancelQuestDelegate_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnCancelQuestDelegate_Event_0) == 0x000008, "Wrong size on MiniMapIcons_C_OnCancelQuestDelegate_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnCancelQuestDelegate_Event_0, Result) == 0x000000, "Member 'MiniMapIcons_C_OnCancelQuestDelegate_Event_0::Result' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnCancelQuestDelegate_Event_0, QuestIndex) == 0x000004, "Member 'MiniMapIcons_C_OnCancelQuestDelegate_Event_0::QuestIndex' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.OnAcceptQuestDelegate_Event_0
// 0x0068 (0x0068 - 0x0000)
struct MiniMapIcons_C_OnAcceptQuestDelegate_Event_0 final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EAcceptedQuestErrorCode                       ErrorCode;                                         // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7172[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceptedQuestInfo                     AcceptedQuestInfo;                                 // 0x0008(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MiniMapIcons_C_OnAcceptQuestDelegate_Event_0) == 0x000008, "Wrong alignment on MiniMapIcons_C_OnAcceptQuestDelegate_Event_0");
static_assert(sizeof(MiniMapIcons_C_OnAcceptQuestDelegate_Event_0) == 0x000068, "Wrong size on MiniMapIcons_C_OnAcceptQuestDelegate_Event_0");
static_assert(offsetof(MiniMapIcons_C_OnAcceptQuestDelegate_Event_0, Result) == 0x000000, "Member 'MiniMapIcons_C_OnAcceptQuestDelegate_Event_0::Result' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnAcceptQuestDelegate_Event_0, ErrorCode) == 0x000001, "Member 'MiniMapIcons_C_OnAcceptQuestDelegate_Event_0::ErrorCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnAcceptQuestDelegate_Event_0, RetCode) == 0x000004, "Member 'MiniMapIcons_C_OnAcceptQuestDelegate_Event_0::RetCode' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_OnAcceptQuestDelegate_Event_0, AcceptedQuestInfo) == 0x000008, "Member 'MiniMapIcons_C_OnAcceptQuestDelegate_Event_0::AcceptedQuestInfo' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.CustomEvent_1
// 0x0010 (0x0010 - 0x0000)
struct MiniMapIcons_C_CustomEvent_1 final
{
public:
	class UMiniMapIconPartyMember_C*              PartyMember;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniMapIcons_C_CustomEvent_1) == 0x000008, "Wrong alignment on MiniMapIcons_C_CustomEvent_1");
static_assert(sizeof(MiniMapIcons_C_CustomEvent_1) == 0x000010, "Wrong size on MiniMapIcons_C_CustomEvent_1");
static_assert(offsetof(MiniMapIcons_C_CustomEvent_1, PartyMember) == 0x000000, "Member 'MiniMapIcons_C_CustomEvent_1::PartyMember' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_CustomEvent_1, IsDead) == 0x000008, "Member 'MiniMapIcons_C_CustomEvent_1::IsDead' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.UnbindPartyMemberOnSetDead
// 0x0008 (0x0008 - 0x0000)
struct MiniMapIcons_C_UnbindPartyMemberOnSetDead final
{
public:
	class UMiniMapIconPartyMember_C*              PartyMember;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniMapIcons_C_UnbindPartyMemberOnSetDead) == 0x000008, "Wrong alignment on MiniMapIcons_C_UnbindPartyMemberOnSetDead");
static_assert(sizeof(MiniMapIcons_C_UnbindPartyMemberOnSetDead) == 0x000008, "Wrong size on MiniMapIcons_C_UnbindPartyMemberOnSetDead");
static_assert(offsetof(MiniMapIcons_C_UnbindPartyMemberOnSetDead, PartyMember) == 0x000000, "Member 'MiniMapIcons_C_UnbindPartyMemberOnSetDead::PartyMember' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.BindPartyMemberOnSetDead
// 0x0008 (0x0008 - 0x0000)
struct MiniMapIcons_C_BindPartyMemberOnSetDead final
{
public:
	class UMiniMapIconPartyMember_C*              PartyMember;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniMapIcons_C_BindPartyMemberOnSetDead) == 0x000008, "Wrong alignment on MiniMapIcons_C_BindPartyMemberOnSetDead");
static_assert(sizeof(MiniMapIcons_C_BindPartyMemberOnSetDead) == 0x000008, "Wrong size on MiniMapIcons_C_BindPartyMemberOnSetDead");
static_assert(offsetof(MiniMapIcons_C_BindPartyMemberOnSetDead, PartyMember) == 0x000000, "Member 'MiniMapIcons_C_BindPartyMemberOnSetDead::PartyMember' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.CustomEvent_0
// 0x0002 (0x0002 - 0x0000)
struct MiniMapIcons_C_CustomEvent_0 final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBMapErrorCode                               ErrorCode;                                         // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniMapIcons_C_CustomEvent_0) == 0x000001, "Wrong alignment on MiniMapIcons_C_CustomEvent_0");
static_assert(sizeof(MiniMapIcons_C_CustomEvent_0) == 0x000002, "Wrong size on MiniMapIcons_C_CustomEvent_0");
static_assert(offsetof(MiniMapIcons_C_CustomEvent_0, Result) == 0x000000, "Member 'MiniMapIcons_C_CustomEvent_0::Result' has a wrong offset!");
static_assert(offsetof(MiniMapIcons_C_CustomEvent_0, ErrorCode) == 0x000001, "Member 'MiniMapIcons_C_CustomEvent_0::ErrorCode' has a wrong offset!");

// Function MiniMapIcons.MiniMapIcons_C.AddQuestIcon
// 0x0198 (0x0198 - 0x0000)
struct MiniMapIcons_C_AddQuestIcon final
{
public:
	int32                                         InQuestIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckDisplayOutOfRange;                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7173[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMiniMapIconQuest*                    SameIcon;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMiniMapIconQuest_C*                    QuestIcon;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoClip;                                          // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EQuestIconType                                QuestType;                                         // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestCategory2                               QuestCategory;                                     // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7174[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuestIndex;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7175[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestMasterData                       CallFunc_FindQuestMasterData_QuestMasterData;      // 0x0030(0x0118)()
	bool                                          CallFunc_FindQuestMasterData_Exist;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestDisableShowIcon_ReturnValue;       // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7176[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMiniMapIconQuest*                    CallFunc_IsTypeQuestIcon_ReturnValue;              // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestIconType                                CallFunc_GetQuestIconType_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7177[0x5];                                     // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMiniMapIconQuest_C*                    CallFunc_Create_ReturnValue;                       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7178[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
