#pragma once

 

// Package: MyCharaMenu

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EMyCharaMenu_ItemType_structs.hpp"
#include "PlayerSceneCapture2D_MapSpawnConfig_structs.hpp"


namespace SDK::Params
{

// Function MyCharaMenu.MyCharaMenu_C.ExecuteUbergraph_MyCharaMenu
// 0x0C00 (0x0C00 - 0x0000)
struct MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6129[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612A[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_AchievementList_C*         K2Node_CustomEvent_InAchievementList;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612B[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InResult_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InResult;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612C[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_FindCurrMapPlayerAvatarTransform_OutTransform; // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Player_Avater_Motion_Mode_IsIdleMotionPlaying; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612D[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerSceneCapture2D_Studio_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_2;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_ButtonId;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsActive;                     // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InProcStart;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612E[0x3];                                     // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index_4;                        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index_3;                        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_612F[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_OnPosingCommandName;            // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InSwitchPosingToPrev;           // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6130[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6131[0x2];                                     // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStateNum_OutNum;                       // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 K2Node_CustomEvent_InPrevStateName_1;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_InNextStateName_1;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& InPrevStateName, const class FString& InNextStateName)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6132[0x5];                                     // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_2; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6133[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindStateName_OutNo;                      // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6134[0x5];                                     // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6135[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_3; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6136[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& InPrevStateName, const class FString& InNextStateName)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x01DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6137[0x4];                                     // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_InPrevStateName;                // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_InNextStateName;                // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6138[0x2];                                     // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6139[0x1];                                     // 0x0227(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBCharaCreateComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_613A[0x2];                                     // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_7;            // 0x0234(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_8;            // 0x0244(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_613B[0x2];                                     // 0x0256(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& InPrevStateName, const class FString& InNextStateName)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_613C[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_State_Machine_Name_OutName;           // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_State_Name_IsValid;                   // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_613D[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_State_Name_OutStateName;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(int32 InRetCode, int32 AvatarPoseId)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsHidden;                       // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_613E[0x4];                                     // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBSubMenuSubButtonInterface> K2Node_DynamicCast_AsSBSub_Menu_Sub_Button_Interface; // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsCostumeOn_1;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_613F[0x3];                                     // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_InBookMarkType;                       // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6140[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_4; // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsVisible;                    // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6141[0x6];                                     // 0x02FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBCommandMenuInterface> K2Node_DynamicCast_AsSBCommand_Menu_Interface;     // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_30;                   // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6142[0x6];                                     // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBCharaCreateParameter                K2Node_CustomEvent_CharaCreateParameter_1;         // 0x0318(0x03C0)()
	bool                                          K2Node_CustomEvent_Start;                          // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_31;                   // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6143[0x6];                                     // 0x06DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBCharaCreateParameter                K2Node_CustomEvent_CharaCreateParameter;           // 0x06E0(0x03C0)()
	bool                                          CallFunc_IsValid_ReturnValue_32;                   // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_33;                   // 0x0AA1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6144[0x2];                                     // 0x0AA2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRetCode;                      // 0x0AA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InAvatarPoseId;                 // 0x0AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0AAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6145[0x3];                                     // 0x0AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_34;                   // 0x0AC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6146[0x2];                                     // 0x0AC2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InRetCode, int32 AvatarPoseId)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0AC4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsCostumeOn;                  // 0x0AD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6147[0x3];                                     // 0x0AD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InSubMenuId;                    // 0x0AD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0ADC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6148[0x3];                                     // 0x0ADD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_35;                   // 0x0AE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0AE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6149[0x6];                                     // 0x0AEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue; // 0x0AF0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_36;                   // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_614A[0x3];                                     // 0x0AF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MainPage;                             // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubPage;                              // 0x0B00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0B04(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_37;                   // 0x0B05(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_614B[0x2];                                     // 0x0B06(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharacterMenu_CostumeAndMountSwitcher_C* K2Node_DynamicCast_AsMy_Character_Menu_Costume_and_Mount_Switcher; // 0x0B08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_38;                   // 0x0B11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_39;                   // 0x0B12(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_40;                   // 0x0B13(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_614C[0x4];                                     // 0x0B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_5; // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_State_Name_IsValid_1;                 // 0x0B21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_614D[0x6];                                     // 0x0B22(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_State_Name_OutStateName_1;            // 0x0B28(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_State_Machine_Name_OutName_1;         // 0x0B38(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0B49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_614E[0x2];                                     // 0x0B4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0B4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyCharacterMenu_CostumeAndMountSwitcher_C* K2Node_DynamicCast_AsMy_Character_Menu_Costume_and_Mount_Switcher_1; // 0x0B50(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_41;                   // 0x0B59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_614F[0x6];                                     // 0x0B5A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharacterMenu_CostumeAndMountSwitcher_C* K2Node_DynamicCast_AsMy_Character_Menu_Costume_and_Mount_Switcher_2; // 0x0B60(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0B68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6150[0x7];                                     // 0x0B69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharacterMenu_CostumeAndMountSwitcher_C* K2Node_DynamicCast_AsMy_Character_Menu_Costume_and_Mount_Switcher_3; // 0x0B70(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_42;                   // 0x0B79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_43;                   // 0x0B7A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6151[0x1];                                     // 0x0B7B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index_2;                        // 0x0B7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0B80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6152[0x3];                                     // 0x0B81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index_1;                        // 0x0B84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0B88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0B8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0B8D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_44;                   // 0x0B8E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0B8F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMyCharacterMenu_CostumeAndMountSwitcher_C* K2Node_DynamicCast_AsMy_Character_Menu_Costume_and_Mount_Switcher_4; // 0x0B90(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0B98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6153[0x7];                                     // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetSwitcherActiveWidget_OutWidget;  // 0x0BA0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_45;                   // 0x0BA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6154[0x7];                                     // 0x0BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_ArmamentChange_C*          K2Node_DynamicCast_AsMy_Chara_Menu_Armament_Change; // 0x0BB0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0BB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_46;                   // 0x0BB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6155[0x6];                                     // 0x0BBA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_6; // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_47;                   // 0x0BC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_48;                   // 0x0BCA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0BCB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0BCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0BCD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_49;                   // 0x0BCE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_50;                   // 0x0BCF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_51;                   // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6156[0x7];                                     // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerSceneCapture2D_C*             K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_7; // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0BE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6157[0x3];                                     // 0x0BE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0BE4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_52;                   // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_53;                   // 0x0BE9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6158[0x6];                                     // 0x0BEA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharacterMenu_StatusSwitcher_C*      K2Node_DynamicCast_AsMy_Character_Menu_Status_Switcher; // 0x0BF0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu) == 0x000010, "Wrong alignment on MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu");
static_assert(sizeof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu) == 0x000C00, "Wrong size on MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, EntryPoint) == 0x000000, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InAchievementList) == 0x000030, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InAchievementList' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_AddChildToCanvas_ReturnValue) == 0x000040, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InResult_1) == 0x000048, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InResult_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InResult) == 0x000049, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InResult' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_GetTextFromAsset_ReturnValue) == 0x000050, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000078, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0000A0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_FindCurrMapPlayerAvatarTransform_OutTransform) == 0x0000B0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_FindCurrMapPlayerAvatarTransform_OutTransform' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_Set_Player_Avater_Motion_Mode_IsIdleMotionPlaying) == 0x0000E0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_Set_Player_Avater_Motion_Mode_IsIdleMotionPlaying' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E8, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000F0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000F8, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_ComponentBoundEvent_ButtonId) == 0x000108, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_ComponentBoundEvent_ButtonId' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_2) == 0x00010C, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_Conv_IntToByte_ReturnValue) == 0x00010D, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_GetValidValue_ReturnValue) == 0x00010E, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00010F, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_IsVisible) == 0x000110, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InIsActive) == 0x000111, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InIsActive' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_3) == 0x000112, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_4) == 0x000113, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InProcStart) == 0x000114, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InProcStart' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_Event_Animation) == 0x000118, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_Index_4) == 0x000120, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_Index_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_Index_3) == 0x000124, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_Index_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_SwitchInteger_CmpSuccess) == 0x000128, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_OnPosingCommandName) == 0x00012C, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_OnPosingCommandName' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InSwitchPosingToPrev) == 0x000134, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InSwitchPosingToPrev' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_5) == 0x000135, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_6) == 0x000136, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_7) == 0x000137, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D) == 0x000138, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_8) == 0x000141, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_9) == 0x000142, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_1) == 0x000148, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_10) == 0x000151, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_GetStateNum_OutNum) == 0x000154, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_GetStateNum_OutNum' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate_3) == 0x000158, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InPrevStateName_1) == 0x000168, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InPrevStateName_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InNextStateName_1) == 0x000178, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InNextStateName_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate_4) == 0x000188, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_11) == 0x000198, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_12) == 0x000199, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_13) == 0x00019A, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_2) == 0x0001A0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_bSuccess_2) == 0x0001A8, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_FindStateName_OutNo) == 0x0001AC, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_FindStateName_OutNo' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0001B0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_14) == 0x0001B1, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_15) == 0x0001B2, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_PlayAnimation_ReturnValue) == 0x0001B8, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001C0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001C8, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_16) == 0x0001C9, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_17) == 0x0001CA, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_18) == 0x0001CB, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_3) == 0x0001D0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_AsBP_Player_Scene_Capture_2D_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_DynamicCast_bSuccess_3) == 0x0001D8, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001DC, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InPrevStateName) == 0x0001F0, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InPrevStateName' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_InNextStateName) == 0x000200, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_InNextStateName' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_19) == 0x000210, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000211, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CreateDelegate_OutputDelegate_6) == 0x000214, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, CallFunc_IsValid_ReturnValue_20) == 0x000224, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::CallFunc_IsValid_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu, K2Node_CustomEvent_Result_1) == 0x000225, "Member 'MyCharaMenu_C_ExecuteUbergraph_MyCharaMenu::K2Node_CustomEvent_Result_1' has a wrong offset!");
