#pragma once

 

// Package: MyCharaMenu_ClassInfoDiffForLeftSideParameters

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MyCharaMenu_ClassInfoDiffForLeftSideParameters.MyCharaMenu_ClassInfoDiffForLeftSideParameters_C.ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters
// 0x0030 (0x0030 - 0x0000)
struct MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525D[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters) == 0x000008, "Wrong alignment on MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters");
static_assert(sizeof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters) == 0x000030, "Wrong size on MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, EntryPoint) == 0x000000, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::EntryPoint' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, K2Node_Event_IsDesignTime) == 0x000004, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_GetSize_ReturnValue) == 0x000014, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_BreakVector2D_X) == 0x00001C, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters, CallFunc_MakeVector2D_ReturnValue) == 0x000024, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_ExecuteUbergraph_MyCharaMenu_ClassInfoDiffForLeftSideParameters::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function MyCharaMenu_ClassInfoDiffForLeftSideParameters.MyCharaMenu_ClassInfoDiffForLeftSideParameters_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct) == 0x000001, "Wrong alignment on MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct");
static_assert(sizeof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct) == 0x000001, "Wrong size on MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MyCharaMenu_ClassInfoDiffForLeftSideParameters.MyCharaMenu_ClassInfoDiffForLeftSideParameters_C.SetClassInfo
// 0x0030 (0x0030 - 0x0000)
struct MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo final
{
public:
	ESBClassType                                  InClassType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InClassLevel;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo) == 0x000008, "Wrong alignment on MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo");
static_assert(sizeof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo) == 0x000030, "Wrong size on MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo, InClassType) == 0x000000, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo::InClassType' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo, InClassLevel) == 0x000004, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo::InClassLevel' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'MyCharaMenu_ClassInfoDiffForLeftSideParameters_C_SetClassInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

