#pragma once

 

// Package: MyCharaMenu_CostumeChangeMenu

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "E_MyCharaMenu_CostumeCategory_structs.hpp"
#include "UMG_structs.hpp"
#include "InventoryData_structs.hpp"
#include "E_MyCharaMenu_AccessoryCategory_structs.hpp"
#include "CharaParts_structs.hpp"
#include "InventoryItemData_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.OnSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature final
{
public:
	class FString                                 InItemUniqueId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature) == 0x000010, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature, InItemUniqueId) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_OnSelected__DelegateSignature::InItemUniqueId' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.OnOpenEquipRingHandSelectDialog__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature final
{
public:
	class FString                                 InRingUniqueId;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature) == 0x000008, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature) == 0x000010, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature, InRingUniqueId) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_OnOpenEquipRingHandSelectDialog__DelegateSignature::InRingUniqueId' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu
// 0x0428 (0x0428 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharaEquipType                             Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues K2Node_CustomEvent_InUnchangeableRetValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsAccessory;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_898E[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	ESBCharaEquipType                             Temp_byte_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_898F[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0068(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0150(0x0018)()
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8990[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0188(0x0018)()
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESBConfigSaveDataResult                       CallFunc_SaveGeneralConfigData_ReturnValue;        // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8991[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_CustomEvent_InSelectedIcon;                 // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters_1;              // 0x01C0(0x0010)(ReferenceParm)
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x01D0(0x0010)(ReferenceParm)
	int32                                         Temp_int_Variable;                                 // 0x01E0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBItemSortType                               K2Node_ComponentBoundEvent_SortType;               // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable_3;                              // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8992[0x2];                                     // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilterGroup>                   CallFunc_Get_Filter_OutSortFilter;                 // 0x01E8(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MyCharaMenu_CostumeCategory                 K2Node_ComponentBoundEvent_InCostumeCategory;      // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x01FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8993[0x5];                                     // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable_4;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MyCharaMenu_AccessoryCategory               K2Node_ComponentBoundEvent_InAccessoryCategory;    // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable_5;                              // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAccessoryCostumeTypeFromAccessoryCategory_IsValid; // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharaEquipType                             CallFunc_GetAccessoryCostumeTypeFromAccessoryCategory_OutCostumeType; // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             K2Node_Select_Default;                             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable_6;                              // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable_7;                              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8994[0x1];                                     // 0x0213(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0214(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8995[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x0228(0x0118)(ConstParm)
	ESBCharaEquipType                             Temp_byte_Variable_8;                              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EYesNoDialogResult                            K2Node_CustomEvent_InYesNoResult;                  // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindCostumeMaster_IsExist;             // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8996[0x4];                                     // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterCostume                       CallFunc_BP_FindCostumeMaster_ReturnValue;         // 0x0348(0x0088)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharaEquipType                             CallFunc_GetCharaEquipTypeFromProtectorCategory_OutCharaEquipType; // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharaEquipTypeFromProtectorCategory_ReturnValue; // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_MyCharaMenu_CostumeCategory                 Temp_byte_Variable_9;                              // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8997[0x3];                                     // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x03D8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             K2Node_Select_Default_1;                           // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x03DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8998[0x2];                                     // 0x03DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilterGroup>                   CallFunc_Get_Filter_OutSortFilter_1;               // 0x03E0(0x0010)(ReferenceParm)
	class USBShowYesNoDialog2Impl*                CallFunc_ShowYesNoDialog2_ReturnValue;             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8999[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0400(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues Temp_byte_Variable_10;                             // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899A[0x3];                                     // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x040C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_899B[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu) == 0x000008, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu) == 0x000428, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, EntryPoint) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable) == 0x000008, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_bool_Variable) == 0x000009, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_1) == 0x00000A, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000B, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000E, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x00000F, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_CustomEvent_InUnchangeableRetValue) == 0x000010, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_CustomEvent_InUnchangeableRetValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_CustomEvent_InIsAccessory) == 0x000011, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_CustomEvent_InIsAccessory' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetTextFromAsset_ReturnValue) == 0x000018, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_2) == 0x000040, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000048, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x000058, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000068, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000080, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_MakeArray_Array) == 0x000118, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000128, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Format_ReturnValue) == 0x000138, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000150, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetTextFromAssetByName_ReturnValue_1) == 0x000168, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetTextFromAssetByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetConfigSaveManager_IsValid) == 0x000178, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000180, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000188, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetPlayerId_ReturnValue) == 0x0001A0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_SaveGeneralConfigData_ReturnValue) == 0x0001B0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_SaveGeneralConfigData_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_CustomEvent_InSelectedIcon) == 0x0001B8, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_CustomEvent_InSelectedIcon' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_ComponentBoundEvent_Filters_1) == 0x0001C0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_ComponentBoundEvent_Filters_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_ComponentBoundEvent_Filters) == 0x0001D0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_int_Variable) == 0x0001E0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_ComponentBoundEvent_SortType) == 0x0001E4, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_ComponentBoundEvent_SortType' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_3) == 0x0001E5, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Get_Filter_OutSortFilter) == 0x0001E8, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Get_Filter_OutSortFilter' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_Event_IsDesignTime) == 0x0001F8, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_ComponentBoundEvent_InCostumeCategory) == 0x0001F9, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_ComponentBoundEvent_InCostumeCategory' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetMasterDataManager_IsValid) == 0x0001FA, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetMasterDataManager_ReturnValue) == 0x000200, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_4) == 0x000208, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_ComponentBoundEvent_InAccessoryCategory) == 0x000209, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_ComponentBoundEvent_InAccessoryCategory' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_5) == 0x00020A, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00020B, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00020C, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_BooleanOR_ReturnValue) == 0x00020D, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetAccessoryCostumeTypeFromAccessoryCategory_IsValid) == 0x00020E, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetAccessoryCostumeTypeFromAccessoryCategory_IsValid' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetAccessoryCostumeTypeFromAccessoryCategory_OutCostumeType) == 0x00020F, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetAccessoryCostumeTypeFromAccessoryCategory_OutCostumeType' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_Select_Default) == 0x000210, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_6) == 0x000211, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_7) == 0x000212, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_int_Variable_1) == 0x000214, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetEquipmentBag_ReturnValue) == 0x000218, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x000221, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x000228, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_8) == 0x000340, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_CustomEvent_InYesNoResult) == 0x000341, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_CustomEvent_InYesNoResult' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000342, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_BP_FindCostumeMaster_IsExist) == 0x000343, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_BP_FindCostumeMaster_IsExist' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_BP_FindCostumeMaster_ReturnValue) == 0x000348, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_BP_FindCostumeMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0003D0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetCharaEquipTypeFromProtectorCategory_OutCharaEquipType) == 0x0003D1, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetCharaEquipTypeFromProtectorCategory_OutCharaEquipType' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetCharaEquipTypeFromProtectorCategory_ReturnValue) == 0x0003D2, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetCharaEquipTypeFromProtectorCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Not_PreBool_ReturnValue) == 0x0003D3, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_9) == 0x0003D4, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_int_Variable_2) == 0x0003D8, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_Select_Default_1) == 0x0003DC, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x0003DD, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Get_Filter_OutSortFilter_1) == 0x0003E0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Get_Filter_OutSortFilter_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_ShowYesNoDialog2_ReturnValue) == 0x0003F0, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_ShowYesNoDialog2_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x0003F8, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_PlaySE_ReturnValue) == 0x0003FC, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_int_Variable_3) == 0x000400, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_int_Variable_4) == 0x000404, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_byte_Variable_10) == 0x000408, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, K2Node_Select_Default_2) == 0x00040C, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_IsValid_ReturnValue_2) == 0x000410, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x000414, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, Temp_int_Variable_5) == 0x000418, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_Add_IntInt_ReturnValue) == 0x00041C, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_RemoveChildAt_ReturnValue) == 0x000420, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000421, "Member 'MyCharaMenu_CostumeChangeMenu_C_ExecuteUbergraph_MyCharaMenu_CostumeChangeMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.EndUsingUnusedEquipConfirmDialog
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog final
{
public:
	EYesNoDialogResult                            InYesNoResult;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog) == 0x000001, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog) == 0x000001, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog, InYesNoResult) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_EndUsingUnusedEquipConfirmDialog::InYesNoResult' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature final
{
public:
	E_MyCharaMenu_AccessoryCategory               InAccessoryCategory;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature) == 0x000001, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature) == 0x000001, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature, InAccessoryCategory) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_BndEvt__AccessoryCategoryTab_K2Node_ComponentBoundEvent_2_OnAccessoryCategoryIconBtnClicked__DelegateSignature::InAccessoryCategory' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature final
{
public:
	E_MyCharaMenu_CostumeCategory                 InCostumeCategory;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature) == 0x000001, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature) == 0x000001, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature, InCostumeCategory) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_BndEvt__CostumeCategoryTab_K2Node_ComponentBoundEvent_9_OnCostumeCategoryIconBtnClicked__DelegateSignature::InCostumeCategory' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_PreConstruct) == 0x000001, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_PreConstruct");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_PreConstruct) == 0x000001, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_PreConstruct");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature final
{
public:
	ESBItemSortType                               Param_SortType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature) == 0x000001, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature) == 0x000001, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature, Param_SortType) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_BndEvt__SortBox_K2Node_ComponentBoundEvent_8_OnSelectSortType__DelegateSignature::Param_SortType' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature final
{
public:
	TArray<struct FFilterGroup>                   Filters;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature) == 0x000008, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature) == 0x000010, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature, Filters) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorAccessory_K2Node_ComponentBoundEvent_6_OnFilterApply__DelegateSignature::Filters' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature final
{
public:
	TArray<struct FFilterGroup>                   Filters;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature) == 0x000008, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature) == 0x000010, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature, Filters) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_BndEvt__FilterSelectorCostume_K2Node_ComponentBoundEvent_4_OnFilterApply__DelegateSignature::Filters' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.OnSelect_CandidateItemIcon
// 0x0008 (0x0008 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon final
{
public:
	class UItemIconBtn_C*                         InSelectedIcon;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon) == 0x000008, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon) == 0x000008, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon, InSelectedIcon) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_OnSelect_CandidateItemIcon::InSelectedIcon' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.ShowUnchangeableMessageDialog
// 0x0002 (0x0002 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog final
{
public:
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues InUnchangeableRetValue;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsAccessory;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog) == 0x000001, "Wrong alignment on MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog");
static_assert(sizeof(MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog) == 0x000002, "Wrong size on MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog, InUnchangeableRetValue) == 0x000000, "Member 'MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog::InUnchangeableRetValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog, InIsAccessory) == 0x000001, "Member 'MyCharaMenu_CostumeChangeMenu_C_ShowUnchangeableMessageDialog::InIsAccessory' has a wrong offset!");

// Function MyCharaMenu_CostumeChangeMenu.MyCharaMenu_CostumeChangeMenu_C.CreateEmptySlotList
// 0x0070 (0x0070 - 0x0000)
struct MyCharaMenu_CostumeChangeMenu_C_CreateEmptySlotList final
{
public:
	int32                                         TmpCapacity;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MarginLeft;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MarginTop;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_899C[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
