#pragma once

 

// Package: MyCharaMenu_Costume

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "CharaParts_structs.hpp"
#include "UMG_structs.hpp"
#include "E_MyCharaMenu_CostumeCategory_structs.hpp"


namespace SDK::Params
{

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.OnChangeCostumeProc__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature final
{
public:
	bool                                          ProcStart;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature) == 0x000001, "Wrong alignment on MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature");
static_assert(sizeof(MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature) == 0x000001, "Wrong size on MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature");
static_assert(offsetof(MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature, ProcStart) == 0x000000, "Member 'MyCharaMenu_Costume_C_OnChangeCostumeProc__DelegateSignature::ProcStart' has a wrong offset!");

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.OnPlayerAvatarRotateActive__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature final
{
public:
	bool                                          InIsActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature) == 0x000001, "Wrong alignment on MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature");
static_assert(sizeof(MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature) == 0x000001, "Wrong size on MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature");
static_assert(offsetof(MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature, InIsActive) == 0x000000, "Member 'MyCharaMenu_Costume_C_OnPlayerAvatarRotateActive__DelegateSignature::InIsActive' has a wrong offset!");

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.OnPlayerAvatarSwitchPosing__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature final
{
public:
	class FName                                   OnPosingCommandName;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_IsSwitchPosingToPrev;                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature) == 0x000004, "Wrong alignment on MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature");
static_assert(sizeof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature) == 0x00000C, "Wrong size on MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature");
static_assert(offsetof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature, OnPosingCommandName) == 0x000000, "Member 'MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature::OnPosingCommandName' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature, Param_IsSwitchPosingToPrev) == 0x000008, "Member 'MyCharaMenu_Costume_C_OnPlayerAvatarSwitchPosing__DelegateSignature::Param_IsSwitchPosingToPrev' has a wrong offset!");

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature final
{
public:
	bool                                          InIsCostumeOn;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature) == 0x000001, "Wrong alignment on MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature");
static_assert(sizeof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature) == 0x000001, "Wrong size on MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature");
static_assert(offsetof(MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature, InIsCostumeOn) == 0x000000, "Member 'MyCharaMenu_Costume_C_OnPlayerAvatarSwitchCostumeOnOff__DelegateSignature::InIsCostumeOn' has a wrong offset!");

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.OnSetCostumePreviewParameter__DelegateSignature
// 0x03C8 (0x03C8 - 0x0000)
struct MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature final
{
public:
	struct FSBCharaCreateParameter                CharaCreateParameter;                              // 0x0000(0x03C0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Start;                                             // 0x03C0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature) == 0x000008, "Wrong alignment on MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature");
static_assert(sizeof(MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature) == 0x0003C8, "Wrong size on MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature");
static_assert(offsetof(MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature, CharaCreateParameter) == 0x000000, "Member 'MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature::CharaCreateParameter' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature, Start) == 0x0003C0, "Member 'MyCharaMenu_Costume_C_OnSetCostumePreviewParameter__DelegateSignature::Start' has a wrong offset!");

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.OnRefreshPreviewCostume__DelegateSignature
// 0x03C0 (0x03C0 - 0x0000)
struct MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature final
{
public:
	struct FSBCharaCreateParameter                Parameter;                                         // 0x0000(0x03C0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature) == 0x000008, "Wrong alignment on MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature");
static_assert(sizeof(MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature) == 0x0003C0, "Wrong size on MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature");
static_assert(offsetof(MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature, Parameter) == 0x000000, "Member 'MyCharaMenu_Costume_C_OnRefreshPreviewCostume__DelegateSignature::Parameter' has a wrong offset!");

// Function MyCharaMenu_Costume.MyCharaMenu_Costume_C.ExecuteUbergraph_MyCharaMenu_Costume
// 0x0940 (0x0940 - 0x0000)
struct MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_75AD[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharaEquipItemInfo                    K2Node_MakeStruct_CharaEquipItemInfo;              // 0x0018(0x0028)()
	class FName                                   Temp_name_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_IsValid; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75AE[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharaEquipItemCharaCreateInfo         CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_OutEquipItemCharaCreateInfo; // 0x0050(0x0028)()
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75AF[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_GetPlayerClassType_ClassType;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B0[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_InRingUniqueId;         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_InIsLeftHand;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B1[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPreviewCostumeUniqueId_UniqueId;       // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B2[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MyCharaMenu_CostumeCategory                 CallFunc_GetSelectedCostumeCategory_OutCostumeCategory; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75B3[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_InItemUniqueId;         // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue_1;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharaEquipInfo                        CallFunc_GetEquipInfo_ReturnValue;                 // 0x00F8(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B4[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_2;                     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_IsValid_1; // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B5[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharaEquipItemCharaCreateInfo         CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_OutEquipItemCharaCreateInfo_1; // 0x0118(0x0028)()
	TDelegate<void(int32 RetCode, struct FSBExpiredEquipmentData& InExpiredEquipmentData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75B6[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0158(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B7[0x2];                                     // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode_2;                      // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBExpiredEquipmentData                K2Node_CustomEvent_InExpiredEquipmentData_2;       // 0x0168(0x0130)(ConstParm)
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75B8[0x4];                                     // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBExpiredEquipmentData                K2Node_CustomEvent_InExpiredEquipmentData_1;       // 0x02A0(0x0130)(ConstParm)
	class ASBPlayerState*                         CallFunc_GetSBPlayerState_ReturnValue;             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75B9[0x7];                                     // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerStorageComponent*              CallFunc_GetPlayerStorageComponent_ReturnValue;    // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsThereExpiredEquipment_ReturnValue;      // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsDetach;                       // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCostumeEquipment_EquipFlag;          // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75BA[0x2];                                     // 0x03EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharaEquipItemInfo                    K2Node_MakeStruct_CharaEquipItemInfo_1;            // 0x03F0(0x0028)()
	class FString                                 K2Node_CustomEvent_InItemUniqueId;                 // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharaEquipInfo                        CallFunc_GetEquipInfo_ReturnValue_1;               // 0x0430(0x0010)()
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75BB[0x4];                                     // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBExpiredEquipmentData                K2Node_CustomEvent_InExpiredEquipmentData;         // 0x0448(0x0130)()
	struct FCharaEquipItemInfo                    CallFunc_Array_Get_Item;                           // 0x0578(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompositeWearByCostumeId_bIsValid;      // 0x05A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCompositeWearByCostumeId_IsCompositeWear; // 0x05A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75BC[0x1];                                     // 0x05A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharaPartsLocation>                   CallFunc_IsCompositeWearByCostumeId_OccupiedPartsLocations; // 0x05A8(0x0010)(ReferenceParm)
	struct FSBMasterCostume                       CallFunc_IsCompositeWearByCostumeId_MasterCostume; // 0x05B8(0x0088)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharaEquipType                             CallFunc_GetCharaEquipTypeFromProtectorCategory_OutCharaEquipType; // 0x0641(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCharaEquipTypeFromProtectorCategory_ReturnValue; // 0x0642(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75BD[0x5];                                     // 0x0643(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0648(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75BE[0x7];                                     // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0660(0x0018)()
	int32                                         CallFunc_PlaySE_ReturnValue_3;                     // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x067C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_InIsDressVisibilitySwitchOn; // 0x067D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x067E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x067F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Sender_1;                       // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_1;                        // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBIntParam*                            K2Node_DynamicCast_AsSBInt_Param;                  // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75BF[0x7];                                     // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBIntParam*                            K2Node_DynamicCast_AsSBInt_Param_1;                // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x06B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x06BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75C0[0x5];                                     // 0x06BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue;             // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowExpiredItemNoticeSystemMessage_OutIsMessageShowed; // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSystemMessageManager_IsValid;          // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75C1[0x6];                                     // 0x06CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBSystemMessageManager*                CallFunc_GetSystemMessageManager_ReturnValue;      // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSystemMessageShowingOrStandby_ReturnValue; // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75C2[0x3];                                     // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x06DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RetCode, struct FSBExpiredEquipmentData& InExpiredEquipmentData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x06E4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Select_Default;                             // 0x06F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C3[0x4];                                     // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterGender                            CallFunc_GetGender_ReturnValue;                    // 0x0709(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAvatarCostumePartsLoadingFlag_OutIsAvatarCostumePartsLoading; // 0x070A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAvatarCostumePartsLoadingFlag_OutIsAvatarCostumePartsLoading_1; // 0x070B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PlaySE_ReturnValue_4;                     // 0x070C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0712(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0713(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C4[0x4];                                     // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_2;      // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue_1; // 0x0720(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75C5[0x2];                                     // 0x072A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RetCode, struct FSBExpiredEquipmentData& InExpiredEquipmentData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x072C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x073C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C6[0x3];                                     // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0740(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0750(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             Temp_byte_Variable;                                // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C7[0x3];                                     // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x075C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_75C8[0x4];                                     // 0x076C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0770(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPreviewUnusedItem_Unused;            // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75C9[0x6];                                     // 0x077A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUseCheckDialogActive_ReturnValue;       // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75CA[0x7];                                     // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0790(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x07A0(0x0018)()
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x07B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_1;           // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75CB[0x7];                                     // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_1;       // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x07D8(0x0018)()
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x07F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESBConfigSaveDataResult                       CallFunc_SaveGeneralConfigData_ReturnValue;        // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75CC[0x3];                                     // 0x0801(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0804(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_75CD[0x4];                                     // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0818(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0820(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_Start;                          // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharaEquipType                             Temp_byte_Variable_1;                              // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0832(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_ForceReset;                     // 0x0833(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75CE[0x2];                                     // 0x083A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x083C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_75CF[0x4];                                     // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue_2;            // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_MyCharaMenu_CostumeCategory                 CallFunc_GetSelectedCostumeCategory_OutCostumeCategory_1; // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D0[0x7];                                     // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPreviewCostumeUniqueId_UniqueId_1;     // 0x0860(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D1[0x7];                                     // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPreviewCostumeUniqueId_UniqueId_2;     // 0x0878(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D2[0x3];                                     // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_5;                     // 0x088C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RetCode, struct FSBExpiredEquipmentData& InExpiredEquipmentData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0890(0x0010)(ZeroConstructor, NoDestructor)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_3;      // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D3[0x3];                                     // 0x08A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x08AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x08B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D4[0x6];                                     // 0x08B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBShowYesNoDialog2Impl*                CallFunc_ShowYesNoDialog2_ReturnValue;             // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x08C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D5[0x6];                                     // 0x08C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharaEquipInfo                        CallFunc_GetEquipInfo_ReturnValue_2;               // 0x08C8(0x0010)()
	bool                                          Temp_bool_Variable_2;                              // 0x08D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D6[0x7];                                     // 0x08D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharaEquipType                             K2Node_Select_Default_2;                           // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75D7[0x7];                                     // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue_1;       // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D8[0x7];                                     // 0x08F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75D9[0x7];                                     // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemList*                         CallFunc_GetOwnItemList_ReturnValue;               // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0918(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetNetworkDataCache_IsValid_1;            // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75DA[0x7];                                     // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue_1;        // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemList*                         CallFunc_GetOwnItemList_ReturnValue_1;             // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume) == 0x000008, "Wrong alignment on MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume");
static_assert(sizeof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume) == 0x000940, "Wrong size on MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, EntryPoint) == 0x000000, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::EntryPoint' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_MakeStruct_CharaEquipItemInfo) == 0x000018, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_MakeStruct_CharaEquipItemInfo' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, Temp_name_Variable) == 0x000040, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_IsValid) == 0x000048, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_IsValid' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_OutEquipItemCharaCreateInfo) == 0x000050, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_OutEquipItemCharaCreateInfo' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetSBPlayerController_ReturnValue) == 0x000078, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetPlayerCharacterCommonComponent_ReturnValue) == 0x000088, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetPlayerCharacterCommonComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetPlayerClassType_ClassType) == 0x000090, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetPlayerClassType_ClassType' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsValid_ReturnValue_1) == 0x000091, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_ComponentBoundEvent_InRingUniqueId) == 0x000098, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_ComponentBoundEvent_InRingUniqueId' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_ComponentBoundEvent_InIsLeftHand) == 0x0000A8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_ComponentBoundEvent_InIsLeftHand' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_PlaySE_ReturnValue) == 0x0000AC, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetSBPlayerController_ReturnValue_1) == 0x0000B0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetSBPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetPreviewCostumeUniqueId_UniqueId) == 0x0000B8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetPreviewCostumeUniqueId_UniqueId' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsValid_ReturnValue_2) == 0x0000C8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_PlaySE_ReturnValue_1) == 0x0000CC, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipmentBag_ReturnValue) == 0x0000D0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetSelectedCostumeCategory_OutCostumeCategory) == 0x0000D8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetSelectedCostumeCategory_OutCostumeCategory' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_ComponentBoundEvent_InItemUniqueId) == 0x0000E0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_ComponentBoundEvent_InItemUniqueId' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipmentBag_ReturnValue_1) == 0x0000F0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipmentBag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipInfo_ReturnValue) == 0x0000F8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, Temp_bool_Variable) == 0x000108, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_PlaySE_ReturnValue_2) == 0x00010C, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_MakeLiteralByte_ReturnValue) == 0x000110, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_IsValid_1) == 0x000111, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_IsValid_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_OutEquipItemCharaCreateInfo_1) == 0x000118, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipItemCharaCreateInfoFromEquipItemInfo_OutEquipItemCharaCreateInfo_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CreateDelegate_OutputDelegate_1) == 0x000140, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, Temp_int_Array_Index_Variable) == 0x000150, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_Event_Animation) == 0x000158, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsValid_ReturnValue_3) == 0x000160, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000161, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_RetCode_2) == 0x000164, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_RetCode_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_InExpiredEquipmentData_2) == 0x000168, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_InExpiredEquipmentData_2' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_RetCode_1) == 0x000298, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_InExpiredEquipmentData_1) == 0x0002A0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_InExpiredEquipmentData_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetSBPlayerState_ReturnValue) == 0x0003D0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetSBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsValid_ReturnValue_4) == 0x0003D8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetPlayerStorageComponent_ReturnValue) == 0x0003E0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetPlayerStorageComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsValid_ReturnValue_5) == 0x0003E8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsThereExpiredEquipment_ReturnValue) == 0x0003E9, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsThereExpiredEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, Temp_bool_True_if_break_was_hit_Variable) == 0x0003EA, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_Not_PreBool_ReturnValue) == 0x0003EB, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_IsDetach) == 0x0003EC, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_IsDetach' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_CheckCostumeEquipment_EquipFlag) == 0x0003ED, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_CheckCostumeEquipment_EquipFlag' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_MakeStruct_CharaEquipItemInfo_1) == 0x0003F0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_MakeStruct_CharaEquipItemInfo_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_InItemUniqueId) == 0x000418, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_InItemUniqueId' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, Temp_int_Loop_Counter_Variable) == 0x000428, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_Add_IntInt_ReturnValue) == 0x00042C, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetEquipInfo_ReturnValue_1) == 0x000430, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetEquipInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_RetCode) == 0x000440, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, K2Node_CustomEvent_InExpiredEquipmentData) == 0x000448, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::K2Node_CustomEvent_InExpiredEquipmentData' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_Array_Get_Item) == 0x000578, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_Array_Length_ReturnValue) == 0x0005A0, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_Less_IntInt_ReturnValue) == 0x0005A4, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsCompositeWearByCostumeId_bIsValid) == 0x0005A5, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsCompositeWearByCostumeId_bIsValid' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsCompositeWearByCostumeId_IsCompositeWear) == 0x0005A6, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsCompositeWearByCostumeId_IsCompositeWear' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsCompositeWearByCostumeId_OccupiedPartsLocations) == 0x0005A8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsCompositeWearByCostumeId_OccupiedPartsLocations' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_IsCompositeWearByCostumeId_MasterCostume) == 0x0005B8, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_IsCompositeWearByCostumeId_MasterCostume' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_BooleanAND_ReturnValue) == 0x000640, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume, CallFunc_GetCharaEquipTypeFromProtectorCategory_OutCharaEquipType) == 0x000641, "Member 'MyCharaMenu_Costume_C_ExecuteUbergraph_MyCharaMenu_Costume::CallFunc_GetCharaEquipTypeFromProtectorCategory_OutCharaEquipType' has a wrong offset!");
