#pragma once

 

// Package: NewStepList

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function NewStepList.NewStepList_C.ExecuteUbergraph_NewStepList
// 0x0C50 (0x0C50 - 0x0000)
struct NewStepList_C_ExecuteUbergraph_NewStepList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName& InDungeonName)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_731D[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBUIType InUIType, bool bInVisibility, bool bInInstantly)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_731E[0x1];                                     // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_731F[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7320[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7321[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerAdventureBoardComponent*       CallFunc_GetAdventureBoardComponent_ReturnValue;   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7322[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerAdventureBoardComponent*       CallFunc_GetAdventureBoardComponent_ReturnValue_1; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InCurStep)>              K2Node_CreateDelegate_OutputDelegate_6;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FSBAdventureBoardParam>         K2Node_CustomEvent_InBoardParamList_4;             // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_InRetCode_6;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FDungeonClearConditionProgressItemInfo& InProgressItem, int32 InStepNum, int32 InProgressIndex)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 InRetCode)>              K2Node_CreateDelegate_OutputDelegate_9;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName& InQuestId)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0114(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FSBInterruptQuestPlayInfo& InPlayInfo)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0124(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class USBPlayerInterruptQuestComponent* InComponent)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName& InQuestId)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_RetCode_2;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7323[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAdventureBoardPanelParam>    K2Node_CustomEvent_PanelList;                      // 0x0160(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_InPanelId;                      // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBAdventureBoardParam>         K2Node_CustomEvent_InBoardParamList_3;             // 0x0178(0x0010)(ConstParm, ReferenceParm)
	struct FSBMailRewardData                      K2Node_CustomEvent_InRewardDataList_2;             // 0x0188(0x0180)(ConstParm)
	int32                                         K2Node_CustomEvent_InRetCode_5;                    // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7324[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAdventureBoardParam>         K2Node_CustomEvent_InBoardParamList_2;             // 0x0310(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_CustomEvent_InRetCode_4;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7325[0x4];                                     // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAdventureBoardParam>         K2Node_CustomEvent_InBoardParamList_1;             // 0x0328(0x0010)(ConstParm, ReferenceParm)
	struct FSBMailRewardData                      K2Node_CustomEvent_InRewardDataList_1;             // 0x0338(0x0180)(ConstParm)
	int32                                         K2Node_CustomEvent_InRetCode_3;                    // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7326[0x4];                                     // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBAdventureBoardParam>         K2Node_CustomEvent_InBoardParamList;               // 0x04C0(0x0010)(ConstParm, ReferenceParm)
	struct FSBMailRewardData                      K2Node_CustomEvent_InRewardDataList;               // 0x04D0(0x0180)(ConstParm)
	int32                                         K2Node_CustomEvent_InRetCode_2;                    // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7327[0x4];                                     // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAdventureBoardParam                 K2Node_CustomEvent_InBoardParam;                   // 0x0658(0x0018)(ConstParm)
	int32                                         K2Node_CustomEvent_InRetCode_1;                    // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName& InQuestId, bool InSuccess)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0674(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class USBPlayerInterruptQuestComponent* InComponent, bool bInFirst)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0684(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<struct FSBWarehouseAbilityNotifyUIInfo>& UIInfo)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0694(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bWasSuccessful)>          K2Node_CreateDelegate_OutputDelegate_17;           // 0x06A4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x06B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7328[0x3];                                     // 0x06B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_1;           // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7329[0x7];                                     // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_1;       // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue;             // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_1;           // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_2;           // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_3;           // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_4;           // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_5;           // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_6;           // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_7;           // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_10;                      // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_10;                       // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_9;                       // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_9;                        // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_8;                       // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_8;                        // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_7;                       // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_7;                        // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0750(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Result)>                  K2Node_CreateDelegate_OutputDelegate_19;           // 0x0760(0x0010)(ZeroConstructor, NoDestructor)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_8;           // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_9;           // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_6;                       // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_6;                        // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_10;          // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_20;           // 0x0798(0x0010)(ZeroConstructor, NoDestructor)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_11;          // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_5;                       // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_5;                        // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_12;          // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_13;          // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_4;                       // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_4;                        // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_21;           // 0x07E0(0x0010)(ZeroConstructor, NoDestructor)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_14;          // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_15;          // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_3;                       // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_3;                        // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_16;          // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_17;          // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_2;                       // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_2;                        // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x0830(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732A[0x7];                                     // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_2;        // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732B[0x7];                                     // 0x0859(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_3;        // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0870(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732C[0x7];                                     // 0x0871(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_4;        // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732D[0x7];                                     // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBQuestComponent*                      CallFunc_GetQuestComponent_ReturnValue;            // 0x0890(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_5;        // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732E[0x7];                                     // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBQuestComponent*                      CallFunc_GetQuestComponent_ReturnValue_1;          // 0x08B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_6;        // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_732F[0x7];                                     // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue; // 0x08D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_7;        // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x08E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x08E9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7330[0x6];                                     // 0x08EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCharacterCommonComponent*      CallFunc_GetPlayerCharacterCommonComponent_ReturnValue_1; // 0x08F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_8;        // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_8;        // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0908(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7331[0x7];                                     // 0x0909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_9;        // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBWarehouseAbilityComponent*           CallFunc_GetWarehouseAbilityComponent_ReturnValue; // 0x0918(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_9;        // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7332[0x7];                                     // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBWarehouseAbilityComponent*           CallFunc_GetWarehouseAbilityComponent_ReturnValue_1; // 0x0930(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBWarehouseAbilityNotifyUIInfo> K2Node_CustomEvent_UIInfo;                         // 0x0938(0x0010)(ConstParm, ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_10;       // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_10;       // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7333[0x3];                                     // 0x0959(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x095C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7334[0x4];                                     // 0x096C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State;               // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7335[0x7];                                     // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerInterruptQuestComponent*       CallFunc_GetInterruptQuestComponent_ReturnValue;   // 0x0980(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_24;           // 0x0988(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_11;       // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_11;       // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7336[0x3];                                     // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_25;           // 0x09AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7337[0x4];                                     // 0x09BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State_1;             // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7338[0x7];                                     // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerInterruptQuestComponent*       CallFunc_GetInterruptQuestComponent_ReturnValue_1; // 0x09D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_26;           // 0x09D8(0x0010)(ZeroConstructor, NoDestructor)
	class USBPlayerInterruptQuestComponent*       K2Node_CustomEvent_InComponent_1;                  // 0x09E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInFirst;                       // 0x09F0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7339[0x3];                                     // 0x09F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_27;           // 0x09F4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_InQuestId_2;                    // 0x0A04(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InSuccess;                      // 0x0A0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_733A[0x3];                                     // 0x0A0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InQuestId_1;                    // 0x0A10(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerInterruptQuestComponent*       K2Node_CustomEvent_InComponent;                    // 0x0A18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBInterruptQuestPlayInfo              K2Node_CustomEvent_InPlayInfo;                     // 0x0A20(0x0018)(ConstParm, NoDestructor)
	class FName                                   K2Node_CustomEvent_InQuestId;                      // 0x0A38(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_12;       // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_12;       // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_733B[0x7];                                     // 0x0A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_13;       // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State_2;             // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_733C[0x7];                                     // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_13;       // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_733D[0x7];                                     // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State_3;             // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_733E[0x3];                                     // 0x0A89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRetCode;                      // 0x0A8C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_28;           // 0x0A90(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_29;           // 0x0AA0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FSBAdventureBoardParam& InBoardParam, int32 InRetCode)> K2Node_CreateDelegate_OutputDelegate_30;           // 0x0AB0(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0AC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_Dungeon*                   K2Node_DynamicCast_AsSBGame_State_Dungeon;         // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0AD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_733F[0x7];                                     // 0x0AD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDungeonClearConditionWatcher*        CallFunc_GetClearConditionWatcher_ReturnValue;     // 0x0AD8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_Dungeon*                   K2Node_DynamicCast_AsSBGame_State_Dungeon_1;       // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7340[0x7];                                     // 0x0AF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDungeonClearConditionWatcher*        CallFunc_GetClearConditionWatcher_ReturnValue_1;   // 0x0AF8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDungeonClearConditionProgressItemInfo K2Node_CustomEvent_InProgressItem;                 // 0x0B00(0x0008)(ConstParm, NoDestructor)
	int32                                         K2Node_CustomEvent_InStepNum;                      // 0x0B08(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InProgressIndex;                // 0x0B0C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InCurStep;                      // 0x0B10(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FSBAdventureBoardParam>& InBoardParamList, struct FSBMailRewardData& InRewardDataList, int32 InRetCode)> K2Node_CreateDelegate_OutputDelegate_31;           // 0x0B14(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<struct FSBAdventureBoardParam>& InBoardParamList, struct FSBMailRewardData& InRewardDataList, int32 InRetCode)> K2Node_CreateDelegate_OutputDelegate_32;           // 0x0B24(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<struct FSBAdventureBoardParam>& InBoardParamList, int32 InRetCode)> K2Node_CreateDelegate_OutputDelegate_33;           // 0x0B34(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<struct FSBAdventureBoardParam>& InBoardParamList, struct FSBMailRewardData& InRewardDataList, int32 InRetCode)> K2Node_CreateDelegate_OutputDelegate_34;           // 0x0B44(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_InDungeonName;                  // 0x0B54(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FSBAdventureBoardPanelParam>& PanelList, int32 InPanelId, int32 RetCode)> K2Node_CreateDelegate_OutputDelegate_35;           // 0x0B5C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_36;           // 0x0B6C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_37;           // 0x0B7C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x0B8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7341[0x3];                                     // 0x0B8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemList*                         CallFunc_GetOwnItemList_ReturnValue;               // 0x0B98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNetworkDataCache_IsValid_1;            // 0x0BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7342[0x7];                                     // 0x0BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue_1;        // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemList*                         CallFunc_GetOwnItemList_ReturnValue_1;             // 0x0BB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_18;          // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_19;          // 0x0BC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_20;          // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_21;          // 0x0BD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender_1;                       // 0x0BD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param_1;                        // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0BF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7343[0x7];                                     // 0x0BF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0C00(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0C08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0C09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x0C0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7344[0x5];                                     // 0x0C0B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue;         // 0x0C10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue_1;       // 0x0C18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBUIType                                     K2Node_CustomEvent_InUIType;                       // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisibility;                  // 0x0C21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInInstantly;                   // 0x0C22(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0C23(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0C24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7345[0x3];                                     // 0x0C25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<struct FSBAdventureBoardParam>& InBoardParamList, int32 InRetCode)> K2Node_CreateDelegate_OutputDelegate_38;           // 0x0C28(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0C39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7346[0x6];                                     // 0x0C3A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue_2;       // 0x0C40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVisibleSetting_ReturnValue;            // 0x0C49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0C4A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewStepList_C_ExecuteUbergraph_NewStepList) == 0x000008, "Wrong alignment on NewStepList_C_ExecuteUbergraph_NewStepList");
static_assert(sizeof(NewStepList_C_ExecuteUbergraph_NewStepList) == 0x000C50, "Wrong size on NewStepList_C_ExecuteUbergraph_NewStepList");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, EntryPoint) == 0x000000, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, Temp_bool_Variable) == 0x000044, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, Temp_byte_Variable) == 0x000058, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, Temp_byte_Variable_1) == 0x000059, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, Temp_bool_Variable_1) == 0x00005A, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_5) == 0x00005C, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, Temp_byte_Variable_2) == 0x00006C, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000070, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, Temp_byte_Variable_3) == 0x000078, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000088, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetPlayerController_ReturnValue_1) == 0x000098, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetAdventureBoardComponent_ReturnValue) == 0x0000A0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetAdventureBoardComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_DynamicCast_AsSBPlayer_Controller_1) == 0x0000A8, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_DynamicCast_AsSBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetAdventureBoardComponent_ReturnValue_1) == 0x0000B8, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetAdventureBoardComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000C0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InBoardParamList_4) == 0x0000D0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InBoardParamList_4' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRetCode_6) == 0x0000E0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRetCode_6' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000E4, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000F4, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_9) == 0x000104, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_10) == 0x000114, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_11) == 0x000124, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_12) == 0x000134, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_13) == 0x000144, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_RetCode_2) == 0x000154, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_RetCode_2' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_RetCode_1) == 0x000158, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_PanelList) == 0x000160, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_PanelList' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InPanelId) == 0x000170, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InPanelId' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_RetCode) == 0x000174, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InBoardParamList_3) == 0x000178, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InBoardParamList_3' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRewardDataList_2) == 0x000188, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRewardDataList_2' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRetCode_5) == 0x000308, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRetCode_5' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InBoardParamList_2) == 0x000310, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InBoardParamList_2' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRetCode_4) == 0x000320, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRetCode_4' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InBoardParamList_1) == 0x000328, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InBoardParamList_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRewardDataList_1) == 0x000338, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRewardDataList_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRetCode_3) == 0x0004B8, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRetCode_3' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InBoardParamList) == 0x0004C0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InBoardParamList' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRewardDataList) == 0x0004D0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRewardDataList' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRetCode_2) == 0x000650, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRetCode_2' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InBoardParam) == 0x000658, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InBoardParam' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CustomEvent_InRetCode_1) == 0x000670, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CustomEvent_InRetCode_1' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_14) == 0x000674, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_15) == 0x000684, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_16) == 0x000694, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, K2Node_CreateDelegate_OutputDelegate_17) == 0x0006A4, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetConfigSaveManager_IsValid) == 0x0006B4, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetConfigSaveManager_ReturnValue) == 0x0006B8, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewStepList_C_ExecuteUbergraph_NewStepList, CallFunc_GetConfigSaveManager_IsValid_1) == 0x0006C0, "Member 'NewStepList_C_ExecuteUbergraph_NewStepList::CallFunc_GetConfigSaveManager_IsValid_1' has a wrong offset!");
