#pragma once

 

// Package: OtherPCMenu

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OtherPCMenu.OtherPCMenu_C.ExecuteUbergraph_OtherPCMenu
// 0x1408 (0x1408 - 0x0000)
struct OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C82[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C83[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetOtherPlayerState_OutPlayerState;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C84[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerGuildComponent*                CallFunc_GetGuildComponent_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuildRepData                          CallFunc_GetRepData_ReturnValue;                   // 0x0030(0x0080)()
	bool                                          CallFunc_IsGuildMember_ReturnValue;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPrivilegeCacheUGC_ReturnValue;         // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C85[0x5];                                     // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	ESBPlatformId                                 CallFunc_GetCurrentPlatformId_ReturnValue;         // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C86[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C87[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0118(0x0018)()
	bool                                          CallFunc_CheckXboxPrivacyTypePure_IsUGC;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckXboxPrivacyTypePure_IsRestrict;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C88[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0138(0x0018)()
	TDelegate<void(EYesNoDialogResult Result)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetPartySystemText_ReturnValue;           // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C89[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0178(0x0018)()
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterName_self_CastInput;          // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EYesNoDialogResult                            K2Node_CustomEvent_Result_1;                       // 0x01B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C8A[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x01B8(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C8B[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0228(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C8C[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterId_self_CastInput;            // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_1;             // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_SendInvitation_RecipientPlayer_CastInput; // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C8D[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetRestrictText_ReturnValue;              // 0x0298(0x0018)()
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C8E[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x02C0(0x0018)()
	class USBPlayerConcernedList*                 CallFunc_GetConcernedList_ReturnValue;             // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bWasSuccessful_1;               // 0x02E0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C8F[0x7];                                     // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerProfileMenuDetailData           K2Node_CustomEvent_PlayerProfileDetailMenuData;    // 0x02E8(0x03F8)(ConstParm)
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x06E0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C90[0x4];                                     // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterId_self_CastInput_1;          // 0x06E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_2;             // 0x06F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0708(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0718(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C91[0x7];                                     // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerProfile_C*                       CallFunc_Create_ReturnValue;                       // 0x0740(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMounting_ReturnValue;                   // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0749(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C92[0x6];                                     // 0x074A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue_1;       // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMounting_ReturnValue_1;                 // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0759(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C93[0x6];                                     // 0x075A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0770(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C94[0x7];                                     // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0780(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x07A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x07D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x07F8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0820(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0848(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0870(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0898(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x08C0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x08E8(0x0028)()
	class FString                                 CallFunc_GetFaceImageURL_ReturnValue;              // 0x0910(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0920(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBDownloadImageImpl*                   CallFunc_DownloadImage_ReturnValue;                // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0938(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C95[0x7];                                     // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDialog*                              CallFunc_ShowYesNoDialog_ReturnValue;              // 0x0958(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCurrentMatchmakingState_bExists;       // 0x0960(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C96[0x7];                                     // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMatchingGameState*                   CallFunc_GetCurrentMatchmakingState_ReturnValue;   // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EYesNoDialogResult                            K2Node_CustomEvent_Result;                         // 0x0970(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0971(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0972(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGathered_ReturnValue;                   // 0x0973(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatched_ReturnValue;                    // 0x0974(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCurrentMatchmakingState_bExists_1;     // 0x0975(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C97[0x2];                                     // 0x0976(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMatchingGameState*                   CallFunc_GetCurrentMatchmakingState_ReturnValue_1; // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanSendInvitationSelf_bResult;            // 0x0982(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0983(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C98[0x4];                                     // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_SendInvitation_RecipientPlayer_CastInput_1; // 0x0988(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_10;                   // 0x0998(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_11;                   // 0x09C0(0x0028)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_BattleHUD_C>      K2Node_DynamicCast_AsBPI_Battle_HUD;               // 0x09F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C99[0x7];                                     // 0x0A09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0A10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0A20(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x0A38(0x0018)()
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0A50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0A60(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0A70(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0A80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0A90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9A[0x7];                                     // 0x0AA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0AA8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x0AB8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_11;         // 0x0AD0(0x0018)()
	class FString                                 CallFunc_GetPartySystemText_ReturnValue_1;         // 0x0AE8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0AF8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_12;         // 0x0B38(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0B50(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0B60(0x0018)()
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterName_self_CastInput_1;        // 0x0B78(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterName_ReturnValue_1;           // 0x0B88(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_13;         // 0x0B98(0x0018)()
	TDelegate<void(bool bWasSuccessful, struct FPlayerProfileMenuDetailData& PlayerProfileDetailMenuData, int32 RetCode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0BB0(0x0010)(ZeroConstructor, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0BC0(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0C00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C9B[0x4];                                     // 0x0C04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0C08(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0C18(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0C30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0C31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9C[0x6];                                     // 0x0C32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0C38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_Dungeon*                   K2Node_DynamicCast_AsSBGame_State_Dungeon;         // 0x0C40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0C49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9D[0x6];                                     // 0x0C4A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_Dungeon*                   K2Node_DynamicCast_AsSBGame_State_Dungeon_1;       // 0x0C58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0C60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9E[0x7];                                     // 0x0C61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOtherPCEmoteMenu_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0C68(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0C70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9F[0x7];                                     // 0x0C71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue_2;       // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMounting_ReturnValue_2;                 // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0C81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0C82(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA0[0x5];                                     // 0x0C83(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0C88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterId_self_CastInput_2;          // 0x0C90(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_3;             // 0x0CA0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State;               // 0x0CB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0CB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA1[0x3];                                     // 0x0CB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0CBC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4CA2[0x4];                                     // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayerProfileMenuDetailData           K2Node_CustomEvent_ProfileData;                    // 0x0CD0(0x03F8)()
	TDelegate<void(class UObject* Sender, class UObject* Param)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x10C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckProfileEnable_IsOk;                  // 0x10D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA3[0x7];                                     // 0x10D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBOnlinePlayerState>  CallFunc_GetCharacterId_self_CastInput_3;          // 0x10E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetCharacterId_ReturnValue_4;             // 0x10F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x1100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA4[0x3];                                     // 0x1101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x1104(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bCheckBlockStatus)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x1114(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4CA5[0x4];                                     // 0x1124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBGameInstance*                        CallFunc_GetSBGameInstance_ReturnValue;            // 0x1128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bBlackListed;                   // 0x1130(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA6[0x7];                                     // 0x1131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SenderId;                       // 0x1138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBGameInstance*                        CallFunc_GetSBGameInstance_ReturnValue_1;          // 0x1148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x1150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_14;         // 0x1160(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x1178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA7[0x7];                                     // 0x1179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue_3;       // 0x1180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x1188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA8[0x7];                                     // 0x1189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue_4;       // 0x1190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x1198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x1199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bWasSuccessful;                 // 0x119A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSendAdventureCardResult               K2Node_CustomEvent_SendAdventureCardResult;        // 0x119B(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_ShowSendAdventureCardError_ReturnValue;   // 0x11A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x11A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA9[0x3];                                     // 0x11A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EYesNoDialogResult Result)>    K2Node_CreateDelegate_OutputDelegate_6;            // 0x11A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x11B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CAA[0x7];                                     // 0x11B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDialog*                              CallFunc_ShowYesNoDialog_ReturnValue_1;            // 0x11C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, struct FSendAdventureCardResult& SendAdventureCardResult)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x11C8(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x11D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_5;           // 0x11E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_15;         // 0x11F8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_16;         // 0x1210(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x1228(0x0010)(ZeroConstructor, NoDestructor)
	struct FLikeSend                              K2Node_MakeStruct_LikeSend;                        // 0x1238(0x0020)()
	TArray<struct FLikeSend>                      K2Node_MakeArray_Array_3;                          // 0x1258(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x1268(0x0010)(ZeroConstructor, NoDestructor)
	class ASBPlayerCharacter*                     CallFunc_GetPlayerCharacter_ReturnValue;           // 0x1278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x1280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x1288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x1289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CAB[0x6];                                     // 0x128A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x1290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x1298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x1299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bCheckBlockStatus;              // 0x129A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x129B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetDemoManager_IsValid;                   // 0x129C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CAC[0x3];                                     // 0x129D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDemoManager*                         CallFunc_GetDemoManager_ReturnValue;               // 0x12A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bWasSuccessful, struct FSendAdventureCardResult& SendAdventureCardResult)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x12A8(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_2;               // 0x12B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_3;               // 0x12C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBGameState_DungeonNormal*             K2Node_DynamicCast_AsSBGame_State_Dungeon_Normal;  // 0x12C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x12D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CAD[0x7];                                     // 0x12D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBGameState_DungeonNormal*             K2Node_DynamicCast_AsSBGame_State_Dungeon_Normal_1; // 0x12D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x12E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CAE[0x7];                                     // 0x12E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Sender;                         // 0x12E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Param;                          // 0x12F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x12F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetDemoManager_IsValid_1;                 // 0x1308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CAF[0x7];                                     // 0x1309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBDemoManager*                         CallFunc_GetDemoManager_ReturnValue_1;             // 0x1310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x1318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CB0[0x7];                                     // 0x1319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x1320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdatePlayerIcon_download;                // 0x1328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CB1[0x3];                                     // 0x1329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bBlackListed, const class FString& SenderId)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x132C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x133C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4CB2[0x4];                                     // 0x134C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetFaceImageURL_ReturnValue_1;            // 0x1350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBDownloadImageImpl*                   CallFunc_DownloadImage_ReturnValue_1;              // 0x1360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x1368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdatePlayerIcon_download_1;              // 0x1369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CB3[0x2];                                     // 0x136A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayerProfileMenuDetailData& ProfileData)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x136C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckPlatform_ReturnValue;                // 0x137C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCommunicateRestrict_ReturnValue;       // 0x137D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CB4[0x2];                                     // 0x137E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_2;     // 0x1380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckPlatform_ReturnValue_1;              // 0x1390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CB5[0x7];                                     // 0x1391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_17;         // 0x1398(0x0018)()
	bool                                          CallFunc_HasCommunicateRestrict_ReturnValue_1;     // 0x13B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CB6[0x7];                                     // 0x13B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_3;     // 0x13B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_18;         // 0x13C8(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x13E0(0x0010)(ZeroConstructor, NoDestructor)
	class UUIBlocker_C*                           CallFunc_Create_ReturnValue_2;                     // 0x13F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<int32>& OutLikeCountList, TArray<bool>& OutLikeBtnEnbaleList)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x13F8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu) == 0x000008, "Wrong alignment on OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu");
static_assert(sizeof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu) == 0x001408, "Wrong size on OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, EntryPoint) == 0x000000, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetOwningPlayerState_ReturnValue) == 0x000008, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetOwningPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetOtherPlayerState_OutPlayerState) == 0x000018, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetOtherPlayerState_OutPlayerState' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetGuildComponent_ReturnValue) == 0x000028, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetGuildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetRepData_ReturnValue) == 0x000030, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetRepData_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsGuildMember_ReturnValue) == 0x0000B0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsGuildMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, Temp_bool_Variable) == 0x0000B1, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_HasPrivilegeCacheUGC_ReturnValue) == 0x0000B2, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_HasPrivilegeCacheUGC_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x0000B8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCurrentPlatformId_ReturnValue) == 0x0000E0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCurrentPlatformId_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetTextFromAssetByName_ReturnValue_1) == 0x0000E8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetTextFromAssetByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_SwitchEnum_CmpSuccess) == 0x0000F8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000100, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000118, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_CheckXboxPrivacyTypePure_IsUGC) == 0x000130, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_CheckXboxPrivacyTypePure_IsUGC' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_CheckXboxPrivacyTypePure_IsRestrict) == 0x000131, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_CheckXboxPrivacyTypePure_IsRestrict' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000138, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000150, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetPartySystemText_ReturnValue) == 0x000160, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetPartySystemText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000178, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterName_self_CastInput) == 0x000190, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterName_self_CastInput' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterName_ReturnValue) == 0x0001A0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_CustomEvent_Result_1) == 0x0001B0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue_5) == 0x0001B8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001D0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_MakeStruct_FormatArgumentData) == 0x0001D8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_MakeArray_Array) == 0x000218, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Format_ReturnValue) == 0x000228, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsValid_ReturnValue_3) == 0x000240, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterId_ReturnValue) == 0x000248, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterId_self_CastInput) == 0x000258, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterId_self_CastInput' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterId_ReturnValue_1) == 0x000268, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_SendInvitation_RecipientPlayer_CastInput) == 0x000278, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_SendInvitation_RecipientPlayer_CastInput' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_MakeLiteralByte_ReturnValue) == 0x000288, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetPlayerController_ReturnValue) == 0x000290, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetRestrictText_ReturnValue) == 0x000298, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetRestrictText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x0002B0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_DynamicCast_bSuccess) == 0x0002B8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_Select_Default) == 0x0002C0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetConcernedList_ReturnValue) == 0x0002D8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetConcernedList_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_CustomEvent_bWasSuccessful_1) == 0x0002E0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_CustomEvent_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_CustomEvent_PlayerProfileDetailMenuData) == 0x0002E8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_CustomEvent_PlayerProfileDetailMenuData' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_CustomEvent_RetCode) == 0x0006E0, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterId_self_CastInput_1) == 0x0006E8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterId_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetCharacterId_ReturnValue_2) == 0x0006F8, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetCharacterId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetSBRetMessage_ReturnValue) == 0x000708, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Conv_StringToText_ReturnValue_6) == 0x000718, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000730, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetSBPlayerCharacter_ReturnValue) == 0x000738, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetSBPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Create_ReturnValue) == 0x000740, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsMounting_ReturnValue) == 0x000748, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsMounting_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000749, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_GetSBPlayerCharacter_ReturnValue_1) == 0x000750, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_GetSBPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_IsMounting_ReturnValue_1) == 0x000758, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_IsMounting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x000759, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000760, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000768, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, K2Node_Event_Animation) == 0x000770, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000778, "Member 'OtherPCMenu_C_ExecuteUbergraph_OtherPCMenu::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
