#pragma once

 

// Package: PassiveImagineInfoForBattleCordeEdit

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PassiveImagineInfoForBattleCordeEdit.PassiveImagineInfoForBattleCordeEdit_C.ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit
// 0x0008 (0x0008 - 0x0000)
struct PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit) == 0x000004, "Wrong alignment on PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit");
static_assert(sizeof(PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit) == 0x000008, "Wrong size on PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit, EntryPoint) == 0x000000, "Member 'PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit::EntryPoint' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit, K2Node_Event_IsDesignTime) == 0x000004, "Member 'PassiveImagineInfoForBattleCordeEdit_C_ExecuteUbergraph_PassiveImagineInfoForBattleCordeEdit::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function PassiveImagineInfoForBattleCordeEdit.PassiveImagineInfoForBattleCordeEdit_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PassiveImagineInfoForBattleCordeEdit_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveImagineInfoForBattleCordeEdit_C_PreConstruct) == 0x000001, "Wrong alignment on PassiveImagineInfoForBattleCordeEdit_C_PreConstruct");
static_assert(sizeof(PassiveImagineInfoForBattleCordeEdit_C_PreConstruct) == 0x000001, "Wrong size on PassiveImagineInfoForBattleCordeEdit_C_PreConstruct");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PassiveImagineInfoForBattleCordeEdit_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PassiveImagineInfoForBattleCordeEdit.PassiveImagineInfoForBattleCordeEdit_C.CreatePassiveImagineIconBtnList
// 0x0068 (0x0068 - 0x0000)
struct PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList final
{
public:
	int32                                         LocalSlotTypeCnt;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C7[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82C8[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_PassiveImagineIconBtnForBattleSet_C* CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82C9[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CA[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CB[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList) == 0x000008, "Wrong alignment on PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList");
static_assert(sizeof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList) == 0x000068, "Wrong size on PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, LocalSlotTypeCnt) == 0x000000, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::LocalSlotTypeCnt' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, Temp_int_Variable) == 0x000004, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, Temp_int_Variable_1) == 0x000008, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_GetValidValue_ReturnValue) == 0x000014, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000015, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, K2Node_SwitchEnum_CmpSuccess) == 0x000016, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000017, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Create_ReturnValue) == 0x000020, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, Temp_float_Variable) == 0x000028, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, Temp_float_Variable_1) == 0x00002C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, Temp_bool_Variable) == 0x000030, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_MakeLiteralInt_ReturnValue) == 0x000034, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, K2Node_Select_Default) == 0x00003C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, K2Node_MakeStruct_Margin) == 0x000040, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, Temp_int_Variable_2) == 0x000054, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_MakeLiteralBool_ReturnValue) == 0x000058, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000060, "Member 'PassiveImagineInfoForBattleCordeEdit_C_CreatePassiveImagineIconBtnList::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function PassiveImagineInfoForBattleCordeEdit.PassiveImagineInfoForBattleCordeEdit_C.GetPassiveImagineIconBtn
// 0x0040 (0x0040 - 0x0000)
struct PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn final
{
public:
	ESBPlayerPassiveImagineSlotType               InPassiveImagineSlotType;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsValid;                                        // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CC[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_PassiveImagineIconBtnForBattleSet_C* OutImagineIconBtn;                                 // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerPassiveImagineSlotType               LocalSlotType;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82CD[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyCharaMenu_PassiveImagineIconBtnForBattleSet_C* K2Node_DynamicCast_AsMy_Chara_Menu_Passive_Imagine_Icon_Btn_for_Battle_Set; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82CF[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerPassiveImagineSlotType               CallFunc_GetPassiveImagineSlotType_OutSlotType;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn) == 0x000008, "Wrong alignment on PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn");
static_assert(sizeof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn) == 0x000040, "Wrong size on PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, InPassiveImagineSlotType) == 0x000000, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::InPassiveImagineSlotType' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, OutIsValid) == 0x000001, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::OutIsValid' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, OutImagineIconBtn) == 0x000008, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::OutImagineIconBtn' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, LocalSlotType) == 0x000010, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::LocalSlotType' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, Temp_int_Variable) == 0x000014, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, K2Node_DynamicCast_AsMy_Chara_Menu_Passive_Imagine_Icon_Btn_for_Battle_Set) == 0x000028, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::K2Node_DynamicCast_AsMy_Chara_Menu_Passive_Imagine_Icon_Btn_for_Battle_Set' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_GetChildrenCount_ReturnValue) == 0x000034, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_GetPassiveImagineSlotType_OutSlotType) == 0x00003C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_GetPassiveImagineSlotType_OutSlotType' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003D, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003E, "Member 'PassiveImagineInfoForBattleCordeEdit_C_GetPassiveImagineIconBtn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PassiveImagineInfoForBattleCordeEdit.PassiveImagineInfoForBattleCordeEdit_C.Setup
// 0x0570 (0x0570 - 0x0000)
struct PassiveImagineInfoForBattleCordeEdit_C_Setup final
{
public:
	TArray<class FString>                         InPassiveImagineUniqueIds;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          InSetupByCurrEquip;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  InClassType;                                       // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  LocalClassType;                                    // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D0[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           LocalOwnItemInfo;                                  // 0x0018(0x0118)(Edit, BlueprintVisible)
	int32                                         LocalSlotCnt;                                      // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsAlertIconOn;                                // 0x0134(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsPassiveImagineIconEmpty;                    // 0x0135(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D1[0x2];                                     // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalImagineUniqueId;                              // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UMyCharaMenu_PassiveImagineIconBtnForBattleSet_C* LocalIconBtn;                                      // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerPassiveImagineSlotType               LocalSlotType;                                     // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D2[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     LocalSBPlayerCharacter;                            // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D3[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D4[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_2;             // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D5[0x1];                                     // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_3;             // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1; // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82D6[0x1];                                     // 0x018B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D7[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           K2Node_MakeStruct_OwnItemInfo;                     // 0x0198(0x0118)()
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D8[0x3];                                     // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharacterStorageNumber_ReturnValue;    // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetStorage_ReturnValue;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist;         // 0x02CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D9[0x2];                                     // 0x02CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue;       // 0x02D0(0x0118)(ConstParm)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DA[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPassiveImagineIconBtn_OutIsValid;      // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DB[0x3];                                     // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMyCharaMenu_PassiveImagineIconBtnForBattleSet_C* CallFunc_GetPassiveImagineIconBtn_OutImagineIconBtn; // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DC[0x7];                                     // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPassiveImagineUniqueID_ReturnValue;    // 0x0418(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DD[0x3];                                     // 0x0431(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BP_FindItem_ByUniqueId_bOutExist_1;       // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DE[0x6];                                     // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1;     // 0x0440(0x0118)(ConstParm)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue_1;            // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82DF[0x7];                                     // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveImagineInfoForBattleCordeEdit_C_Setup) == 0x000008, "Wrong alignment on PassiveImagineInfoForBattleCordeEdit_C_Setup");
static_assert(sizeof(PassiveImagineInfoForBattleCordeEdit_C_Setup) == 0x000570, "Wrong size on PassiveImagineInfoForBattleCordeEdit_C_Setup");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, InPassiveImagineUniqueIds) == 0x000000, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::InPassiveImagineUniqueIds' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, InSetupByCurrEquip) == 0x000010, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::InSetupByCurrEquip' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, InClassType) == 0x000011, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::InClassType' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalClassType) == 0x000012, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalClassType' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalOwnItemInfo) == 0x000018, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalOwnItemInfo' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalSlotCnt) == 0x000130, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalSlotCnt' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalIsAlertIconOn) == 0x000134, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalIsAlertIconOn' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalIsPassiveImagineIconEmpty) == 0x000135, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalIsPassiveImagineIconEmpty' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalImagineUniqueId) == 0x000138, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalImagineUniqueId' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalIconBtn) == 0x000148, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalIconBtn' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalSlotType) == 0x000150, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalSlotType' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, LocalSBPlayerCharacter) == 0x000158, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::LocalSBPlayerCharacter' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, Temp_int_Variable) == 0x000160, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Conv_IntToByte_ReturnValue) == 0x000168, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000169, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00016C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, Temp_int_Variable_1) == 0x000170, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000174, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetValidValue_ReturnValue) == 0x000175, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, Temp_int_Variable_2) == 0x000178, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, K2Node_SwitchEnum_CmpSuccess) == 0x00017C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Conv_IntToByte_ReturnValue_2) == 0x00017D, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Conv_IntToByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetValidValue_ReturnValue_1) == 0x00017E, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, Temp_int_Variable_3) == 0x000180, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Add_IntInt_ReturnValue_1) == 0x000184, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, K2Node_SwitchEnum_CmpSuccess_1) == 0x000188, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Conv_IntToByte_ReturnValue_3) == 0x000189, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Conv_IntToByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1) == 0x00018A, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetEnumeratorValueFromIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00018C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_MakeLiteralInt_ReturnValue) == 0x000190, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Less_IntInt_ReturnValue) == 0x000194, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, K2Node_MakeStruct_OwnItemInfo) == 0x000198, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::K2Node_MakeStruct_OwnItemInfo' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetEquipmentBag_ReturnValue) == 0x0002B0, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_IsValid_ReturnValue) == 0x0002B8, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetCharacterStorageNumber_ReturnValue) == 0x0002BC, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetCharacterStorageNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetStorage_ReturnValue) == 0x0002C0, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, Temp_int_Variable_4) == 0x0002C8, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_IsValid_ReturnValue_1) == 0x0002CC, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_BP_FindItem_ByUniqueId_bOutExist) == 0x0002CD, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_BP_FindItem_ByUniqueId_bOutExist' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_BP_FindItem_ByUniqueId_ReturnValue) == 0x0002D0, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_BP_FindItem_ByUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0003E8, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Array_Get_Item) == 0x0003F0, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Add_IntInt_ReturnValue_2) == 0x000400, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetPassiveImagineIconBtn_OutIsValid) == 0x000404, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetPassiveImagineIconBtn_OutIsValid' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetPassiveImagineIconBtn_OutImagineIconBtn) == 0x000408, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetPassiveImagineIconBtn_OutImagineIconBtn' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_MakeLiteralBool_ReturnValue) == 0x000410, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetPassiveImagineUniqueID_ReturnValue) == 0x000418, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetPassiveImagineUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Array_Add_ReturnValue) == 0x000428, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x00042C, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Less_IntInt_ReturnValue_1) == 0x000430, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Array_Length_ReturnValue) == 0x000434, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_Less_IntInt_ReturnValue_2) == 0x000438, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_BP_FindItem_ByUniqueId_bOutExist_1) == 0x000439, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_BP_FindItem_ByUniqueId_bOutExist_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1) == 0x000440, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_BP_FindItem_ByUniqueId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_MakeLiteralBool_ReturnValue_1) == 0x000558, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_MakeLiteralBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_GetSBPlayerCharacter_ReturnValue) == 0x000560, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_GetSBPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_Setup, CallFunc_IsValid_ReturnValue_2) == 0x000568, "Member 'PassiveImagineInfoForBattleCordeEdit_C_Setup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function PassiveImagineInfoForBattleCordeEdit.PassiveImagineInfoForBattleCordeEdit_C.SetStorageMode
// 0x0001 (0x0001 - 0x0000)
struct PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode final
{
public:
	bool                                          InIsStorageMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode) == 0x000001, "Wrong alignment on PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode");
static_assert(sizeof(PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode) == 0x000001, "Wrong size on PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode");
static_assert(offsetof(PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode, InIsStorageMode) == 0x000000, "Member 'PassiveImagineInfoForBattleCordeEdit_C_SetStorageMode::InIsStorageMode' has a wrong offset!");

}

