#pragma once

 

// Package: PlayerNamePlate

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PlayerNamePlate.PlayerNamePlate_C.OnChangeDrawSize__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature final
{
public:
	struct FVector2D                              DrawSize;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature) == 0x000004, "Wrong alignment on PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature");
static_assert(sizeof(PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature) == 0x000008, "Wrong size on PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature");
static_assert(offsetof(PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature, DrawSize) == 0x000000, "Member 'PlayerNamePlate_C_OnChangeDrawSize__DelegateSignature::DrawSize' has a wrong offset!");

// Function PlayerNamePlate.PlayerNamePlate_C.OnChangeScale__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct PlayerNamePlate_C_OnChangeScale__DelegateSignature final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerNamePlate_C_OnChangeScale__DelegateSignature) == 0x000004, "Wrong alignment on PlayerNamePlate_C_OnChangeScale__DelegateSignature");
static_assert(sizeof(PlayerNamePlate_C_OnChangeScale__DelegateSignature) == 0x000004, "Wrong size on PlayerNamePlate_C_OnChangeScale__DelegateSignature");
static_assert(offsetof(PlayerNamePlate_C_OnChangeScale__DelegateSignature, Scale) == 0x000000, "Member 'PlayerNamePlate_C_OnChangeScale__DelegateSignature::Scale' has a wrong offset!");

// Function PlayerNamePlate.PlayerNamePlate_C.ExecuteUbergraph_PlayerNamePlate
// 0x06C8 (0x06C8 - 0x0000)
struct PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4510[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ESBTensionTagType TensionTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<struct FPlayerProfileSummaryData>& PlayerProfileSummaryData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBTensionTagType                             Temp_byte_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(bool bIsShow)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsFadeIn)>                K2Node_CreateDelegate_OutputDelegate_5;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsShow_1;                      // 0x006D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4511[0x1];                                     // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerId_ReturnValue;                  // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowPartyNamePlate_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowOtherNamePlate_ReturnValue;         // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsShow;                        // 0x008A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4512[0x5];                                     // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerId_ReturnValue_1;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4513[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerCharacter*                     K2Node_DynamicCast_AsSBPlayer_Character;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4514[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetValidPlayerState_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4515[0x6];                                     // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerGuildComponent*                CallFunc_GetGuildComponent_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGuildMember_ReturnValue;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4516[0x1];                                     // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsShow)>                 K2Node_CreateDelegate_OutputDelegate_6;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_1;           // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4517[0x3];                                     // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_1;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeamTagVisible_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_2;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4518[0x6];                                     // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_2;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_3;           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4519[0x6];                                     // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_3;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBUIType InUIType, bool bInVisibility, bool bInInstantly)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsCheckParty_ReturnValue;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451A[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InAchievementSelected;                // 0x0124(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451B[0x6];                                     // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAchievementMasterData_IsExists;        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451C[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAchievementMasterData                 CallFunc_GetAchievementMasterData_ReturnValue;     // 0x0140(0x0078)()
	class FString                                 CallFunc_GetAchievementName_ReturnValue;           // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01C8(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451D[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01E8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0210(0x0028)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451E[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_DefaultGameInstance_C*              K2Node_DynamicCast_AsBP_Default_Game_Instance;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451F[0x3];                                     // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InQuestId_2;                    // 0x0264(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4520[0x4];                                     // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4521[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerInterruptQuestComponent*       K2Node_CustomEvent_InComponent_1;                  // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInFirst;                       // 0x0288(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4522[0x7];                                     // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerInterruptQuestComponent*       CallFunc_GetInterruptQuestComponent_ReturnValue;   // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InQuestId_1;                    // 0x0298(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4523[0x7];                                     // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBInterruptQuestPlayInfo              K2Node_CustomEvent_InPlayInfo;                     // 0x02A8(0x0018)(ConstParm, NoDestructor)
	class FName                                   K2Node_CustomEvent_InQuestId;                      // 0x02C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InSuccess;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4524[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerInterruptQuestComponent*       K2Node_CustomEvent_InComponent;                    // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_DefaultGameInstance_C*              K2Node_DynamicCast_AsBP_Default_Game_Instance_1;   // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4525[0x7];                                     // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4526[0x6];                                     // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         K2Node_DynamicCast_AsSBPlayer_State_1;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4527[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerInterruptQuestComponent*       CallFunc_GetInterruptQuestComponent_ReturnValue_1; // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bParty;                               // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4528[0x6];                                     // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0328(0x0028)()
	class FString                                 K2Node_Event_Name;                                 // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HpRate_1;                             // 0x0360(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4529[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0368(0x0018)()
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsHealChainColor;               // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452A[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TeamNumber;                           // 0x0384(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTeamColor_Color;                       // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452B[0x3];                                     // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x03AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452C[0x4];                                     // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBCharacter*                           K2Node_Event_InCharacter;                          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBHostility                                  K2Node_Event_Hostility;                            // 0x03C8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452D[0x2];                                     // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetHostilityColor_Color;                  // 0x03CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_HpRate;                               // 0x03EC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue_1;                  // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUIVisibleSetting_ReturnValue;          // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_452E[0x6];                                     // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue;         // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBUIType                                     K2Node_CustomEvent_InUIType;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInVisibility;                  // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInInstantly;                   // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0413(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInVisibility_2;                      // 0x0414(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInVisibility_1;                      // 0x0415(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0416(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0417(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_452F[0x7];                                     // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InWidthRate;                          // 0x0450(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4530[0x4];                                     // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_4;           // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0474(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4531[0x4];                                     // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_5;           // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_6;           // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_2;                    // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDepth;                              // 0x0498(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x049D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4532[0x2];                                     // 0x049E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x04AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFadeIn;                       // 0x04AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4533[0x2];                                     // 0x04AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIVisibleSettings*                   CallFunc_GetUIVisibleSettings_ReturnValue_1;       // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USBPlayerInterruptQuestComponent* InComponent)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x04B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bInVisibility;                        // 0x04C8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInteractionUIVisibility_IsVisibilty;    // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4534[0x2];                                     // 0x04CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_InScreenPositionOffset;               // 0x04CC(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName& InQuestId, bool InSuccess)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x04DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x04EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4535[0x3];                                     // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x04F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FSBInterruptQuestPlayInfo& InPlayInfo)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0500(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4536[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerState*                         CallFunc_GetValidPlayerState_ReturnValue_1;        // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4537[0x3];                                     // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x052C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4538[0x4];                                     // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetValidPlayerState_ReturnValue_2;        // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerGuildComponent*                CallFunc_GetGuildComponent_ReturnValue_1;          // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4539[0x7];                                     // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuildRepData                          CallFunc_GetRepData_ReturnValue;                   // 0x0558(0x0080)()
	bool                                          CallFunc_IsGuildMember_ReturnValue_1;              // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_453A[0x7];                                     // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerCommunicateSettingsComponent*  CallFunc_GetPlayerCommunicateComponent_ReturnValue; // 0x05E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBTensionTagType                             CallFunc_GetTensionTag_ReturnValue;                // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_453B[0x2];                                     // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName& InQuestId)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x05EC(0x0010)(ZeroConstructor, NoDestructor)
	ESBTensionTagType                             K2Node_CustomEvent_TensionTag;                     // 0x05FC(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453C[0x3];                                     // 0x05FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerConcernedList*                 CallFunc_GetConcernedList_ReturnValue;             // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPlayerProfileSummaryData>      K2Node_CustomEvent_PlayerProfileSummaryData;       // 0x0610(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FPlayerProfileSummaryData>      CallFunc_GetFriendList_ReturnValue;                // 0x0620(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_453D[0x2];                                     // 0x0632(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x064C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0654(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid_4;           // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_453E[0x3];                                     // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue_4;       // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USBPlayerInterruptQuestComponent* InComponent, bool bInFirst)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0668(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetPlayerId_ReturnValue_2;                // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTeamTagVisible_ReturnValue_1;           // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x068A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_453F[0x1];                                     // 0x068B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName& InQuestId)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x068C(0x0010)(ZeroConstructor, NoDestructor)
	ESBTensionTagType                             K2Node_CustomEvent_InTensionTagId;                 // 0x069C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidSimplycityPartyImprovement_ReturnValue; // 0x069D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4540[0x2];                                     // 0x069E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetValidPlayerState_ReturnValue_3;        // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerCommunicateSettingsComponent*  CallFunc_GetPlayerCommunicateComponent_ReturnValue_1; // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBTensionTagType                             CallFunc_GetTensionTag_ReturnValue_1;              // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4541[0x7];                                     // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerState*                         CallFunc_GetValidPlayerState_ReturnValue_4;        // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSimplycityPartyOn_ReturnValue;         // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBTensionTagType                             K2Node_Select_Default_6;                           // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBTensionTagType                             K2Node_Select_Default_7;                           // 0x06C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate) == 0x000008, "Wrong alignment on PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate");
static_assert(sizeof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate) == 0x0006C8, "Wrong size on PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, EntryPoint) == 0x000000, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_bool_Variable) == 0x000004, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_bool_Variable_1) == 0x000048, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_bool_Variable_2) == 0x000049, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_byte_Variable) == 0x00004A, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_bool_Variable_3) == 0x00004B, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_4) == 0x00004C, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_5) == 0x00005C, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_bool_Variable_4) == 0x00006C, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CustomEvent_bIsShow_1) == 0x00006D, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CustomEvent_bIsShow_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_IsValid) == 0x00006E, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_IsValid' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_ReturnValue) == 0x000070, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetPlayerId_ReturnValue) == 0x000078, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetPlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsShowPartyNamePlate_ReturnValue) == 0x000088, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsShowPartyNamePlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsShowOtherNamePlate_ReturnValue) == 0x000089, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsShowOtherNamePlate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CustomEvent_bIsShow) == 0x00008A, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CustomEvent_bIsShow' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetPlayerId_ReturnValue_1) == 0x000090, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetPlayerId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_DynamicCast_AsSBPlayer_Character) == 0x0000A8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_DynamicCast_AsSBPlayer_Character' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetValidPlayerState_ReturnValue) == 0x0000B8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetValidPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_byte_Variable_1) == 0x0000C0, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetGuildComponent_ReturnValue) == 0x0000C8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetGuildComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_byte_Variable_2) == 0x0000D0, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsValid_ReturnValue_2) == 0x0000D1, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsGuildMember_ReturnValue) == 0x0000D2, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsGuildMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000D4, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_IsValid_1) == 0x0000E4, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_IsValid_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_ReturnValue_1) == 0x0000E8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsTeamTagVisible_ReturnValue) == 0x0000F0, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsTeamTagVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_IsValid_2) == 0x0000F1, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_IsValid_2' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_ReturnValue_2) == 0x0000F8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, Temp_bool_Variable_5) == 0x000100, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_IsValid_3) == 0x000101, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_IsValid_3' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetConfigSaveManager_ReturnValue_3) == 0x000108, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetConfigSaveManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_CreateDelegate_OutputDelegate_7) == 0x000110, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_IsCheckParty_ReturnValue) == 0x000120, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_IsCheckParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_Select_Default) == 0x000121, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_Event_InAchievementSelected) == 0x000124, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_Event_InAchievementSelected' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000128, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetMasterDataManager_IsValid) == 0x000129, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetMasterDataManager_ReturnValue) == 0x000130, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetAchievementMasterData_IsExists) == 0x000138, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetAchievementMasterData_IsExists' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetAchievementMasterData_ReturnValue) == 0x000140, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetAchievementMasterData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetAchievementName_ReturnValue) == 0x0001B8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetAchievementName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_Conv_StringToText_ReturnValue) == 0x0001C8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001E0, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_MakeStruct_SlateColor) == 0x0001E8, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_MakeStruct_SlateColor_1) == 0x000210, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetOwningPlayer_ReturnValue) == 0x000238, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, CallFunc_GetGameInstance_ReturnValue) == 0x000240, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x000248, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'PlayerNamePlate_C_ExecuteUbergraph_PlayerNamePlate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
