#pragma once

 

// Package: ProbabilityDisplay_ImagineCraftEffectItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProbabilityDisplay_ImagineCraftEffectItem.ProbabilityDisplay_ImagineCraftEffectItem_C.ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem
// 0x00E8 (0x00E8 - 0x0000)
struct ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9408[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9409[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_940A[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00C8(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem) == 0x000008, "Wrong alignment on ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem");
static_assert(sizeof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem) == 0x0000E8, "Wrong size on ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, EntryPoint) == 0x000000, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Conv_IntToString_ReturnValue) == 0x000008, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_SelectString_ReturnValue) == 0x000018, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000068, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000070, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_SelectString_ReturnValue_1) == 0x000080, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, K2Node_MakeStruct_LinearColor) == 0x000090, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B0, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Percent_IntInt_ReturnValue) == 0x0000C0, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000C8, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'ProbabilityDisplay_ImagineCraftEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_ImagineCraftEffectItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

