#pragma once

 

// Package: ProbabilityDisplay_WeaponCraftSlotListItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProbabilityDisplay_WeaponCraftSlotListItem.ProbabilityDisplay_WeaponCraftSlotListItem_C.ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem
// 0x00B8 (0x00B8 - 0x0000)
struct ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SlotNum;                        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_GreatSuccessRate;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SuccessRate;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F8F[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0098(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem) == 0x000008, "Wrong alignment on ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem");
static_assert(sizeof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem) == 0x0000B8, "Wrong size on ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, EntryPoint) == 0x000000, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, K2Node_CustomEvent_SlotNum) == 0x000014, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::K2Node_CustomEvent_SlotNum' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, K2Node_CustomEvent_GreatSuccessRate) == 0x000018, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::K2Node_CustomEvent_GreatSuccessRate' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, K2Node_CustomEvent_SuccessRate) == 0x00001C, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::K2Node_CustomEvent_SuccessRate' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000030, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000050, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Percent_IntInt_ReturnValue) == 0x000090, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000098, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponCraftSlotListItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ProbabilityDisplay_WeaponCraftSlotListItem.ProbabilityDisplay_WeaponCraftSlotListItem_C.Setup
// 0x000C (0x000C - 0x0000)
struct ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup final
{
public:
	int32                                         SlotNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GreatSuccessRate;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SuccessRate;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup) == 0x000004, "Wrong alignment on ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup");
static_assert(sizeof(ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup) == 0x00000C, "Wrong size on ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup, SlotNum) == 0x000000, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup::SlotNum' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup, GreatSuccessRate) == 0x000004, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup::GreatSuccessRate' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup, SuccessRate) == 0x000008, "Member 'ProbabilityDisplay_WeaponCraftSlotListItem_C_Setup::SuccessRate' has a wrong offset!");

}

