#pragma once

 

// Package: ProbabilityDisplay_WeaponFusionEffectItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ProbabilityDisplay_WeaponFusionEffectItem.ProbabilityDisplay_WeaponFusionEffectItem_C.ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem
// 0x00D8 (0x00D8 - 0x0000)
struct ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_940B[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EffectName;                     // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_EffectValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDispPercentage;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_940C[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_940D[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_940E[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00B0(0x0018)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem) == 0x000008, "Wrong alignment on ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem");
static_assert(sizeof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem) == 0x0000D8, "Wrong size on ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, EntryPoint) == 0x000000, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, Temp_bool_Variable) == 0x000006, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000007, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, Temp_bool_Variable_1) == 0x000008, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000009, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_CustomEvent_EffectName) == 0x000010, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_CustomEvent_EffectName' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_CustomEvent_EffectValue) == 0x000020, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_CustomEvent_EffectValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_CustomEvent_Index) == 0x000024, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_CustomEvent_IsDispPercentage) == 0x000028, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_CustomEvent_IsDispPercentage' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_Select_Default) == 0x000029, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Percent_IntInt_ReturnValue) == 0x00002C, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_SelectString_ReturnValue) == 0x000068, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_Select_Default_1) == 0x000078, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000B0, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem, K2Node_MakeStruct_LinearColor) == 0x0000C8, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_ExecuteUbergraph_ProbabilityDisplay_WeaponFusionEffectItem::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function ProbabilityDisplay_WeaponFusionEffectItem.ProbabilityDisplay_WeaponFusionEffectItem_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct ProbabilityDisplay_WeaponFusionEffectItem_C_Setup final
{
public:
	class FString                                 Param_EffectName;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Param_EffectValue;                                 // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDispPercentage;                                  // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ProbabilityDisplay_WeaponFusionEffectItem_C_Setup) == 0x000008, "Wrong alignment on ProbabilityDisplay_WeaponFusionEffectItem_C_Setup");
static_assert(sizeof(ProbabilityDisplay_WeaponFusionEffectItem_C_Setup) == 0x000020, "Wrong size on ProbabilityDisplay_WeaponFusionEffectItem_C_Setup");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_Setup, Param_EffectName) == 0x000000, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_Setup::Param_EffectName' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_Setup, Param_EffectValue) == 0x000010, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_Setup::Param_EffectValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_Setup, Param_Index) == 0x000014, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_Setup::Param_Index' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_WeaponFusionEffectItem_C_Setup, IsDispPercentage) == 0x000018, "Member 'ProbabilityDisplay_WeaponFusionEffectItem_C_Setup::IsDispPercentage' has a wrong offset!");

}

