#pragma once

 

// Package: ProbabilityDisplay

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function ProbabilityDisplay.ProbabilityDisplay_C.ExecuteUbergraph_ProbabilityDisplay
// 0x1270 (0x1270 - 0x0000)
struct ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9499[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949A[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_GashaBonusListItem_C* CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949B[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949C[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949D[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_949E[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplayButton_C*            CallFunc_Create_ReturnValue_1;                     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_949F[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A0[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_94A1[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplayButton_C*            CallFunc_Create_ReturnValue_2;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0138(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A2[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMasterRewardLotteryGroupsRewards    K2Node_CustomEvent_LotteryReward_1;                // 0x0180(0x0038)(ConstParm, NoDestructor)
	struct FCraftMasterData                       K2Node_CustomEvent_CraftMaster_1;                  // 0x01B8(0x0088)()
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x0250(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindWeaponMaster_bIsValid;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A3[0x7];                                     // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_FindWeaponMaster_WeaponMaster;            // 0x0270(0x00B0)()
	bool                                          CallFunc_BP_GetWeaponKillerPerkPickMasterData_IsExists; // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A4[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBWeaponKillerPerkPickMasterData> CallFunc_BP_GetWeaponKillerPerkPickMasterData_ReturnValue; // 0x0328(0x0010)(ReferenceParm)
	struct FSBWeaponKillerPerkPickMasterData      CallFunc_Array_Get_Item_1;                         // 0x0338(0x0020)(NoDestructor)
	class FString                                 CallFunc_GetWeaponText_ReturnValue;                // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0368(0x0018)()
	bool                                          CallFunc_BP_GetAbilityEffectMasterData_IsExists;   // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A5[0x3];                                     // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAbilityEffectMasterData             CallFunc_BP_GetAbilityEffectMasterData_ReturnValue; // 0x0384(0x0024)(NoDestructor)
	bool                                          CallFunc_GetAbilityMasterDataByEffectId_IsExists;  // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A6[0x7];                                     // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAbilityMasterData                   CallFunc_GetAbilityMasterDataByEffectId_ReturnValue; // 0x03B0(0x0048)()
	class FString                                 CallFunc_GetWeaponPerkText_ReturnValue;            // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAbilityConfigByAbilityDBRowName_IsValid; // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A7[0x3];                                     // 0x040D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAbilityConfig                       CallFunc_GetAbilityConfigByAbilityDBRowName_OutAbilityConfig; // 0x0410(0x0038)()
	TArray<float>                                 CallFunc_GetWeaponPerkRates_Rate;                  // 0x0448(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A8[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplay_GashaBonusListItem_C* CallFunc_Create_ReturnValue_3;                     // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_2;                         // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_3;                         // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_WeaponFusionListItem_C* CallFunc_Create_ReturnValue_4;                     // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplayButton_C*            CallFunc_Create_ReturnValue_5;                     // 0x0478(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_2;    // 0x0490(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonId;                       // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_WeaponTuningTopItem_C* CallFunc_Create_ReturnValue_6;                     // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94A9[0x6];                                     // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplayButton_C*            CallFunc_Create_ReturnValue_7;                     // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_3;    // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_WeaponFusionListItem_C* CallFunc_Create_ReturnValue_8;                     // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_WeaponFusionTopItem_C* CallFunc_Create_ReturnValue_9;                     // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_ImagineCraftListItem_C* CallFunc_Create_ReturnValue_10;                    // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Step_1;                         // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94AA[0x3];                                     // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBGashaInfo                           K2Node_ComponentBoundEvent_GashaInfo;              // 0x04F8(0x01C8)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_ImagineCraftTopItem_C* CallFunc_Create_ReturnValue_11;                    // 0x06C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94AB[0x7];                                     // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplay_ItemCraftListItem_C* CallFunc_Create_ReturnValue_12;                    // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBGashaComponent*                      CallFunc_GetGashaComponent_ReturnValue;            // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentGashaLapCount_ReturnValue;      // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentGashaStepMax_ReturnValue;       // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentGashaStepNow_ReturnValue;       // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94AC[0x4];                                     // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProbabilityDisplay_ItemCraftTopItem_C* CallFunc_Create_ReturnValue_13;                    // 0x0700(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCraftMasterData                       K2Node_CustomEvent_CraftMaster;                    // 0x0708(0x0088)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0790(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_WeaponCraftSlotListItem_C* CallFunc_Create_ReturnValue_14;                    // 0x0798(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_2;      // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_3;      // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindItemMaster_bIsValid;                  // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94AD[0x7];                                     // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        CallFunc_FindItemMaster_ItemMaster;                // 0x07B8(0x00D0)()
	class FString                                 CallFunc_GetItemText_ReturnValue;                  // 0x0888(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0898(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x08A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x08C0(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x08D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x08E8(0x0018)()
	struct FSBMasterImagine                       K2Node_CustomEvent_MasterImagine;                  // 0x0900(0x00B0)()
	class UProbabilityDisplay_WeaponCraftSlotTopItem_C* CallFunc_Create_ReturnValue_15;                    // 0x09B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_4;      // 0x09B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_5;      // 0x09C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplay_WeaponCraftKillerPerkListItem_C* CallFunc_Create_ReturnValue_16;                    // 0x09C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_6;      // 0x09D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_7;      // 0x09D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x09E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_5;           // 0x09F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0A00(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0A18(0x0018)()
	struct FSBMasterFusionItem                    K2Node_CustomEvent_MasterFusionItem;               // 0x0A30(0x0018)(NoDestructor)
	class FString                                 CallFunc_GetItemName_OutName;                      // 0x0A48(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemName_ReturnValue;                  // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94AE[0x7];                                     // 0x0A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0A60(0x0018)()
	class UProbabilityDisplay_WeaponCraftKillerPerkTopItem_C* CallFunc_Create_ReturnValue_17;                    // 0x0A78(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_8;      // 0x0A80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_9;      // 0x0A88(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_10;     // 0x0A90(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBWeaponItemData                      K2Node_CustomEvent_SBWeaponItemData;               // 0x0A98(0x0050)(ConstParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0AEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindFusionItemMaster_IsValid;             // 0x0AED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94AF[0x2];                                     // 0x0AEE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_FindFusionItemMaster_OutFusionItemMaster; // 0x0AF0(0x0018)(NoDestructor)
	class FString                                 CallFunc_GetItemName_OutName_1;                    // 0x0B08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemName_ReturnValue_1;                // 0x0B18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B0[0x3];                                     // 0x0B19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0B1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_11;     // 0x0B20(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0B28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B1[0x3];                                     // 0x0B29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0B2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B2[0x7];                                     // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_12;     // 0x0B38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94B3[0x4];                                     // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBGashaInfo                           K2Node_CustomEvent_Gasha_Info;                     // 0x0B48(0x01C8)()
	bool                                          K2Node_CustomEvent_IsReload;                       // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B4[0x3];                                     // 0x0D11(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Step;                           // 0x0D14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0D18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0D19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B5[0x6];                                     // 0x0D1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x0D20(0x0018)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_13;     // 0x0D38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_1;           // 0x0D40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B6[0x7];                                     // 0x0D41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_1;       // 0x0D48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindSyntheAbilityPickupMasterData_IsExists; // 0x0D50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B7[0x7];                                     // 0x0D51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSyntheAbilityPickUp                 CallFunc_BP_FindSyntheAbilityPickupMasterData_ReturnValue; // 0x0D58(0x0028)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_6;           // 0x0D80(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0D90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94B8[0x4];                                     // 0x0D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x0D98(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0DB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0DB4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_7;           // 0x0DB8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_8;           // 0x0DC8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_11;         // 0x0DD8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_12;         // 0x0DF0(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_9;           // 0x0E08(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_10;          // 0x0E18(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_13;         // 0x0E28(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_14;         // 0x0E40(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_11;          // 0x0E58(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_12;          // 0x0E68(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_15;         // 0x0E78(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_16;         // 0x0E90(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_13;          // 0x0EA8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_14;          // 0x0EB8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_17;         // 0x0EC8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_18;         // 0x0EE0(0x0018)()
	int32                                         Temp_int_Variable_3;                               // 0x0EF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0EFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0F00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProbabilityDisplayButton_C*            K2Node_DynamicCast_AsProbability_Display_Button;   // 0x0F08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0F10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94B9[0x7];                                     // 0x0F11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBGashaBonusListInfo                  K2Node_Select_Default_1;                           // 0x0F18(0x0048)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x0F60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94BA[0x3];                                     // 0x0F61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBGashaBonus                          CallFunc_Array_Get_Item_4;                         // 0x0F64(0x0024)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0F88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0F8C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0F8D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0F8E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0F8F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0F90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_2;           // 0x0F94(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94BB[0x3];                                     // 0x0F95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_2;       // 0x0F98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindSyntheAbilityPickupMasterData_IsExists_1; // 0x0FA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94BC[0x7];                                     // 0x0FA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSyntheAbilityPickUp                 CallFunc_BP_FindSyntheAbilityPickupMasterData_ReturnValue_1; // 0x0FA8(0x0028)()
	bool                                          Temp_bool_Variable_2;                              // 0x0FD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94BD[0x3];                                     // 0x0FD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSyntheAbilityData                   CallFunc_Array_Get_Item_5;                         // 0x0FD4(0x001C)(NoDestructor)
	int32                                         K2Node_Select_Default_2;                           // 0x0FF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0FF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0FF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94BE[0x4];                                     // 0x0FFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x1000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x1010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94BF[0x4];                                     // 0x1014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x1018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x1020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x1028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x1030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x1038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x1039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C0[0x6];                                     // 0x103A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBGashaComponent*                      CallFunc_GetGashaComponent_ReturnValue_1;          // 0x1040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentStepUp_ReturnValue;              // 0x1048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C1[0x3];                                     // 0x1049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBGashaBonus                          CallFunc_Array_Get_Item_6;                         // 0x104C(0x0024)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x1070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x1074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C2[0x3];                                     // 0x1075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x1078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x107C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94C3[0x3];                                     // 0x107D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterRewardLotteryGroupsRewards    K2Node_CustomEvent_LotteryReward;                  // 0x1080(0x0038)(ConstParm, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x10B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94C4[0x7];                                     // 0x10B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x10C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindImagineMaster_bIsValid;               // 0x10D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C5[0x7];                                     // 0x10D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindImagineMaster_ImagineMaster;          // 0x10D8(0x00B0)()
	class FString                                 CallFunc_GetMasterImagineText_ReturnValue;         // 0x1188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_19;         // 0x1198(0x0018)()
	int32                                         CallFunc_Setup_Num;                                // 0x11B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue_1;            // 0x11B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_3;           // 0x11B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C6[0x7];                                     // 0x11B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_3;       // 0x11C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x11C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C7[0x7];                                     // 0x11C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterImaginePerkTable                CallFunc_FindMasterImaginePerk_ReturnValue;        // 0x11D0(0x0048)()
	bool                                          CallFunc_GetMasterDataManager_IsValid_4;           // 0x1218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94C8[0x7];                                     // 0x1219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_4;       // 0x1220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMasterImaginePerkTable                CallFunc_FindMasterImaginePerkByParamType_ReturnValue; // 0x1228(0x0048)()
};
static_assert(alignof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay) == 0x000008, "Wrong alignment on ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay");
static_assert(sizeof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay) == 0x001270, "Wrong size on ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, EntryPoint) == 0x000000, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Variable) == 0x000004, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Variable_1) == 0x000008, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Multiply_IntInt_ReturnValue) == 0x00000C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00001C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue_3) == 0x000020, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Variable_2) == 0x000024, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue_4) == 0x00002C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Create_ReturnValue) == 0x000030, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_bool_Variable) == 0x000038, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue_5) == 0x000040, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Array_Index_Variable) == 0x000044, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Array_Index_Variable_1) == 0x000048, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Loop_Counter_Variable_1) == 0x00004C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000054, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Array_Index_Variable_2) == 0x000058, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Loop_Counter_Variable_2) == 0x00007C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Loop_Counter_Variable_3) == 0x000080, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000084, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000088, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Add_IntInt_ReturnValue_6) == 0x00008C, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Array_Index_Variable_3) == 0x000090, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Create_ReturnValue_1) == 0x000098, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_PlaySE_ReturnValue) == 0x0000A0, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, Temp_int_Array_Index_Variable_4) == 0x0000A4, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, K2Node_MakeArray_Array) == 0x0000A8, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0000C0, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000C8, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_GetDisplayName_ReturnValue) == 0x0000D0, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_IsEmpty_ReturnValue) == 0x0000E0, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E4, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Create_ReturnValue_2) == 0x0000F8, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_GetTextFromAsset_ReturnValue) == 0x000100, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000110, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000138, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, K2Node_CreateDelegate_OutputDelegate_3) == 0x000150, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, K2Node_CreateDelegate_OutputDelegate_4) == 0x000160, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay, CallFunc_GetMasterDataManager_IsValid) == 0x000170, "Member 'ProbabilityDisplay_C_ExecuteUbergraph_ProbabilityDisplay::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
