#pragma once

 

// Package: QuestDetail

#include "Basic.hpp"

#include "QuestDetail_ActionButtonType_structs.hpp"
#include "QuestThumbnailData_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "QuestDetail_FinishStatus_structs.hpp"


namespace SDK::Params
{

// Function QuestDetail.QuestDetail_C.OnFinish__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct QuestDetail_C_OnFinish__DelegateSignature final
{
public:
	EQuestDetail_FinishStatus                     FinishStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_886A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_QuestIndex;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestDetail_C_OnFinish__DelegateSignature) == 0x000004, "Wrong alignment on QuestDetail_C_OnFinish__DelegateSignature");
static_assert(sizeof(QuestDetail_C_OnFinish__DelegateSignature) == 0x000008, "Wrong size on QuestDetail_C_OnFinish__DelegateSignature");
static_assert(offsetof(QuestDetail_C_OnFinish__DelegateSignature, FinishStatus) == 0x000000, "Member 'QuestDetail_C_OnFinish__DelegateSignature::FinishStatus' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_OnFinish__DelegateSignature, Param_QuestIndex) == 0x000004, "Member 'QuestDetail_C_OnFinish__DelegateSignature::Param_QuestIndex' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.ExecuteUbergraph_QuestDetail
// 0x02B0 (0x02B0 - 0x0000)
struct QuestDetail_C_ExecuteUbergraph_QuestDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_886B[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Result, int32 QuestIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestReceiveRewardWindow_C*            CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bReported)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_886C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result_1;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAcceptedQuestErrorCode                       K2Node_CustomEvent_ErrorCode;                      // 0x0061(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_886D[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x0064(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceptedQuestInfo                     K2Node_CustomEvent_AcceptedQuestInfo;              // 0x0068(0x0060)(ConstParm)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_886E[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBQuestComponent*                      CallFunc_GetQuestComponent_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAcceptQuestErrorCodeText_ReturnValue;  // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Request_AcceptQuest_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_886F[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebug_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8870[0x7];                                     // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(bool Result, EAcceptedQuestErrorCode ErrorCode, int32 RetCode, struct FAcceptedQuestInfo& AcceptedQuestInfo)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8871[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_1;        // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8872[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBQuestComponent*                      CallFunc_GetQuestComponent_ReturnValue_1;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Result;                         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8873[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_QuestIndex;                     // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Request_CancelQuest_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8874[0x6];                                     // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    K2Node_DynamicCast_AsSBPlayer_Controller_2;        // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8875[0x6];                                     // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBQuestComponent*                      CallFunc_GetQuestComponent_ReturnValue_2;          // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsCollectTriggerCondition_ReturnValue; // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8876[0x2];                                     // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0204(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0218(0x0018)()
	class USBShowYesNoDialog2Impl*                CallFunc_ShowYesNoDialog2_ReturnValue;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bReported;                      // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8877[0x5];                                     // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestDetail_ActionButtonType                 K2Node_CustomEvent_InType;                         // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8878[0x1];                                     // 0x024B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InQuestIndex_3;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetThumbnailId_ThumbnailId;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestThumbnailData                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0258(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8879[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0284(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_InQuestIndex_2;                 // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnableRouteGuideSw_2;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_887A[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InQuestIndex_1;                 // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnableRouteGuideSw_1;         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_887B[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InQuestIndex;                   // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsEnableRouteGuideSw;           // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsClosed;                       // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_887C[0x2];                                     // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestDetail_C_ExecuteUbergraph_QuestDetail) == 0x000008, "Wrong alignment on QuestDetail_C_ExecuteUbergraph_QuestDetail");
static_assert(sizeof(QuestDetail_C_ExecuteUbergraph_QuestDetail) == 0x0002B0, "Wrong size on QuestDetail_C_ExecuteUbergraph_QuestDetail");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, EntryPoint) == 0x000000, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, Temp_bool_Variable) == 0x000004, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, Temp_bool_Variable_1) == 0x000005, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, Temp_int_Variable) == 0x000018, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, Temp_int_Variable_1) == 0x00001C, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Create_ReturnValue) == 0x000020, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_Loaded) == 0x000038, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, Temp_object_Variable) == 0x000040, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_AsTexture_2D) == 0x000048, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_Result_1) == 0x000060, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_ErrorCode) == 0x000061, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_RetCode) == 0x000064, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_AcceptedQuestInfo) == 0x000068, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_AcceptedQuestInfo' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_AsSBPlayer_Controller) == 0x0000C8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_AsSBPlayer_Controller' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Conv_IntToString_ReturnValue) == 0x0000D8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetQuestComponent_ReturnValue) == 0x0000E8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetQuestComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0000F0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetAcceptQuestErrorCodeText_ReturnValue) == 0x000100, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetAcceptQuestErrorCodeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000120, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Request_AcceptQuest_ReturnValue) == 0x000130, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Request_AcceptQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000138, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000148, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000158, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_IsDebug_ReturnValue) == 0x000168, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_IsDebug_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_Select_Default) == 0x000170, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CreateDelegate_OutputDelegate_2) == 0x000180, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Conv_StringToText_ReturnValue) == 0x000190, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001A8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001B0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_AsSBPlayer_Controller_1) == 0x0001B8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_AsSBPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_bSuccess_2) == 0x0001C0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetQuestComponent_ReturnValue_1) == 0x0001C8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetQuestComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_Result) == 0x0001D0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_QuestIndex) == 0x0001D4, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_QuestIndex' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Request_CancelQuest_ReturnValue) == 0x0001D8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Request_CancelQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0001D9, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetPlayerController_ReturnValue_2) == 0x0001E0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_AsSBPlayer_Controller_2) == 0x0001E8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_AsSBPlayer_Controller_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_DynamicCast_bSuccess_3) == 0x0001F0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0001F1, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetQuestComponent_ReturnValue_2) == 0x0001F8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetQuestComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000200, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_ContainsCollectTriggerCondition_ReturnValue) == 0x000201, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_ContainsCollectTriggerCondition_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_Select_Default_1) == 0x000204, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetTextFromAsset_ReturnValue) == 0x000208, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000218, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_ShowYesNoDialog2_ReturnValue) == 0x000230, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_ShowYesNoDialog2_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000238, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_bReported) == 0x000239, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_bReported' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetUIManager_IsValid) == 0x00023A, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetUIManager_IsValid' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetUIManager_ReturnValue) == 0x000240, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_InType) == 0x000248, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_InType' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000249, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_SwitchEnum_CmpSuccess) == 0x00024A, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_InQuestIndex_3) == 0x00024C, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_InQuestIndex_3' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetThumbnailId_ThumbnailId) == 0x000250, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetThumbnailId_ThumbnailId' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetDataTableRowFromName_OutRow) == 0x000258, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000280, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CreateDelegate_OutputDelegate_3) == 0x000284, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_InQuestIndex_2) == 0x000294, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_InQuestIndex_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_IsEnableRouteGuideSw_2) == 0x000298, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_IsEnableRouteGuideSw_2' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_InQuestIndex_1) == 0x00029C, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_InQuestIndex_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_IsEnableRouteGuideSw_1) == 0x0002A0, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_IsEnableRouteGuideSw_1' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_InQuestIndex) == 0x0002A4, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_InQuestIndex' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_IsEnableRouteGuideSw) == 0x0002A8, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_IsEnableRouteGuideSw' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, K2Node_CustomEvent_IsClosed) == 0x0002A9, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::K2Node_CustomEvent_IsClosed' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ExecuteUbergraph_QuestDetail, CallFunc_PlaySE_ReturnValue) == 0x0002AC, "Member 'QuestDetail_C_ExecuteUbergraph_QuestDetail::CallFunc_PlaySE_ReturnValue' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.ChangeQuestInfoForQuestList
// 0x0008 (0x0008 - 0x0000)
struct QuestDetail_C_ChangeQuestInfoForQuestList final
{
public:
	int32                                         InQuestIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableRouteGuideSw;                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsClosed;                                          // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestDetail_C_ChangeQuestInfoForQuestList) == 0x000004, "Wrong alignment on QuestDetail_C_ChangeQuestInfoForQuestList");
static_assert(sizeof(QuestDetail_C_ChangeQuestInfoForQuestList) == 0x000008, "Wrong size on QuestDetail_C_ChangeQuestInfoForQuestList");
static_assert(offsetof(QuestDetail_C_ChangeQuestInfoForQuestList, InQuestIndex) == 0x000000, "Member 'QuestDetail_C_ChangeQuestInfoForQuestList::InQuestIndex' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ChangeQuestInfoForQuestList, IsEnableRouteGuideSw) == 0x000004, "Member 'QuestDetail_C_ChangeQuestInfoForQuestList::IsEnableRouteGuideSw' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ChangeQuestInfoForQuestList, IsClosed) == 0x000005, "Member 'QuestDetail_C_ChangeQuestInfoForQuestList::IsClosed' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.ChangeQuestInfo
// 0x0008 (0x0008 - 0x0000)
struct QuestDetail_C_ChangeQuestInfo final
{
public:
	int32                                         InQuestIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableRouteGuideSw;                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestDetail_C_ChangeQuestInfo) == 0x000004, "Wrong alignment on QuestDetail_C_ChangeQuestInfo");
static_assert(sizeof(QuestDetail_C_ChangeQuestInfo) == 0x000008, "Wrong size on QuestDetail_C_ChangeQuestInfo");
static_assert(offsetof(QuestDetail_C_ChangeQuestInfo, InQuestIndex) == 0x000000, "Member 'QuestDetail_C_ChangeQuestInfo::InQuestIndex' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_ChangeQuestInfo, IsEnableRouteGuideSw) == 0x000004, "Member 'QuestDetail_C_ChangeQuestInfo::IsEnableRouteGuideSw' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.SetQuestInfo
// 0x0008 (0x0008 - 0x0000)
struct QuestDetail_C_SetQuestInfo final
{
public:
	int32                                         InQuestIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableRouteGuideSw;                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestDetail_C_SetQuestInfo) == 0x000004, "Wrong alignment on QuestDetail_C_SetQuestInfo");
static_assert(sizeof(QuestDetail_C_SetQuestInfo) == 0x000008, "Wrong size on QuestDetail_C_SetQuestInfo");
static_assert(offsetof(QuestDetail_C_SetQuestInfo, InQuestIndex) == 0x000000, "Member 'QuestDetail_C_SetQuestInfo::InQuestIndex' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_SetQuestInfo, IsEnableRouteGuideSw) == 0x000004, "Member 'QuestDetail_C_SetQuestInfo::IsEnableRouteGuideSw' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.SetThumbnail
// 0x0004 (0x0004 - 0x0000)
struct QuestDetail_C_SetThumbnail final
{
public:
	int32                                         InQuestIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestDetail_C_SetThumbnail) == 0x000004, "Wrong alignment on QuestDetail_C_SetThumbnail");
static_assert(sizeof(QuestDetail_C_SetThumbnail) == 0x000004, "Wrong size on QuestDetail_C_SetThumbnail");
static_assert(offsetof(QuestDetail_C_SetThumbnail, InQuestIndex) == 0x000000, "Member 'QuestDetail_C_SetThumbnail::InQuestIndex' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.OnActionButtonClicked
// 0x0001 (0x0001 - 0x0000)
struct QuestDetail_C_OnActionButtonClicked final
{
public:
	EQuestDetail_ActionButtonType                 InType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestDetail_C_OnActionButtonClicked) == 0x000001, "Wrong alignment on QuestDetail_C_OnActionButtonClicked");
static_assert(sizeof(QuestDetail_C_OnActionButtonClicked) == 0x000001, "Wrong size on QuestDetail_C_OnActionButtonClicked");
static_assert(offsetof(QuestDetail_C_OnActionButtonClicked, InType) == 0x000000, "Member 'QuestDetail_C_OnActionButtonClicked::InType' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.OnFinish_Event_0
// 0x0001 (0x0001 - 0x0000)
struct QuestDetail_C_OnFinish_Event_0 final
{
public:
	bool                                          bReported;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestDetail_C_OnFinish_Event_0) == 0x000001, "Wrong alignment on QuestDetail_C_OnFinish_Event_0");
static_assert(sizeof(QuestDetail_C_OnFinish_Event_0) == 0x000001, "Wrong size on QuestDetail_C_OnFinish_Event_0");
static_assert(offsetof(QuestDetail_C_OnFinish_Event_0, bReported) == 0x000000, "Member 'QuestDetail_C_OnFinish_Event_0::bReported' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.CustomEvent
// 0x0008 (0x0008 - 0x0000)
struct QuestDetail_C_CustomEvent final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_887D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_QuestIndex;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestDetail_C_CustomEvent) == 0x000004, "Wrong alignment on QuestDetail_C_CustomEvent");
static_assert(sizeof(QuestDetail_C_CustomEvent) == 0x000008, "Wrong size on QuestDetail_C_CustomEvent");
static_assert(offsetof(QuestDetail_C_CustomEvent, Result) == 0x000000, "Member 'QuestDetail_C_CustomEvent::Result' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_CustomEvent, Param_QuestIndex) == 0x000004, "Member 'QuestDetail_C_CustomEvent::Param_QuestIndex' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.OnAcceptQuestDelegate_Event_0
// 0x0068 (0x0068 - 0x0000)
struct QuestDetail_C_OnAcceptQuestDelegate_Event_0 final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EAcceptedQuestErrorCode                       ErrorCode;                                         // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_887E[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RetCode;                                           // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAcceptedQuestInfo                     AcceptedQuestInfo;                                 // 0x0008(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(QuestDetail_C_OnAcceptQuestDelegate_Event_0) == 0x000008, "Wrong alignment on QuestDetail_C_OnAcceptQuestDelegate_Event_0");
static_assert(sizeof(QuestDetail_C_OnAcceptQuestDelegate_Event_0) == 0x000068, "Wrong size on QuestDetail_C_OnAcceptQuestDelegate_Event_0");
static_assert(offsetof(QuestDetail_C_OnAcceptQuestDelegate_Event_0, Result) == 0x000000, "Member 'QuestDetail_C_OnAcceptQuestDelegate_Event_0::Result' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_OnAcceptQuestDelegate_Event_0, ErrorCode) == 0x000001, "Member 'QuestDetail_C_OnAcceptQuestDelegate_Event_0::ErrorCode' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_OnAcceptQuestDelegate_Event_0, RetCode) == 0x000004, "Member 'QuestDetail_C_OnAcceptQuestDelegate_Event_0::RetCode' has a wrong offset!");
static_assert(offsetof(QuestDetail_C_OnAcceptQuestDelegate_Event_0, AcceptedQuestInfo) == 0x000008, "Member 'QuestDetail_C_OnAcceptQuestDelegate_Event_0::AcceptedQuestInfo' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.OnLoaded_430FBD6944474F8D28745AB2C5A082A2
// 0x0008 (0x0008 - 0x0000)
struct QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2) == 0x000008, "Wrong alignment on QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2");
static_assert(sizeof(QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2) == 0x000008, "Wrong size on QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2");
static_assert(offsetof(QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2, Loaded) == 0x000000, "Member 'QuestDetail_C_OnLoaded_430FBD6944474F8D28745AB2C5A082A2::Loaded' has a wrong offset!");

// Function QuestDetail.QuestDetail_C.SetQuestInfo_Internal
// 0x03B0 (0x03B0 - 0x0000)
struct QuestDetail_C_SetQuestInfo_Internal final
{
public:
	int32                                         InQuestIndex;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableRouteGuideSw;                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnableRouteGuideSw;                               // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EQuestStatus                                  QuestStatus;                                       // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_887F[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBQuestProgressItemUIInfo>     ProgressItemList;                                  // 0x0008(0x0010)(Edit, BlueprintVisible)
	struct FQuestMasterData                       QuestMasterData;                                   // 0x0018(0x0118)(Edit, BlueprintVisible)
	EQuestCategory2                               Temp_byte_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8880[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8881[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8882[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBQuestPreconditionUIInfo>     CallFunc_Get_Quest_Precondition_Infos_OutUiInfo;   // 0x0168(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8883[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8884[0x5];                                     // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_CheckQuestRevivalCondition_OutRevivalDate; // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckQuestRevivalCondition_ReturnValue;   // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue;                  // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable_3;                              // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8885[0x3];                                     // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_4;                              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8886[0x3];                                     // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetQuestAcceptableCount_OutNum;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuestAcceptableCount_OutMaxNum;        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQuestAcceptableCount_ReturnValue;      // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8887[0x3];                                     // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetQuestDeadlineOfUnlockCondition_OutDeadline; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetQuestDeadlineOfUnlockCondition_ReturnValue; // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EQuestCategory2                               Temp_byte_Variable_7;                              // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue_1;                // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x01DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetQuestDescAndSynopsis_ReturnValue;      // 0x01E0(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01F0(0x0018)()
	struct FSBQuestPreconditionUIInfo             CallFunc_GetNextMainQuestPreconditionUIInfo_OutPrecondition; // 0x0208(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmptyList_bIsEmpty;                     // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0226(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0227(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EQuestStatus                                  CallFunc_GetQuestStatus_QuestStatus;               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8888[0x7];                                     // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestMasterData                       CallFunc_FindQuestMasterData_QuestMasterData;      // 0x0230(0x0118)()
	bool                                          CallFunc_FindQuestMasterData_Exist;                // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8889[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetQuestConditionDetailByTextId_ReturnValue; // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetQuestNameByTextId_ReturnValue;         // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0370(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0388(0x0018)()
	class FName                                   K2Node_Select_Default_4;                           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_5;                           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestDetail_C_SetQuestInfo_Internal) == 0x000008, "Wrong alignment on QuestDetail_C_SetQuestInfo_Internal");
static_assert(sizeof(QuestDetail_C_SetQuestInfo_Internal) == 0x0003B0, "Wrong size on QuestDetail_C_SetQuestInfo_Internal");
