#pragma once

 

// Package: ResultRewardList

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "QuestRewardIconInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ResultRewardList.ResultRewardList_C.ExecuteUbergraph_ResultRewardList
// 0x0004 (0x0004 - 0x0000)
struct ResultRewardList_C_ExecuteUbergraph_ResultRewardList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResultRewardList_C_ExecuteUbergraph_ResultRewardList) == 0x000004, "Wrong alignment on ResultRewardList_C_ExecuteUbergraph_ResultRewardList");
static_assert(sizeof(ResultRewardList_C_ExecuteUbergraph_ResultRewardList) == 0x000004, "Wrong size on ResultRewardList_C_ExecuteUbergraph_ResultRewardList");
static_assert(offsetof(ResultRewardList_C_ExecuteUbergraph_ResultRewardList, EntryPoint) == 0x000000, "Member 'ResultRewardList_C_ExecuteUbergraph_ResultRewardList::EntryPoint' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetMoney
// 0x0010 (0x0010 - 0x0000)
struct ResultRewardList_C_SetMoney final
{
public:
	int32                                         InAmount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamBonusPercentForType_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D2[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBonusPercentForType_Percent;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_SetMoney) == 0x000004, "Wrong alignment on ResultRewardList_C_SetMoney");
static_assert(sizeof(ResultRewardList_C_SetMoney) == 0x000010, "Wrong size on ResultRewardList_C_SetMoney");
static_assert(offsetof(ResultRewardList_C_SetMoney, InAmount) == 0x000000, "Member 'ResultRewardList_C_SetMoney::InAmount' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetMoney, CallFunc_GetTeamBonusPercentForType_ReturnValue) == 0x000004, "Member 'ResultRewardList_C_SetMoney::CallFunc_GetTeamBonusPercentForType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetMoney, CallFunc_GetTeamBonusPercentForType_Percent) == 0x000008, "Member 'ResultRewardList_C_SetMoney::CallFunc_GetTeamBonusPercentForType_Percent' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetMoney, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'ResultRewardList_C_SetMoney::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetExp
// 0x0010 (0x0010 - 0x0000)
struct ResultRewardList_C_SetExp final
{
public:
	int32                                         InAmount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamBonusPercentForType_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBonusPercentForType_Percent;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_SetExp) == 0x000004, "Wrong alignment on ResultRewardList_C_SetExp");
static_assert(sizeof(ResultRewardList_C_SetExp) == 0x000010, "Wrong size on ResultRewardList_C_SetExp");
static_assert(offsetof(ResultRewardList_C_SetExp, InAmount) == 0x000000, "Member 'ResultRewardList_C_SetExp::InAmount' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetExp, CallFunc_GetTeamBonusPercentForType_ReturnValue) == 0x000004, "Member 'ResultRewardList_C_SetExp::CallFunc_GetTeamBonusPercentForType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetExp, CallFunc_GetTeamBonusPercentForType_Percent) == 0x000008, "Member 'ResultRewardList_C_SetExp::CallFunc_GetTeamBonusPercentForType_Percent' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetExp, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'ResultRewardList_C_SetExp::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetGC
// 0x0010 (0x0010 - 0x0000)
struct ResultRewardList_C_SetGC final
{
public:
	int32                                         InAmount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemId;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTeamBonusPercentForItemID_ReturnValue; // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D4[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBonusPercentForItemID_Percent;     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResultRewardList_C_SetGC) == 0x000004, "Wrong alignment on ResultRewardList_C_SetGC");
static_assert(sizeof(ResultRewardList_C_SetGC) == 0x000010, "Wrong size on ResultRewardList_C_SetGC");
static_assert(offsetof(ResultRewardList_C_SetGC, InAmount) == 0x000000, "Member 'ResultRewardList_C_SetGC::InAmount' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetGC, ItemId) == 0x000004, "Member 'ResultRewardList_C_SetGC::ItemId' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetGC, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'ResultRewardList_C_SetGC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetGC, CallFunc_GetTeamBonusPercentForItemID_ReturnValue) == 0x000009, "Member 'ResultRewardList_C_SetGC::CallFunc_GetTeamBonusPercentForItemID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetGC, CallFunc_GetTeamBonusPercentForItemID_Percent) == 0x00000C, "Member 'ResultRewardList_C_SetGC::CallFunc_GetTeamBonusPercentForItemID_Percent' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetItem
// 0x0190 (0x0190 - 0x0000)
struct ResultRewardList_C_SetItem final
{
public:
	TArray<struct FOwnItemInfo>                   InOwnItems;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96D5[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOwnItemInfo>                   CallFunc_GetOwnItemInfo_OwnItemInfo;               // 0x0028(0x0010)(ReferenceParm)
	TArray<struct FOwnItemInfo>                   CallFunc_GetOwnItemInfo_OwnItemInfo_1;             // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96D6[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_Array_Get_Item;                           // 0x0050(0x0118)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D7[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             CallFunc_ConvertItemTypeToRewardType_RewardItemType; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTeamBonusPercentForItemID_ReturnValue; // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D8[0x1];                                     // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBonusPercentForItemID_Percent;     // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D9[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBTokenOverLimit                      CallFunc_Array_Get_Item_1;                         // 0x0184(0x0008)(NoDestructor)
};
static_assert(alignof(ResultRewardList_C_SetItem) == 0x000008, "Wrong alignment on ResultRewardList_C_SetItem");
static_assert(sizeof(ResultRewardList_C_SetItem) == 0x000190, "Wrong size on ResultRewardList_C_SetItem");
static_assert(offsetof(ResultRewardList_C_SetItem, InOwnItems) == 0x000000, "Member 'ResultRewardList_C_SetItem::InOwnItems' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'ResultRewardList_C_SetItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'ResultRewardList_C_SetItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, Temp_int_Array_Index_Variable) == 0x000018, "Member 'ResultRewardList_C_SetItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'ResultRewardList_C_SetItem::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'ResultRewardList_C_SetItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_GetOwnItemInfo_OwnItemInfo) == 0x000028, "Member 'ResultRewardList_C_SetItem::CallFunc_GetOwnItemInfo_OwnItemInfo' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_GetOwnItemInfo_OwnItemInfo_1) == 0x000038, "Member 'ResultRewardList_C_SetItem::CallFunc_GetOwnItemInfo_OwnItemInfo_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'ResultRewardList_C_SetItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Array_Get_Item) == 0x000050, "Member 'ResultRewardList_C_SetItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Less_IntInt_ReturnValue) == 0x000168, "Member 'ResultRewardList_C_SetItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Array_Length_ReturnValue_1) == 0x00016C, "Member 'ResultRewardList_C_SetItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_ConvertItemTypeToRewardType_RewardItemType) == 0x000170, "Member 'ResultRewardList_C_SetItem::CallFunc_ConvertItemTypeToRewardType_RewardItemType' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000171, "Member 'ResultRewardList_C_SetItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_GetTeamBonusPercentForItemID_ReturnValue) == 0x000172, "Member 'ResultRewardList_C_SetItem::CallFunc_GetTeamBonusPercentForItemID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_GetTeamBonusPercentForItemID_Percent) == 0x000174, "Member 'ResultRewardList_C_SetItem::CallFunc_GetTeamBonusPercentForItemID_Percent' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Array_Length_ReturnValue_2) == 0x000178, "Member 'ResultRewardList_C_SetItem::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, Temp_int_Array_Index_Variable_1) == 0x00017C, "Member 'ResultRewardList_C_SetItem::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Less_IntInt_ReturnValue_2) == 0x000180, "Member 'ResultRewardList_C_SetItem::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetItem, CallFunc_Array_Get_Item_1) == 0x000184, "Member 'ResultRewardList_C_SetItem::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetSkyCoin
// 0x0010 (0x0010 - 0x0000)
struct ResultRewardList_C_SetSkyCoin final
{
public:
	int32                                         InAmount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamBonusPercentForType_ReturnValue;   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBonusPercentForType_Percent;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_SetSkyCoin) == 0x000004, "Wrong alignment on ResultRewardList_C_SetSkyCoin");
static_assert(sizeof(ResultRewardList_C_SetSkyCoin) == 0x000010, "Wrong size on ResultRewardList_C_SetSkyCoin");
static_assert(offsetof(ResultRewardList_C_SetSkyCoin, InAmount) == 0x000000, "Member 'ResultRewardList_C_SetSkyCoin::InAmount' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSkyCoin, CallFunc_GetTeamBonusPercentForType_ReturnValue) == 0x000004, "Member 'ResultRewardList_C_SetSkyCoin::CallFunc_GetTeamBonusPercentForType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSkyCoin, CallFunc_GetTeamBonusPercentForType_Percent) == 0x000008, "Member 'ResultRewardList_C_SetSkyCoin::CallFunc_GetTeamBonusPercentForType_Percent' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSkyCoin, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'ResultRewardList_C_SetSkyCoin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetReward
// 0x0078 (0x0078 - 0x0000)
struct ResultRewardList_C_SetReward final
{
public:
	TArray<class FName>                           InReawrdIDList;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSBMasterReward                        TmpRewardMaster;                                   // 0x0010(0x0014)(Edit, BlueprintVisible, NoDestructor)
	int32                                         TmpTeamBonusPercent;                               // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           TmpRewardIDList;                                   // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIgnoreReward_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DB[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindRewardMaster_IsValid;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DC[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterReward                        CallFunc_FindRewardMaster_RewardMaster;            // 0x0058(0x0014)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetTeamBonusPercentForRewardID_ReturnValue; // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96DD[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamBonusPercentForRewardID_Percent;   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResultRewardList_C_SetReward) == 0x000008, "Wrong alignment on ResultRewardList_C_SetReward");
static_assert(sizeof(ResultRewardList_C_SetReward) == 0x000078, "Wrong size on ResultRewardList_C_SetReward");
static_assert(offsetof(ResultRewardList_C_SetReward, InReawrdIDList) == 0x000000, "Member 'ResultRewardList_C_SetReward::InReawrdIDList' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, TmpRewardMaster) == 0x000010, "Member 'ResultRewardList_C_SetReward::TmpRewardMaster' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, TmpTeamBonusPercent) == 0x000024, "Member 'ResultRewardList_C_SetReward::TmpTeamBonusPercent' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, TmpRewardIDList) == 0x000028, "Member 'ResultRewardList_C_SetReward::TmpRewardIDList' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, Temp_int_Array_Index_Variable) == 0x000038, "Member 'ResultRewardList_C_SetReward::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'ResultRewardList_C_SetReward::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'ResultRewardList_C_SetReward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_IsIgnoreReward_ReturnValue) == 0x000044, "Member 'ResultRewardList_C_SetReward::CallFunc_IsIgnoreReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_Not_PreBool_ReturnValue) == 0x000045, "Member 'ResultRewardList_C_SetReward::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_Array_Get_Item) == 0x000048, "Member 'ResultRewardList_C_SetReward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'ResultRewardList_C_SetReward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_FindRewardMaster_IsValid) == 0x000054, "Member 'ResultRewardList_C_SetReward::CallFunc_FindRewardMaster_IsValid' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_FindRewardMaster_RewardMaster) == 0x000058, "Member 'ResultRewardList_C_SetReward::CallFunc_FindRewardMaster_RewardMaster' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'ResultRewardList_C_SetReward::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_GetTeamBonusPercentForRewardID_ReturnValue) == 0x00006D, "Member 'ResultRewardList_C_SetReward::CallFunc_GetTeamBonusPercentForRewardID_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetReward, CallFunc_GetTeamBonusPercentForRewardID_Percent) == 0x000070, "Member 'ResultRewardList_C_SetReward::CallFunc_GetTeamBonusPercentForRewardID_Percent' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.AddInfo
// 0x01D8 (0x01D8 - 0x0000)
struct ResultRewardList_C_AddInfo final
{
public:
	class FString                                 InUniqueId;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         InAmount;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InId;                                              // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InStorageNumber;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             InType;                                            // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96DE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IsTeamBonusPercent;                                // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96DF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestRewardIconInfo                   RewardInfo;                                        // 0x0028(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E0[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E1[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMargeType_Result;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E2[0x3];                                     // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E3[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FQuestRewardIconInfo                   K2Node_MakeStruct_QuestRewardIconInfo;             // 0x0108(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FQuestRewardIconInfo                   CallFunc_Array_Get_Item;                           // 0x0140(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E4[0x1];                                     // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestRewardIconInfo                   K2Node_MakeStruct_QuestRewardIconInfo_1;           // 0x0178(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96E5[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestRewardIconInfo                   CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_AddInfo) == 0x000008, "Wrong alignment on ResultRewardList_C_AddInfo");
static_assert(sizeof(ResultRewardList_C_AddInfo) == 0x0001D8, "Wrong size on ResultRewardList_C_AddInfo");
static_assert(offsetof(ResultRewardList_C_AddInfo, InUniqueId) == 0x000000, "Member 'ResultRewardList_C_AddInfo::InUniqueId' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, InAmount) == 0x000010, "Member 'ResultRewardList_C_AddInfo::InAmount' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, InId) == 0x000014, "Member 'ResultRewardList_C_AddInfo::InId' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, InStorageNumber) == 0x000018, "Member 'ResultRewardList_C_AddInfo::InStorageNumber' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, InType) == 0x00001C, "Member 'ResultRewardList_C_AddInfo::InType' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, IsTeamBonusPercent) == 0x000020, "Member 'ResultRewardList_C_AddInfo::IsTeamBonusPercent' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, RewardInfo) == 0x000028, "Member 'ResultRewardList_C_AddInfo::RewardInfo' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, Param_Index) == 0x000050, "Member 'ResultRewardList_C_AddInfo::Param_Index' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, Amount) == 0x000054, "Member 'ResultRewardList_C_AddInfo::Amount' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, Temp_bool_True_if_break_was_hit_Variable) == 0x000058, "Member 'ResultRewardList_C_AddInfo::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, Temp_int_Array_Index_Variable) == 0x00005C, "Member 'ResultRewardList_C_AddInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'ResultRewardList_C_AddInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'ResultRewardList_C_AddInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'ResultRewardList_C_AddInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_IsMargeType_Result) == 0x00006C, "Member 'ResultRewardList_C_AddInfo::CallFunc_IsMargeType_Result' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Conv_IntToString_ReturnValue) == 0x000070, "Member 'ResultRewardList_C_AddInfo::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000080, "Member 'ResultRewardList_C_AddInfo::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000090, "Member 'ResultRewardList_C_AddInfo::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'ResultRewardList_C_AddInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B8, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C8, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D8, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E8, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F8, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, K2Node_MakeStruct_QuestRewardIconInfo) == 0x000108, "Member 'ResultRewardList_C_AddInfo::K2Node_MakeStruct_QuestRewardIconInfo' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000130, "Member 'ResultRewardList_C_AddInfo::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Array_Get_Item) == 0x000140, "Member 'ResultRewardList_C_AddInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Array_Add_ReturnValue) == 0x000168, "Member 'ResultRewardList_C_AddInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Array_Length_ReturnValue) == 0x00016C, "Member 'ResultRewardList_C_AddInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000170, "Member 'ResultRewardList_C_AddInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000171, "Member 'ResultRewardList_C_AddInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_BooleanAND_ReturnValue) == 0x000172, "Member 'ResultRewardList_C_AddInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000174, "Member 'ResultRewardList_C_AddInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, K2Node_MakeStruct_QuestRewardIconInfo_1) == 0x000178, "Member 'ResultRewardList_C_AddInfo::K2Node_MakeStruct_QuestRewardIconInfo_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Array_Add_ReturnValue_1) == 0x0001A0, "Member 'ResultRewardList_C_AddInfo::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'ResultRewardList_C_AddInfo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddInfo, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001D0, "Member 'ResultRewardList_C_AddInfo::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.ClearInfo
// 0x0030 (0x0030 - 0x0000)
struct ResultRewardList_C_ClearInfo final
{
public:
	struct FQuestRewardIconInfo                   RewardInfo;                                        // 0x0000(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResultRewardList_C_ClearInfo) == 0x000008, "Wrong alignment on ResultRewardList_C_ClearInfo");
static_assert(sizeof(ResultRewardList_C_ClearInfo) == 0x000030, "Wrong size on ResultRewardList_C_ClearInfo");
static_assert(offsetof(ResultRewardList_C_ClearInfo, RewardInfo) == 0x000000, "Member 'ResultRewardList_C_ClearInfo::RewardInfo' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_ClearInfo, Param_Index) == 0x000028, "Member 'ResultRewardList_C_ClearInfo::Param_Index' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.AddIcon
// 0x0198 (0x0198 - 0x0000)
struct ResultRewardList_C_AddIcon final
{
public:
	struct FQuestRewardIconInfo                   IconInfo;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UQuestRewardIcon_C*                     Icon;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isBonus_Result;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindOwnItemInfo_Result;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E6[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_FindOwnItemInfo_ItemInfo;                 // 0x0040(0x0118)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E7[0x6];                                     // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestRewardIcon_C*                     CallFunc_CreateIcon_OutIcon;                       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuestRewardIconInfo                   CallFunc_Array_Get_Item;                           // 0x0168(0x0028)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_AddIcon) == 0x000008, "Wrong alignment on ResultRewardList_C_AddIcon");
static_assert(sizeof(ResultRewardList_C_AddIcon) == 0x000198, "Wrong size on ResultRewardList_C_AddIcon");
static_assert(offsetof(ResultRewardList_C_AddIcon, IconInfo) == 0x000000, "Member 'ResultRewardList_C_AddIcon::IconInfo' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, Icon) == 0x000028, "Member 'ResultRewardList_C_AddIcon::Icon' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, Temp_int_Array_Index_Variable) == 0x000030, "Member 'ResultRewardList_C_AddIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'ResultRewardList_C_AddIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'ResultRewardList_C_AddIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_isBonus_Result) == 0x00003C, "Member 'ResultRewardList_C_AddIcon::CallFunc_isBonus_Result' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_FindOwnItemInfo_Result) == 0x00003D, "Member 'ResultRewardList_C_AddIcon::CallFunc_FindOwnItemInfo_Result' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_FindOwnItemInfo_ItemInfo) == 0x000040, "Member 'ResultRewardList_C_AddIcon::CallFunc_FindOwnItemInfo_ItemInfo' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000158, "Member 'ResultRewardList_C_AddIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000159, "Member 'ResultRewardList_C_AddIcon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_CreateIcon_OutIcon) == 0x000160, "Member 'ResultRewardList_C_AddIcon::CallFunc_CreateIcon_OutIcon' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_Array_Get_Item) == 0x000168, "Member 'ResultRewardList_C_AddIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'ResultRewardList_C_AddIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_AddIcon, CallFunc_Less_IntInt_ReturnValue) == 0x000194, "Member 'ResultRewardList_C_AddIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.CreateIcon
// 0x0048 (0x0048 - 0x0000)
struct ResultRewardList_C_CreateIcon final
{
public:
	bool                                          bIsClickToShowDetail;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96E8[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestRewardIcon_C*                     OutIcon;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestRewardIcon_C*                     Icon;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestRewardIcon_C*                     CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ResultRewardList_C_CreateIcon) == 0x000008, "Wrong alignment on ResultRewardList_C_CreateIcon");
static_assert(sizeof(ResultRewardList_C_CreateIcon) == 0x000048, "Wrong size on ResultRewardList_C_CreateIcon");
static_assert(offsetof(ResultRewardList_C_CreateIcon, bIsClickToShowDetail) == 0x000000, "Member 'ResultRewardList_C_CreateIcon::bIsClickToShowDetail' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, OutIcon) == 0x000008, "Member 'ResultRewardList_C_CreateIcon::OutIcon' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, Icon) == 0x000010, "Member 'ResultRewardList_C_CreateIcon::Icon' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, CallFunc_Create_ReturnValue) == 0x000018, "Member 'ResultRewardList_C_CreateIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, K2Node_MakeStruct_Margin) == 0x000020, "Member 'ResultRewardList_C_CreateIcon::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, CallFunc_GetChildrenCount_ReturnValue) == 0x000030, "Member 'ResultRewardList_C_CreateIcon::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'ResultRewardList_C_CreateIcon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, CallFunc_AddChildToGrid_ReturnValue) == 0x000038, "Member 'ResultRewardList_C_CreateIcon::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, CallFunc_Percent_IntInt_ReturnValue) == 0x000040, "Member 'ResultRewardList_C_CreateIcon::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_CreateIcon, CallFunc_Divide_IntInt_ReturnValue) == 0x000044, "Member 'ResultRewardList_C_CreateIcon::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetSKill
// 0x0050 (0x0050 - 0x0000)
struct ResultRewardList_C_SetSKill final
{
public:
	TArray<struct FSBSkillParam>                  InSkillParam;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSBSkillParam>                  Skill;                                             // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBSkillParam                          CallFunc_Array_Get_Item;                           // 0x0030(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_SetSKill) == 0x000008, "Wrong alignment on ResultRewardList_C_SetSKill");
static_assert(sizeof(ResultRewardList_C_SetSKill) == 0x000050, "Wrong size on ResultRewardList_C_SetSKill");
static_assert(offsetof(ResultRewardList_C_SetSKill, InSkillParam) == 0x000000, "Member 'ResultRewardList_C_SetSKill::InSkillParam' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, Skill) == 0x000010, "Member 'ResultRewardList_C_SetSKill::Skill' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, Temp_int_Array_Index_Variable) == 0x000020, "Member 'ResultRewardList_C_SetSKill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'ResultRewardList_C_SetSKill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'ResultRewardList_C_SetSKill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'ResultRewardList_C_SetSKill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, CallFunc_Array_Get_Item) == 0x000030, "Member 'ResultRewardList_C_SetSKill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_SetSKill, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'ResultRewardList_C_SetSKill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.DeleteIcon
// 0x0038 (0x0038 - 0x0000)
struct ResultRewardList_C_DeleteIcon final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96E9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96EA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ResultRewardList_C_DeleteIcon) == 0x000008, "Wrong alignment on ResultRewardList_C_DeleteIcon");
static_assert(sizeof(ResultRewardList_C_DeleteIcon) == 0x000038, "Wrong size on ResultRewardList_C_DeleteIcon");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, Temp_int_Array_Index_Variable) == 0x000000, "Member 'ResultRewardList_C_DeleteIcon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ResultRewardList_C_DeleteIcon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ResultRewardList_C_DeleteIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'ResultRewardList_C_DeleteIcon::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'ResultRewardList_C_DeleteIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, CallFunc_Array_Get_Item) == 0x000028, "Member 'ResultRewardList_C_DeleteIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ResultRewardList_C_DeleteIcon, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ResultRewardList_C_DeleteIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function ResultRewardList.ResultRewardList_C.SetAlertIcon
// 0x0048 (0x0048 - 0x0000)
struct ResultRewardList_C_SetAlertIcon final
{
public:
	bool                                          IsYellow;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_IsVisible;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96EB[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96EC[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96ED[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
