#pragma once

 

// Package: SBAnimNode

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SBAnimNode.FSBCustomBoneScaleAxisSwapType
// NumValues: 0x0008
enum class EFSBCustomBoneScaleAxisSwapType : uint8
{
	NoSwap                                   = 0,
	ToYXZ                                    = 1,
	ToXZY                                    = 2,
	ToZYX                                    = 3,
	ToYZX                                    = 4,
	ToZXY                                    = 5,
	Num                                      = 6,
	FSBCustomBoneScaleAxisSwapType_MAX       = 7,
};

// Enum SBAnimNode.ECharaCreateBoneScaleType
// NumValues: 0x0006
enum class ECharaCreateBoneScaleType : uint8
{
	XYZ_Scale                                = 0,
	YZ_Scale                                 = 1,
	X_Scale                                  = 2,
	Y_Scale                                  = 3,
	Z_Scale                                  = 4,
	ECharaCreateBoneScaleType_MAX            = 5,
};

// Enum SBAnimNode.ECharaCreateBoneScaleID
// NumValues: 0x002D
enum class ECharaCreateBoneScaleID : uint8
{
	Root_J                                   = 0,
	Hip_J__offset                            = 1,
	HLP_Spine1__offset                       = 2,
	Spine1_J                                 = 3,
	Spine1_J__offset                         = 4,
	Spine2_J__offset                         = 5,
	Neck_J                                   = 6,
	Neck_J__offset                           = 7,
	Head_J                                   = 8,
	Head_J__offset                           = 9,
	L_Clavicle_J                             = 10,
	L_Arm_J__offset                          = 11,
	L_ForeArm_J__offset                      = 12,
	L_Wrist_J                                = 13,
	HLP_L_ForeArm_Mid                        = 14,
	HLP_L_ForeArm_Btm                        = 15,
	HLP_L_ForeArm_Slide                      = 16,
	HLP_L_Arm_Mid                            = 17,
	HLP_L_Arm_Top                            = 18,
	HLP_L_Elbow                              = 19,
	HLP_L_Arm_Slide                          = 20,
	HLP_L_ShldrBlade                         = 21,
	HLP_L_ShldrBlade_Trans                   = 22,
	HLP_L_CollarBone                         = 23,
	Chest_J                                  = 24,
	L_Pectoral_OPT001                        = 25,
	L_Pectoral_OPT002                        = 26,
	Rear_J                                   = 27,
	L_UpLeg_J                                = 28,
	L_UpLeg_J__offset                        = 29,
	L_Leg_J__offset                          = 30,
	L_Foot_J                                 = 31,
	L_Foot_J__offset                         = 32,
	HLP_L_Leg_Slide                          = 33,
	HLP_L_Leg_Btm                            = 34,
	HLP_L_Leg_Mid                            = 35,
	HLP_L_Knee                               = 36,
	HLP_L_UpLeg_Top                          = 37,
	HLP_L_UpLeg_Mid                          = 38,
	HLP_L_UpLeg_Slide                        = 39,
	HLP_L_Butt                               = 40,
	HLP_L_Butt_Trans                         = 41,
	HLP_L_Hip                                = 42,
	HLP_L_Hip_Trans                          = 43,
	MAX                                      = 44,
};

// Enum SBAnimNode.ECharaPartsCrtBone
// NumValues: 0x000D
enum class ECharaPartsCrtBone : uint8
{
	None                                     = 0,
	CRT_L_Arm_UPPER                          = 1,
	CRT_L_ForeArm_UPPER1                     = 2,
	CRT_L_ForeArm_UPPER2                     = 3,
	CRT_L_ForeArm_UPPER3                     = 4,
	CRT_Hip_Upper                            = 5,
	CRT_L_UpLeg_LOWER1                       = 6,
	CRT_L_UpLeg_LOWER2                       = 7,
	CRT_L_Leg_LOWER1                         = 8,
	CRT_L_Leg_LOWER2                         = 9,
	CRT_Hip_Lower                            = 10,
	CRT_L_Ankle                              = 11,
	MAX                                      = 12,
};

// Enum SBAnimNode.ESBIKMode
// NumValues: 0x0005
enum class ESBIKMode : uint8
{
	Leg                                      = 0,
	Climb                                    = 1,
	Quadruped                                = 2,
	Arm                                      = 3,
	ESBIKMode_MAX                            = 4,
};

// Enum SBAnimNode.ESBBoneModificationMode
// NumValues: 0x0004
enum class ESBBoneModificationMode : uint8
{
	SB_BMM_Ignore                            = 0,
	SB_BMM_Replace                           = 1,
	SB_BMM_Additive                          = 2,
	SB_BMM_MAX                               = 3,
};

// Enum SBAnimNode.EPartsDamageState
// NumValues: 0x0004
enum class EPartsDamageState : uint8
{
	Off                                      = 0,
	On                                       = 1,
	Cancel                                   = 2,
	EPartsDamageState_MAX                    = 3,
};

// Enum SBAnimNode.ESBSplineBoneAxis
// NumValues: 0x0004
enum class ESBSplineBoneAxis : uint8
{
	X                                        = 1,
	Y                                        = 2,
	Z                                        = 3,
	ESBSplineBoneAxis_MAX                    = 4,
};

// Enum SBAnimNode.ESBIKJointNum
// NumValues: 0x0004
enum class ESBIKJointNum : uint8
{
	Two                                      = 2,
	Three                                    = 3,
	Four                                     = 4,
	ESBIKJointNum_MAX                        = 5,
};

// Enum SBAnimNode.ESBIKBoneNum
// NumValues: 0x0004
enum class ESBIKBoneNum : uint8
{
	Two                                      = 2,
	Three                                    = 3,
	Four                                     = 4,
	ESBIKBoneNum_MAX                         = 5,
};

// Enum SBAnimNode.ESBLegIKRotateType
// NumValues: 0x0005
enum class ESBLegIKRotateType : uint8
{
	OneAxis                                  = 0,
	TwoAxis                                  = 1,
	ThreeAxis                                = 2,
	Num                                      = 3,
	ESBLegIKRotateType_MAX                   = 4,
};

// ScriptStruct SBAnimNode.SBAnimNode_CustomBoneScaleLocal
// 0x1038 (0x1048 - 0x0010)
struct FSBAnimNode_CustomBoneScaleLocal final : public FAnimNode_Base
{
public:
	struct FPoseLink                              InputPose;                                         // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CC7[0x1028];                                  // 0x0020(0x1028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_CustomBoneScaleLocal) == 0x000008, "Wrong alignment on FSBAnimNode_CustomBoneScaleLocal");
static_assert(sizeof(FSBAnimNode_CustomBoneScaleLocal) == 0x001048, "Wrong size on FSBAnimNode_CustomBoneScaleLocal");
static_assert(offsetof(FSBAnimNode_CustomBoneScaleLocal, InputPose) == 0x000010, "Member 'FSBAnimNode_CustomBoneScaleLocal::InputPose' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_Base
// 0x0030 (0x00F8 - 0x00C8)
struct FSBAnimNode_Base : public FAnimNode_SkeletalControlBase
{
public:
	bool                                          bActive;                                           // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipRoleAuthority;                                // 0x00C9(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CC8[0xE];                                     // 0x00CA(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         ScaleBaseBone;                                     // 0x00D8(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1CC9[0x10];                                    // 0x00E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_Base) == 0x000008, "Wrong alignment on FSBAnimNode_Base");
static_assert(sizeof(FSBAnimNode_Base) == 0x0000F8, "Wrong size on FSBAnimNode_Base");
static_assert(offsetof(FSBAnimNode_Base, bActive) == 0x0000C8, "Member 'FSBAnimNode_Base::bActive' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_Base, bSkipRoleAuthority) == 0x0000C9, "Member 'FSBAnimNode_Base::bSkipRoleAuthority' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_Base, ScaleBaseBone) == 0x0000D8, "Member 'FSBAnimNode_Base::ScaleBaseBone' has a wrong offset!");

// ScriptStruct SBAnimNode.SBCustomBoneScaleLocal
// 0x0014 (0x0014 - 0x0000)
struct FSBCustomBoneScaleLocal final
{
public:
	struct FBoneReference                         TargetBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ECharaCreateBoneScaleID                       SourceBoneScaleID;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharaPartsCrtBone                            SourceCrtBoneScaleID;                              // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDivide;                                           // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFSBCustomBoneScaleAxisSwapType               AxisSwap;                                          // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBCustomBoneScaleLocal) == 0x000004, "Wrong alignment on FSBCustomBoneScaleLocal");
static_assert(sizeof(FSBCustomBoneScaleLocal) == 0x000014, "Wrong size on FSBCustomBoneScaleLocal");
static_assert(offsetof(FSBCustomBoneScaleLocal, TargetBone) == 0x000000, "Member 'FSBCustomBoneScaleLocal::TargetBone' has a wrong offset!");
static_assert(offsetof(FSBCustomBoneScaleLocal, SourceBoneScaleID) == 0x000010, "Member 'FSBCustomBoneScaleLocal::SourceBoneScaleID' has a wrong offset!");
static_assert(offsetof(FSBCustomBoneScaleLocal, SourceCrtBoneScaleID) == 0x000011, "Member 'FSBCustomBoneScaleLocal::SourceCrtBoneScaleID' has a wrong offset!");
static_assert(offsetof(FSBCustomBoneScaleLocal, bDivide) == 0x000012, "Member 'FSBCustomBoneScaleLocal::bDivide' has a wrong offset!");
static_assert(offsetof(FSBCustomBoneScaleLocal, AxisSwap) == 0x000013, "Member 'FSBCustomBoneScaleLocal::AxisSwap' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_CameraLookAt
// 0x00D8 (0x01A0 - 0x00C8)
struct FSBAnimNode_CameraLookAt final : public FAnimNode_SkeletalControlBase
{
public:
	struct FBoneReference                         BoneToModify;                                      // 0x00C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CCA[0x8];                                     // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneSocketTarget                      LookAtTarget;                                      // 0x00E0(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneSocketTarget                      UpTarget;                                          // 0x0140(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBAnimNode_CameraLookAt) == 0x000010, "Wrong alignment on FSBAnimNode_CameraLookAt");
static_assert(sizeof(FSBAnimNode_CameraLookAt) == 0x0001A0, "Wrong size on FSBAnimNode_CameraLookAt");
static_assert(offsetof(FSBAnimNode_CameraLookAt, BoneToModify) == 0x0000C8, "Member 'FSBAnimNode_CameraLookAt::BoneToModify' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CameraLookAt, LookAtTarget) == 0x0000E0, "Member 'FSBAnimNode_CameraLookAt::LookAtTarget' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CameraLookAt, UpTarget) == 0x000140, "Member 'FSBAnimNode_CameraLookAt::UpTarget' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_CopyBoneParameter
// 0x0028 (0x0028 - 0x0000)
struct FSBAnimNode_CopyBoneParameter final
{
public:
	struct FBoneReference                         SourceBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         TargetBone;                                        // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCopyTranslation;                                  // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyRotation;                                     // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyScale;                                        // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneControlSpace                             ControlSpace;                                      // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendAlpha;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBAnimNode_CopyBoneParameter) == 0x000004, "Wrong alignment on FSBAnimNode_CopyBoneParameter");
static_assert(sizeof(FSBAnimNode_CopyBoneParameter) == 0x000028, "Wrong size on FSBAnimNode_CopyBoneParameter");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, SourceBone) == 0x000000, "Member 'FSBAnimNode_CopyBoneParameter::SourceBone' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, TargetBone) == 0x000010, "Member 'FSBAnimNode_CopyBoneParameter::TargetBone' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, bCopyTranslation) == 0x000020, "Member 'FSBAnimNode_CopyBoneParameter::bCopyTranslation' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, bCopyRotation) == 0x000021, "Member 'FSBAnimNode_CopyBoneParameter::bCopyRotation' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, bCopyScale) == 0x000022, "Member 'FSBAnimNode_CopyBoneParameter::bCopyScale' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, ControlSpace) == 0x000023, "Member 'FSBAnimNode_CopyBoneParameter::ControlSpace' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBoneParameter, BlendAlpha) == 0x000024, "Member 'FSBAnimNode_CopyBoneParameter::BlendAlpha' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_CopyBone
// 0x0030 (0x0128 - 0x00F8)
struct FSBAnimNode_CopyBone final : public FSBAnimNode_Base
{
public:
	TArray<struct FSBAnimNode_CopyBoneParameter>  ParamArray;                                        // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPoseLink                              SourcePose;                                        // 0x0108(0x0010)(Edit, BlueprintVisible, EditFixedSize, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CCB[0xC];                                     // 0x011C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_CopyBone) == 0x000008, "Wrong alignment on FSBAnimNode_CopyBone");
static_assert(sizeof(FSBAnimNode_CopyBone) == 0x000128, "Wrong size on FSBAnimNode_CopyBone");
static_assert(offsetof(FSBAnimNode_CopyBone, ParamArray) == 0x0000F8, "Member 'FSBAnimNode_CopyBone::ParamArray' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBone, SourcePose) == 0x000108, "Member 'FSBAnimNode_CopyBone::SourcePose' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CopyBone, BlendTime) == 0x000118, "Member 'FSBAnimNode_CopyBone::BlendTime' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_CrtBoneScale
// 0x0008 (0x00D0 - 0x00C8)
struct FSBAnimNode_CrtBoneScale final : public FAnimNode_SkeletalControlBase
{
public:
	bool                                          bDivide;                                           // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CCC[0x7];                                     // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_CrtBoneScale) == 0x000008, "Wrong alignment on FSBAnimNode_CrtBoneScale");
static_assert(sizeof(FSBAnimNode_CrtBoneScale) == 0x0000D0, "Wrong size on FSBAnimNode_CrtBoneScale");
static_assert(offsetof(FSBAnimNode_CrtBoneScale, bDivide) == 0x0000C8, "Member 'FSBAnimNode_CrtBoneScale::bDivide' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_CustomBoneScale
// 0x0008 (0x00D0 - 0x00C8)
struct FSBAnimNode_CustomBoneScale final : public FAnimNode_SkeletalControlBase
{
public:
	bool                                          bDivide;                                           // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFSBCustomBoneScaleAxisSwapType               AxisSwap;                                          // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CCD[0x6];                                     // 0x00CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_CustomBoneScale) == 0x000008, "Wrong alignment on FSBAnimNode_CustomBoneScale");
static_assert(sizeof(FSBAnimNode_CustomBoneScale) == 0x0000D0, "Wrong size on FSBAnimNode_CustomBoneScale");
static_assert(offsetof(FSBAnimNode_CustomBoneScale, bDivide) == 0x0000C8, "Member 'FSBAnimNode_CustomBoneScale::bDivide' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_CustomBoneScale, AxisSwap) == 0x0000C9, "Member 'FSBAnimNode_CustomBoneScale::AxisSwap' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_FacialEyelid
// 0x0068 (0x00E8 - 0x0080)
struct FSBAnimNode_FacialEyelid final : public FAnimNode_PoseHandler
{
public:
	struct FPoseLink                              SourcePose;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, EditFixedSize, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   MoveUEyeLPoseName;                                 // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveDEyeLPoseName;                                 // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveLEyeLPoseName;                                 // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveREyeLPoseName;                                 // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveUEyeRPoseName;                                 // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveDEyeRPoseName;                                 // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveLEyeRPoseName;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MoveREyeRPoseName;                                 // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EyeUD;                                             // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EyeLR;                                             // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CCE[0x10];                                    // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_FacialEyelid) == 0x000008, "Wrong alignment on FSBAnimNode_FacialEyelid");
static_assert(sizeof(FSBAnimNode_FacialEyelid) == 0x0000E8, "Wrong size on FSBAnimNode_FacialEyelid");
static_assert(offsetof(FSBAnimNode_FacialEyelid, SourcePose) == 0x000080, "Member 'FSBAnimNode_FacialEyelid::SourcePose' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveUEyeLPoseName) == 0x000090, "Member 'FSBAnimNode_FacialEyelid::MoveUEyeLPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveDEyeLPoseName) == 0x000098, "Member 'FSBAnimNode_FacialEyelid::MoveDEyeLPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveLEyeLPoseName) == 0x0000A0, "Member 'FSBAnimNode_FacialEyelid::MoveLEyeLPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveREyeLPoseName) == 0x0000A8, "Member 'FSBAnimNode_FacialEyelid::MoveREyeLPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveUEyeRPoseName) == 0x0000B0, "Member 'FSBAnimNode_FacialEyelid::MoveUEyeRPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveDEyeRPoseName) == 0x0000B8, "Member 'FSBAnimNode_FacialEyelid::MoveDEyeRPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveLEyeRPoseName) == 0x0000C0, "Member 'FSBAnimNode_FacialEyelid::MoveLEyeRPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, MoveREyeRPoseName) == 0x0000C8, "Member 'FSBAnimNode_FacialEyelid::MoveREyeRPoseName' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, EyeUD) == 0x0000D0, "Member 'FSBAnimNode_FacialEyelid::EyeUD' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_FacialEyelid, EyeLR) == 0x0000D4, "Member 'FSBAnimNode_FacialEyelid::EyeLR' has a wrong offset!");

// ScriptStruct SBAnimNode.SBMinAndMax
// 0x0008 (0x0008 - 0x0000)
struct FSBMinAndMax final
{
public:
	float                                         Min;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBMinAndMax) == 0x000004, "Wrong alignment on FSBMinAndMax");
static_assert(sizeof(FSBMinAndMax) == 0x000008, "Wrong size on FSBMinAndMax");
static_assert(offsetof(FSBMinAndMax, Min) == 0x000000, "Member 'FSBMinAndMax::Min' has a wrong offset!");
static_assert(offsetof(FSBMinAndMax, Max) == 0x000004, "Member 'FSBMinAndMax::Max' has a wrong offset!");

// ScriptStruct SBAnimNode.SBLegIKInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FSBLegIKInfo final
{
public:
	struct FBoneReference                         IKBone;                                            // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ESBIKBoneNum                                  BoneNum;                                           // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CCF[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         SoleBone;                                          // 0x0014(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         SoleBoneForTrace;                                  // 0x0024(0x0010)(Deprecated, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         CachedEndBone;                                     // 0x0034(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                JointTargetLocation;                               // 0x0044(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStickPosition;                                    // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD0[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StickLimitDistanceOffset;                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SoleDirection;                                     // 0x0058(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotate;                                           // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESBLegIKRotateType                            LegIKRotateType;                                   // 0x0065(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOneAxisRotate;                                    // 0x0066(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD1[0x1];                                     // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RotateDirection;                                   // 0x0068(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSBMinAndMax                           AngleMinAndMaxSole;                                // 0x0074(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD2[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMinAndMax>                   AngleLimitArray;                                   // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SoleContactLimbRatio;                              // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceStartLimbRatio;                               // 0x0094(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceEndLimbRatio;                                 // 0x0098(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD3[0x14];                                    // 0x009C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBLegIKInfo) == 0x000008, "Wrong alignment on FSBLegIKInfo");
static_assert(sizeof(FSBLegIKInfo) == 0x0000B0, "Wrong size on FSBLegIKInfo");
static_assert(offsetof(FSBLegIKInfo, IKBone) == 0x000000, "Member 'FSBLegIKInfo::IKBone' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, BoneNum) == 0x000010, "Member 'FSBLegIKInfo::BoneNum' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, SoleBone) == 0x000014, "Member 'FSBLegIKInfo::SoleBone' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, SoleBoneForTrace) == 0x000024, "Member 'FSBLegIKInfo::SoleBoneForTrace' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, CachedEndBone) == 0x000034, "Member 'FSBLegIKInfo::CachedEndBone' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, JointTargetLocation) == 0x000044, "Member 'FSBLegIKInfo::JointTargetLocation' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, bStickPosition) == 0x000050, "Member 'FSBLegIKInfo::bStickPosition' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, StickLimitDistanceOffset) == 0x000054, "Member 'FSBLegIKInfo::StickLimitDistanceOffset' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, SoleDirection) == 0x000058, "Member 'FSBLegIKInfo::SoleDirection' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, bRotate) == 0x000064, "Member 'FSBLegIKInfo::bRotate' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, LegIKRotateType) == 0x000065, "Member 'FSBLegIKInfo::LegIKRotateType' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, bOneAxisRotate) == 0x000066, "Member 'FSBLegIKInfo::bOneAxisRotate' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, RotateDirection) == 0x000068, "Member 'FSBLegIKInfo::RotateDirection' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, AngleMinAndMaxSole) == 0x000074, "Member 'FSBLegIKInfo::AngleMinAndMaxSole' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, AngleLimitArray) == 0x000080, "Member 'FSBLegIKInfo::AngleLimitArray' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, SoleContactLimbRatio) == 0x000090, "Member 'FSBLegIKInfo::SoleContactLimbRatio' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, TraceStartLimbRatio) == 0x000094, "Member 'FSBLegIKInfo::TraceStartLimbRatio' has a wrong offset!");
static_assert(offsetof(FSBLegIKInfo, TraceEndLimbRatio) == 0x000098, "Member 'FSBLegIKInfo::TraceEndLimbRatio' has a wrong offset!");

// ScriptStruct SBAnimNode.SBThreeFourBoneIKParam
// 0x0010 (0x0010 - 0x0000)
struct FSBThreeFourBoneIKParam final
{
public:
	float                                         TranslationLimit;                                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Lambda;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxIterationNum;                                   // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ErrorToleranceTranslation;                         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBThreeFourBoneIKParam) == 0x000004, "Wrong alignment on FSBThreeFourBoneIKParam");
static_assert(sizeof(FSBThreeFourBoneIKParam) == 0x000010, "Wrong size on FSBThreeFourBoneIKParam");
static_assert(offsetof(FSBThreeFourBoneIKParam, TranslationLimit) == 0x000000, "Member 'FSBThreeFourBoneIKParam::TranslationLimit' has a wrong offset!");
static_assert(offsetof(FSBThreeFourBoneIKParam, Lambda) == 0x000004, "Member 'FSBThreeFourBoneIKParam::Lambda' has a wrong offset!");
static_assert(offsetof(FSBThreeFourBoneIKParam, MaxIterationNum) == 0x000008, "Member 'FSBThreeFourBoneIKParam::MaxIterationNum' has a wrong offset!");
static_assert(offsetof(FSBThreeFourBoneIKParam, ErrorToleranceTranslation) == 0x00000C, "Member 'FSBThreeFourBoneIKParam::ErrorToleranceTranslation' has a wrong offset!");

// ScriptStruct SBAnimNode.SBIKStatus
// 0x0001 (0x0001 - 0x0000)
struct FSBIKStatus final
{
public:
	bool                                          bForceContact;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBIKStatus) == 0x000001, "Wrong alignment on FSBIKStatus");
static_assert(sizeof(FSBIKStatus) == 0x000001, "Wrong size on FSBIKStatus");
static_assert(offsetof(FSBIKStatus, bForceContact) == 0x000000, "Member 'FSBIKStatus::bForceContact' has a wrong offset!");

// ScriptStruct SBAnimNode.SBIKStatusAll
// 0x0010 (0x0010 - 0x0000)
struct FSBIKStatusAll final
{
public:
	TArray<struct FSBIKStatus>                    IKStatusArray;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBIKStatusAll) == 0x000008, "Wrong alignment on FSBIKStatusAll");
static_assert(sizeof(FSBIKStatusAll) == 0x000010, "Wrong size on FSBIKStatusAll");
static_assert(offsetof(FSBIKStatusAll, IKStatusArray) == 0x000000, "Member 'FSBIKStatusAll::IKStatusArray' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_LegIK
// 0x06C8 (0x07C0 - 0x00F8)
struct FSBAnimNode_LegIK final : public FSBAnimNode_Base
{
public:
	struct FPoseLink                              ReferencePose;                                     // 0x00F8(0x0010)(Edit, BlueprintVisible, EditFixedSize, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStickReferencePoseLimb;                           // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD4[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         BaseBone;                                          // 0x010C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBaseMove;                                         // 0x011C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD5[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlane                                 RefAnimPlane;                                      // 0x0120(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD6[0x10];                                    // 0x0130(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaneNormalScale;                                  // 0x0140(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESBIKMode                                     ModeType;                                          // 0x0144(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD7[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotateLeftRightWeight;                             // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateForeBackWeight;                              // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetDistance;                                    // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD8[0x4];                                     // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBLegIKInfo>                   LegIKInfoArray;                                    // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         BaseInterpSpeedMultiple;                           // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseInterpSpeedPow;                                // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseRotateInterpSpeedMultiple;                     // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseRotateInterpSpeedPow;                          // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LegInGroundInterpSpeedMultiple;                    // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LegInterpSpeedMultiple;                            // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LegInterpSpeedPow;                                 // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRotateInterpSpeedMultiple;                     // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootRotateInterpSpeedPow;                          // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundLegMoveThreshold;                            // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SleepTraceDuration;                                // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebugDrawInGame;                            // 0x0194(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CD9[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBThreeFourBoneIKParam                ThreeFourBoneIKParam;                              // 0x0198(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSBIKStatusAll                         IKStatusAll;                                       // 0x01A8(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         BaseMoveLimit;                                     // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceStartRatio;                                   // 0x01BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceEndRatio;                                     // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseRotateLimit;                                   // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDA[0x5F8];                                   // 0x01C8(0x05F8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_LegIK) == 0x000010, "Wrong alignment on FSBAnimNode_LegIK");
static_assert(sizeof(FSBAnimNode_LegIK) == 0x0007C0, "Wrong size on FSBAnimNode_LegIK");
static_assert(offsetof(FSBAnimNode_LegIK, ReferencePose) == 0x0000F8, "Member 'FSBAnimNode_LegIK::ReferencePose' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, bStickReferencePoseLimb) == 0x000108, "Member 'FSBAnimNode_LegIK::bStickReferencePoseLimb' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseBone) == 0x00010C, "Member 'FSBAnimNode_LegIK::BaseBone' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, bBaseMove) == 0x00011C, "Member 'FSBAnimNode_LegIK::bBaseMove' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, RefAnimPlane) == 0x000120, "Member 'FSBAnimNode_LegIK::RefAnimPlane' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, PlaneNormalScale) == 0x000140, "Member 'FSBAnimNode_LegIK::PlaneNormalScale' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, ModeType) == 0x000144, "Member 'FSBAnimNode_LegIK::ModeType' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, RotateLeftRightWeight) == 0x000148, "Member 'FSBAnimNode_LegIK::RotateLeftRightWeight' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, RotateForeBackWeight) == 0x00014C, "Member 'FSBAnimNode_LegIK::RotateForeBackWeight' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, OffsetDistance) == 0x000150, "Member 'FSBAnimNode_LegIK::OffsetDistance' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, LegIKInfoArray) == 0x000158, "Member 'FSBAnimNode_LegIK::LegIKInfoArray' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseInterpSpeedMultiple) == 0x000168, "Member 'FSBAnimNode_LegIK::BaseInterpSpeedMultiple' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseInterpSpeedPow) == 0x00016C, "Member 'FSBAnimNode_LegIK::BaseInterpSpeedPow' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseRotateInterpSpeedMultiple) == 0x000170, "Member 'FSBAnimNode_LegIK::BaseRotateInterpSpeedMultiple' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseRotateInterpSpeedPow) == 0x000174, "Member 'FSBAnimNode_LegIK::BaseRotateInterpSpeedPow' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, LegInGroundInterpSpeedMultiple) == 0x000178, "Member 'FSBAnimNode_LegIK::LegInGroundInterpSpeedMultiple' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, LegInterpSpeedMultiple) == 0x00017C, "Member 'FSBAnimNode_LegIK::LegInterpSpeedMultiple' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, LegInterpSpeedPow) == 0x000180, "Member 'FSBAnimNode_LegIK::LegInterpSpeedPow' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, FootRotateInterpSpeedMultiple) == 0x000184, "Member 'FSBAnimNode_LegIK::FootRotateInterpSpeedMultiple' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, FootRotateInterpSpeedPow) == 0x000188, "Member 'FSBAnimNode_LegIK::FootRotateInterpSpeedPow' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, GroundLegMoveThreshold) == 0x00018C, "Member 'FSBAnimNode_LegIK::GroundLegMoveThreshold' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, SleepTraceDuration) == 0x000190, "Member 'FSBAnimNode_LegIK::SleepTraceDuration' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, bEnableDebugDrawInGame) == 0x000194, "Member 'FSBAnimNode_LegIK::bEnableDebugDrawInGame' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, ThreeFourBoneIKParam) == 0x000198, "Member 'FSBAnimNode_LegIK::ThreeFourBoneIKParam' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, IKStatusAll) == 0x0001A8, "Member 'FSBAnimNode_LegIK::IKStatusAll' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseMoveLimit) == 0x0001B8, "Member 'FSBAnimNode_LegIK::BaseMoveLimit' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, TraceStartRatio) == 0x0001BC, "Member 'FSBAnimNode_LegIK::TraceStartRatio' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, TraceEndRatio) == 0x0001C0, "Member 'FSBAnimNode_LegIK::TraceEndRatio' has a wrong offset!");
static_assert(offsetof(FSBAnimNode_LegIK, BaseRotateLimit) == 0x0001C4, "Member 'FSBAnimNode_LegIK::BaseRotateLimit' has a wrong offset!");

// ScriptStruct SBAnimNode.SBLookAtCustomParam
// 0x001C (0x001C - 0x0000)
struct FSBLookAtCustomParam final
{
public:
	float                                         SpeedMultiply;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedPowMultiply;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampPitchMultiply;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampYawMultiply;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PropagationHierarchyWeight;                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeadBandMultiply;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFiltering;                                  // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDB[0x3];                                     // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBLookAtCustomParam) == 0x000004, "Wrong alignment on FSBLookAtCustomParam");
static_assert(sizeof(FSBLookAtCustomParam) == 0x00001C, "Wrong size on FSBLookAtCustomParam");
static_assert(offsetof(FSBLookAtCustomParam, SpeedMultiply) == 0x000000, "Member 'FSBLookAtCustomParam::SpeedMultiply' has a wrong offset!");
static_assert(offsetof(FSBLookAtCustomParam, SpeedPowMultiply) == 0x000004, "Member 'FSBLookAtCustomParam::SpeedPowMultiply' has a wrong offset!");
static_assert(offsetof(FSBLookAtCustomParam, ClampPitchMultiply) == 0x000008, "Member 'FSBLookAtCustomParam::ClampPitchMultiply' has a wrong offset!");
static_assert(offsetof(FSBLookAtCustomParam, ClampYawMultiply) == 0x00000C, "Member 'FSBLookAtCustomParam::ClampYawMultiply' has a wrong offset!");
static_assert(offsetof(FSBLookAtCustomParam, PropagationHierarchyWeight) == 0x000010, "Member 'FSBLookAtCustomParam::PropagationHierarchyWeight' has a wrong offset!");
static_assert(offsetof(FSBLookAtCustomParam, DeadBandMultiply) == 0x000014, "Member 'FSBLookAtCustomParam::DeadBandMultiply' has a wrong offset!");
static_assert(offsetof(FSBLookAtCustomParam, bEnableFiltering) == 0x000018, "Member 'FSBLookAtCustomParam::bEnableFiltering' has a wrong offset!");

// ScriptStruct SBAnimNode.SBLookAtBlendWeight
// 0x0010 (0x0010 - 0x0000)
struct FSBLookAtBlendWeight final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roll;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSBLookAtBlendWeight) == 0x000004, "Wrong alignment on FSBLookAtBlendWeight");
static_assert(sizeof(FSBLookAtBlendWeight) == 0x000010, "Wrong size on FSBLookAtBlendWeight");
static_assert(offsetof(FSBLookAtBlendWeight, Yaw) == 0x000000, "Member 'FSBLookAtBlendWeight::Yaw' has a wrong offset!");
static_assert(offsetof(FSBLookAtBlendWeight, Pitch) == 0x000004, "Member 'FSBLookAtBlendWeight::Pitch' has a wrong offset!");
static_assert(offsetof(FSBLookAtBlendWeight, Roll) == 0x000008, "Member 'FSBLookAtBlendWeight::Roll' has a wrong offset!");
static_assert(offsetof(FSBLookAtBlendWeight, Speed) == 0x00000C, "Member 'FSBLookAtBlendWeight::Speed' has a wrong offset!");

// ScriptStruct SBAnimNode.SBAnimNode_LookAt
// 0x0C08 (0x0D00 - 0x00F8)
struct FSBAnimNode_LookAt final : public FSBAnimNode_Base
{
public:
	struct FBoneReference                         RotateBoneReference;                               // 0x00F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDC[0x8];                                     // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneSocketTarget                      AimTReference;                                     // 0x0110(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneSocketTarget                      TargetTReference;                                  // 0x0170(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         EyeBoneReference;                                  // 0x01D0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 ArmRotateBoneReferenceArray;                       // 0x01E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ArmRotateSpineTwist;                               // 0x01F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ArmRotateSpineBend;                                // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ArmRotateSpineAxis;                                // 0x01F8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LookAtTargetLocation;                              // 0x0204(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActiveCustomEye;                                  // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDD[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LookAtCustomEyeTargetLocation;                     // 0x0214(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAxis                                  LookAt_Axis;                                       // 0x0220(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAxis                                  LookUp_Axis;                                       // 0x0230(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LookAtClampYaw;                                    // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtClampPitch;                                  // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtEyeClampYaw;                                 // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookAtEyeClampPitch;                               // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FilterTerm;                                        // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableFiltering;                                  // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDE[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpolationVelocityMultiple;                     // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationVelocityPow;                          // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationVelocityMin;                          // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalWeight;                                       // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutWeightStrength;                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSBLookAtBlendWeight                   TopWeight;                                         // 0x026C(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CDF[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBLookAtBlendWeight>           WeightArray;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableDebug;                                      // 0x0290(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE0[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLookAtCustomParam                   CustomParam;                                       // 0x0294(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bArmRotateControl;                                 // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceDisable;                                     // 0x02B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CE1[0xA4E];                                   // 0x02B2(0x0A4E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSBAnimNode_LookAt) == 0x000010, "Wrong alignment on FSBAnimNode_LookAt");
static_assert(sizeof(FSBAnimNode_LookAt) == 0x000D00, "Wrong size on FSBAnimNode_LookAt");
static_assert(offsetof(FSBAnimNode_LookAt, RotateBoneReference) == 0x0000F8, "Member 'FSBAnimNode_LookAt::RotateBoneReference' has a wrong offset!");
