#pragma once

 

// Package: SelectMaterial

#include "Basic.hpp"

#include "Filter_Type_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "SortTypeCategory_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SelectMaterial.SelectMaterial_C.OnSelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct SelectMaterial_C_OnSelected__DelegateSignature final
{
public:
	TArray<struct FOwnItemInfo>                   Uids;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          UseTicket;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E90[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStackBUseTicket                     StackBTicket;                                      // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SelectMaterial_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on SelectMaterial_C_OnSelected__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_OnSelected__DelegateSignature) == 0x000020, "Wrong size on SelectMaterial_C_OnSelected__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_OnSelected__DelegateSignature, Uids) == 0x000000, "Member 'SelectMaterial_C_OnSelected__DelegateSignature::Uids' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_OnSelected__DelegateSignature, UseTicket) == 0x000010, "Member 'SelectMaterial_C_OnSelected__DelegateSignature::UseTicket' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_OnSelected__DelegateSignature, StackBTicket) == 0x000014, "Member 'SelectMaterial_C_OnSelected__DelegateSignature::StackBTicket' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.ExecuteUbergraph_SelectMaterial
// 0x0598 (0x0598 - 0x0000)
struct SelectMaterial_C_ExecuteUbergraph_SelectMaterial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_ContainsStackBMaterials_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E91[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedMoreMaterial_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_3;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNeedMoreMaterial_ReturnValue_1;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E92[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0078(0x0028)()
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x00A0(0x0010)(ReferenceParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B0(0x0028)()
	struct FOwnItemInfo                           K2Node_ComponentBoundEvent_SelectItem_2;           // 0x00D8(0x0118)()
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDialogResult                                 K2Node_CustomEvent_Result_2;                       // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E93[0x2];                                     // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           K2Node_ComponentBoundEvent_SelectItem_1;           // 0x01F8(0x0118)()
	bool                                          CallFunc_HasMaterialStorage_bOutExist;             // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E94[0x7];                                     // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           K2Node_ComponentBoundEvent_SelectItem;             // 0x0318(0x0118)()
	bool                                          CallFunc_HasMaterialStorage_bOutExist_1;           // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsBattleSetItem_ReturnValue;        // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result_1;                       // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E95[0x2];                                     // 0x0436(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0448(0x0018)()
	ESBItemSortType                               K2Node_ComponentBoundEvent_SortType;               // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E96[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOwnItemInfo>                   CallFunc_GenerateUIDs_ReturnValue;                 // 0x0468(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0480(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0490(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EDialogResult                                 K2Node_CustomEvent_Result;                         // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E97[0x6];                                     // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E98[0x7];                                     // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E99[0x7];                                     // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_3;            // 0x04F0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0500(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9A[0x7];                                     // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0520(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0532(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9B[0x5];                                     // 0x0533(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9C[0x7];                                     // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_1;                           // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_PageCurrent;            // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9D[0x4];                                     // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_2;                     // 0x0590(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial) == 0x000008, "Wrong alignment on SelectMaterial_C_ExecuteUbergraph_SelectMaterial");
static_assert(sizeof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial) == 0x000598, "Wrong size on SelectMaterial_C_ExecuteUbergraph_SelectMaterial");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, EntryPoint) == 0x000000, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::EntryPoint' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_ContainsStackBMaterials_ReturnValue) == 0x000014, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_ContainsStackBMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Create_ReturnValue) == 0x000018, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_IsNeedMoreMaterial_ReturnValue) == 0x000020, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_IsNeedMoreMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CustomEvent_Result_3) == 0x000021, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CustomEvent_Result_3' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_IsNeedMoreMaterial_ReturnValue_1) == 0x000023, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_IsNeedMoreMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_GetTextFromAsset_ReturnValue) == 0x000028, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_MakeStruct_SlateColor_1) == 0x000078, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_Filters) == 0x0000A0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_MakeStruct_SlateColor_2) == 0x0000B0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_SelectItem_2) == 0x0000D8, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_SelectItem_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_PlaySE_ReturnValue) == 0x0001F0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CustomEvent_Result_2) == 0x0001F4, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CustomEvent_Result_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001F5, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_SelectItem_1) == 0x0001F8, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_SelectItem_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_HasMaterialStorage_bOutExist) == 0x000310, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_HasMaterialStorage_bOutExist' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_SelectItem) == 0x000318, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_SelectItem' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_HasMaterialStorage_bOutExist_1) == 0x000430, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_HasMaterialStorage_bOutExist_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_bIsChecked) == 0x000431, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_ContainsBattleSetItem_ReturnValue) == 0x000432, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_ContainsBattleSetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CustomEvent_Result_1) == 0x000433, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CustomEvent_Result_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000434, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_IsChecked_ReturnValue) == 0x000435, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000438, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000448, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_SortType) == 0x000460, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_SortType' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_GenerateUIDs_ReturnValue) == 0x000468, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_GenerateUIDs_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_PlayAnimationForward_ReturnValue) == 0x000478, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CreateDelegate_OutputDelegate_1) == 0x000480, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CreateDelegate_OutputDelegate_2) == 0x000490, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0004A0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, Temp_bool_Variable) == 0x0004A8, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CustomEvent_Result) == 0x0004A9, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x0004B0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0004C0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Concat_StrStr_ReturnValue) == 0x0004C8, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, Temp_bool_Variable_1) == 0x0004D8, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0004E0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_CreateDelegate_OutputDelegate_3) == 0x0004F0, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000500, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_IsEmpty_ReturnValue) == 0x000518, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_GetTextFromAsset_ReturnValue_3) == 0x000520, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_GetTextFromAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_IsEmpty_ReturnValue_1) == 0x000530, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Not_PreBool_ReturnValue) == 0x000531, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_BooleanXOR_ReturnValue) == 0x000532, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000538, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_BooleanAND_ReturnValue) == 0x000548, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000550, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_Select_Default) == 0x000560, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Create_ReturnValue_1) == 0x000570, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_Select_Default_1) == 0x000578, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, K2Node_ComponentBoundEvent_PageCurrent) == 0x000588, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::K2Node_ComponentBoundEvent_PageCurrent' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_ExecuteUbergraph_SelectMaterial, CallFunc_Create_ReturnValue_2) == 0x000590, "Member 'SelectMaterial_C_ExecuteUbergraph_SelectMaterial::CallFunc_Create_ReturnValue_2' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature final
{
public:
	int32                                         PageCurrent;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature) == 0x000004, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature) == 0x000004, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature, PageCurrent) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_StoragePager_K2Node_ComponentBoundEvent_0_OnPageChange__DelegateSignature::PageCurrent' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.OnCloseDialog
// 0x0001 (0x0001 - 0x0000)
struct SelectMaterial_C_OnCloseDialog final
{
public:
	EDialogResult                                 Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_OnCloseDialog) == 0x000001, "Wrong alignment on SelectMaterial_C_OnCloseDialog");
static_assert(sizeof(SelectMaterial_C_OnCloseDialog) == 0x000001, "Wrong size on SelectMaterial_C_OnCloseDialog");
static_assert(offsetof(SelectMaterial_C_OnCloseDialog, Result) == 0x000000, "Member 'SelectMaterial_C_OnCloseDialog::Result' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.OnEndBattleContains
// 0x0001 (0x0001 - 0x0000)
struct SelectMaterial_C_OnEndBattleContains final
{
public:
	EDialogResult                                 Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_OnEndBattleContains) == 0x000001, "Wrong alignment on SelectMaterial_C_OnEndBattleContains");
static_assert(sizeof(SelectMaterial_C_OnEndBattleContains) == 0x000001, "Wrong size on SelectMaterial_C_OnEndBattleContains");
static_assert(offsetof(SelectMaterial_C_OnEndBattleContains, Result) == 0x000000, "Member 'SelectMaterial_C_OnEndBattleContains::Result' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature final
{
public:
	struct FOwnItemInfo                           SelectItem;                                        // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature) == 0x000008, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature) == 0x000118, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature, SelectItem) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_BagGrid_K2Node_ComponentBoundEvent_0_SelectedItem__DelegateSignature::SelectItem' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature final
{
public:
	struct FOwnItemInfo                           SelectItem;                                        // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature) == 0x000008, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature) == 0x000118, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature, SelectItem) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_StorageGrid_K2Node_ComponentBoundEvent_1_SelectedItem__DelegateSignature::SelectItem' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.OnSectedLockedItems
// 0x0001 (0x0001 - 0x0000)
struct SelectMaterial_C_OnSectedLockedItems final
{
public:
	EDialogResult                                 Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_OnSectedLockedItems) == 0x000001, "Wrong alignment on SelectMaterial_C_OnSectedLockedItems");
static_assert(sizeof(SelectMaterial_C_OnSectedLockedItems) == 0x000001, "Wrong size on SelectMaterial_C_OnSectedLockedItems");
static_assert(offsetof(SelectMaterial_C_OnSectedLockedItems, Result) == 0x000000, "Member 'SelectMaterial_C_OnSectedLockedItems::Result' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature final
{
public:
	struct FOwnItemInfo                           SelectItem;                                        // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature) == 0x000008, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature) == 0x000118, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature, SelectItem) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_MaterialGrid_K2Node_ComponentBoundEvent_2_SelectedItem__DelegateSignature::SelectItem' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature final
{
public:
	TArray<struct FFilterGroup>                   Filters;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature) == 0x000008, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature) == 0x000010, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature, Filters) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_StorageFilter_K2Node_ComponentBoundEvent_1_OnApplyFilter__DelegateSignature::Filters' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.OnEndDialog
// 0x0001 (0x0001 - 0x0000)
struct SelectMaterial_C_OnEndDialog final
{
public:
	EDialogResult                                 Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_OnEndDialog) == 0x000001, "Wrong alignment on SelectMaterial_C_OnEndDialog");
static_assert(sizeof(SelectMaterial_C_OnEndDialog) == 0x000001, "Wrong size on SelectMaterial_C_OnEndDialog");
static_assert(offsetof(SelectMaterial_C_OnEndDialog, Result) == 0x000000, "Member 'SelectMaterial_C_OnEndDialog::Result' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_CB_MaterialTicketUse_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature final
{
public:
	ESBItemSortType                               SortType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature) == 0x000001, "Wrong alignment on SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature");
static_assert(sizeof(SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature) == 0x000001, "Wrong size on SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature");
static_assert(offsetof(SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature, SortType) == 0x000000, "Member 'SelectMaterial_C_BndEvt__SelectMaterial_StorageSort_K2Node_ComponentBoundEvent_2_OnSelectSortType__DelegateSignature::SortType' has a wrong offset!");

// Function SelectMaterial.SelectMaterial_C.Initialize
// 0x01E8 (0x01E8 - 0x0000)
struct SelectMaterial_C_Initialize final
{
public:
	class USBMasterDataManager*                   MasterDataManager;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_1;                              // 0x0009(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_5;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_8;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_9;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_10;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_11;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_12;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_13;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_14;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_15;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_16;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_17;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_18;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             Temp_byte_Variable_19;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_20;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_21;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_22;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_23;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_24;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_25;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_26;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_27;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               Temp_byte_Variable_28;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9E[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_29;                             // 0x002C(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_30;                             // 0x002D(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_31;                             // 0x002E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConfigSaveManager_IsValid;             // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USBConfigureSaveManager*                CallFunc_GetConfigSaveManager_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOwnItemInfo                           CallFunc_Array_Get_Item;                           // 0x0038(0x0118)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_32;                             // 0x0154(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_33;                             // 0x0155(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBSortFilterSaveType                         Temp_byte_Variable_34;                             // 0x0156(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_35;                             // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isInventoryItemLocked_OutRequiredCnt;     // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isInventoryItemLocked_ReturnValue;        // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isStorageItemLocked_OutRequiredCnt;       // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isStorageItemLocked_ReturnValue;          // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9F[0x1];                                     // 0x015F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA0[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBTemporallyStorage*                   CallFunc_CreateEmptyTemporallyStorage_ReturnValue; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBSortFilterSaveType                         K2Node_Select_Default;                             // 0x0171(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBItemSortType                               CallFunc_GetSortType_ReturnValue;                  // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemFilterType                               K2Node_Select_Default_1;                           // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA1[0x1];                                     // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBStackBMasterData                    CallFunc_FindStackBMasterData_ReturnValue;         // 0x0180(0x0030)()
	ESBSortFilterSaveType                         K2Node_Select_Default_3;                           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESortTypeCategory                             K2Node_Select_Default_4;                           // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA2[0x5];                                     // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPageMax_MaxPage;                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EA3[0x4];                                     // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetCharacterStorage_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   CallFunc_GetTemporallyStorage_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBTemporallyStorage*                   CallFunc_GetTemporallyStorage_ReturnValue_1;       // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SelectMaterial_C_Initialize) == 0x000008, "Wrong alignment on SelectMaterial_C_Initialize");
static_assert(sizeof(SelectMaterial_C_Initialize) == 0x0001E8, "Wrong size on SelectMaterial_C_Initialize");
static_assert(offsetof(SelectMaterial_C_Initialize, MasterDataManager) == 0x000000, "Member 'SelectMaterial_C_Initialize::MasterDataManager' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable) == 0x000008, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_1) == 0x000009, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_2) == 0x00000A, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_3) == 0x00000B, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_4) == 0x00000C, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_5) == 0x00000D, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_6) == 0x00000E, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_7) == 0x00000F, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_8) == 0x000010, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_9) == 0x000011, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_10) == 0x000012, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_11) == 0x000013, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_12) == 0x000014, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_13) == 0x000015, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_14) == 0x000016, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_15) == 0x000017, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_16) == 0x000018, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_17) == 0x000019, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_18) == 0x00001A, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_19) == 0x00001B, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_20) == 0x00001C, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_21) == 0x00001D, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_22) == 0x00001E, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_23) == 0x00001F, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_24) == 0x000020, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_24' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_25) == 0x000021, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_25' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_26) == 0x000022, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_26' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_27) == 0x000023, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_27' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_28) == 0x000024, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_28' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_int_Array_Index_Variable) == 0x000028, "Member 'SelectMaterial_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_29) == 0x00002C, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_29' has a wrong offset!");
static_assert(offsetof(SelectMaterial_C_Initialize, Temp_byte_Variable_30) == 0x00002D, "Member 'SelectMaterial_C_Initialize::Temp_byte_Variable_30' has a wrong offset!");
