#pragma once

 

// Package: SkillTree_SkillIconPassive

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SkillTree_SkillIconPassive.SkillTree_SkillIconPassive_C.ExecuteUbergraph_SkillTree_SkillIconPassive
// 0x0004 (0x0004 - 0x0000)
struct SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive) == 0x000004, "Wrong alignment on SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive");
static_assert(sizeof(SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive) == 0x000004, "Wrong size on SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive");
static_assert(offsetof(SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive, EntryPoint) == 0x000000, "Member 'SkillTree_SkillIconPassive_C_ExecuteUbergraph_SkillTree_SkillIconPassive::EntryPoint' has a wrong offset!");

// Function SkillTree_SkillIconPassive.SkillTree_SkillIconPassive_C.SetEquipmentIconVisibility
// 0x0005 (0x0005 - 0x0000)
struct SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility final
{
public:
	bool                                          InIsVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility) == 0x000001, "Wrong alignment on SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility");
static_assert(sizeof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility) == 0x000005, "Wrong size on SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility");
static_assert(offsetof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility, InIsVisible) == 0x000000, "Member 'SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility::InIsVisible' has a wrong offset!");
static_assert(offsetof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility, Temp_bool_Variable) == 0x000001, "Member 'SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility, Temp_byte_Variable) == 0x000002, "Member 'SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility, K2Node_Select_Default) == 0x000004, "Member 'SkillTree_SkillIconPassive_C_SetEquipmentIconVisibility::K2Node_Select_Default' has a wrong offset!");

}

