#pragma once

 

// Package: SkillInfoForBattleCordeEdit

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.ExecuteUbergraph_SkillInfoForBattleCordeEdit
// 0x0140 (0x0140 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8271[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8272[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8273[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8274[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8275[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8276[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8277[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoIconForBattleImagine_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Battle_Imagine; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8278[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8279[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsEnabled;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_827A[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_827B[0x1];                                     // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkillInfoIconForTacticalSkill_C*> K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkillInfoIconForTacticalSkill_C*> K2Node_MakeArray_Array_1;                          // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSubPaletteReleased_OutIsReleased;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_827C[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHorizontalBox*>                 K2Node_MakeArray_Array_2;                          // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_827D[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBox*                         CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_827E[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_827F[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoIconForTacticalSkill_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8280[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit) == 0x000008, "Wrong alignment on SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit) == 0x000140, "Wrong size on SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, EntryPoint) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_int_Variable) == 0x000004, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_byte_Variable) == 0x000008, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_byte_Variable_1) == 0x000010, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_int_Variable_1) == 0x000014, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Add_IntInt_ReturnValue_2) == 0x000020, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_int_Array_Index_Variable) == 0x000024, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_Event_IsDesignTime) == 0x000028, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_bool_Variable) == 0x000029, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetChildrenCount_ReturnValue) == 0x00002C, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_MakeStruct_Margin) == 0x000038, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, Temp_int_Variable_2) == 0x000048, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_IsValid_ReturnValue_1) == 0x00004C, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Greater_IntInt_ReturnValue) == 0x00004D, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetChildAt_ReturnValue) == 0x000050, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000058, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Add_IntInt_ReturnValue_3) == 0x000064, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetChildAt_ReturnValue_1) == 0x000068, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_DynamicCast_AsSkill_Info_Icon_for_Battle_Imagine) == 0x000078, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_DynamicCast_AsSkill_Info_Icon_for_Battle_Imagine' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000084, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette) == 0x000088, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00008C, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000090, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_CustomEvent_InIsEnabled) == 0x000091, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_CustomEvent_InIsEnabled' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_Select_Default) == 0x000092, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_Event_Animation) == 0x000098, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x0000A0, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A4, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000A5, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_BooleanAND_ReturnValue) == 0x0000A6, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_MakeArray_Array) == 0x0000A8, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_MakeArray_Array_1) == 0x0000B8, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000C8, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetPosition_ReturnValue) == 0x0000D0, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000D8, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetPosition_ReturnValue_1) == 0x0000E0, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_IsSubPaletteReleased_OutIsReleased) == 0x0000E8, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_IsSubPaletteReleased_OutIsReleased' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_MakeArray_Array_2) == 0x0000F0, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Array_Get_Item) == 0x000108, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_IsValid_ReturnValue_4) == 0x000111, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetChildAt_ReturnValue_2) == 0x000118, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_GetChildrenCount_ReturnValue_2) == 0x000120, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_GetChildrenCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill) == 0x000128, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, K2Node_DynamicCast_bSuccess_1) == 0x000130, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000134, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000138, "Member 'SkillInfoForBattleCordeEdit_C_ExecuteUbergraph_SkillInfoForBattleCordeEdit::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_OnAnimationFinished) == 0x000008, "Wrong alignment on SkillInfoForBattleCordeEdit_C_OnAnimationFinished");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_OnAnimationFinished) == 0x000008, "Wrong size on SkillInfoForBattleCordeEdit_C_OnAnimationFinished");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_OnAnimationFinished, Animation) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.SetUIBlockerMostFrontEnable
// 0x0001 (0x0001 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable) == 0x000001, "Wrong alignment on SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable) == 0x000001, "Wrong size on SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable, InIsEnabled) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_SetUIBlockerMostFrontEnable::InIsEnabled' has a wrong offset!");

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	bool                                          bInSwitchToSubSkillPalette;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000001, "Wrong alignment on SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000001, "Wrong size on SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, bInSwitchToSubSkillPalette) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_BndEvt__SkillInfoForBattleCordeEdit_SkillPaletteFrontBackSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::bInSwitchToSubSkillPalette' has a wrong offset!");

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_PreConstruct) == 0x000001, "Wrong alignment on SkillInfoForBattleCordeEdit_C_PreConstruct");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_PreConstruct) == 0x000001, "Wrong size on SkillInfoForBattleCordeEdit_C_PreConstruct");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.Setup
// 0x0040 (0x0040 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_Setup final
{
public:
	TArray<int32>                                 InTacticalSkillIds;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 InRegularSkillIds;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         InULTSkillId;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8281[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         InBattleImagineUniqueIds;                          // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          InSetupByCurrEquip;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  InClassType;                                       // 0x0039(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_Setup) == 0x000008, "Wrong alignment on SkillInfoForBattleCordeEdit_C_Setup");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_Setup) == 0x000040, "Wrong size on SkillInfoForBattleCordeEdit_C_Setup");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_Setup, InTacticalSkillIds) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_Setup::InTacticalSkillIds' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_Setup, InRegularSkillIds) == 0x000010, "Member 'SkillInfoForBattleCordeEdit_C_Setup::InRegularSkillIds' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_Setup, InULTSkillId) == 0x000020, "Member 'SkillInfoForBattleCordeEdit_C_Setup::InULTSkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_Setup, InBattleImagineUniqueIds) == 0x000028, "Member 'SkillInfoForBattleCordeEdit_C_Setup::InBattleImagineUniqueIds' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_Setup, InSetupByCurrEquip) == 0x000038, "Member 'SkillInfoForBattleCordeEdit_C_Setup::InSetupByCurrEquip' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_Setup, InClassType) == 0x000039, "Member 'SkillInfoForBattleCordeEdit_C_Setup::InClassType' has a wrong offset!");

// Function SkillInfoForBattleCordeEdit.SkillInfoForBattleCordeEdit_C.SetupTacticalSkill
// 0x02A8 (0x02A8 - 0x0000)
struct SkillInfoForBattleCordeEdit_C_SetupTacticalSkill final
{
public:
	TArray<int32>                                 InTacticalSkillIds;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          InSetupByCurrEquip;                                // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InIsSubPaletteReleased;                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsSubPaletteReleased;                         // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsSkillMastery;                               // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         LocalSkillLevel;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBSkillDataMasterData                 LocalSkillDataMasterData;                          // 0x0018(0x0058)(Edit, BlueprintVisible)
	bool                                          LocalSetupByCurrEquip;                             // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8282[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalDirtySkillId;                                 // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSlotId;                                       // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8283[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LocalTacticalSkillIdsForSubPalette;                // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LocalTacticalSkillIds;                             // 0x0090(0x0010)(Edit, BlueprintVisible)
	class USkillInfoIconForTacticalSkill_C*       LocalSkillInfoIcon;                                // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillId;                                      // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8284[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   LocalMasterDataManager;                            // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8285[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8286[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue;             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_1;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_2;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_3;           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8287[0x3];                                     // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentSkillLevel_ReturnValue;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8288[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassLevelFromClassType_ReturnValue;   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillLevelFromClassLevel_bIsValid;     // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8289[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillLevelFromClassLevel_OutSkillLevel; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped; // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBSkillAbilityType                           CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType; // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_828A[0x1];                                     // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_828B[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindSkillDataMaster_bIsValid;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_828C[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataMaster_SkillDataMaster;      // 0x0120(0x0058)()
	bool                                          Temp_bool_Variable_3;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_828D[0x2];                                     // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentSkillLevel_ReturnValue_1;       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_828E[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassLevelFromClassType_ReturnValue_1; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillLevelFromClassLevel_bIsValid_1;   // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_828F[0x2];                                     // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillLevelFromClassLevel_OutSkillLevel_1; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped_1; // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBSkillAbilityType                           CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType_1; // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8290[0x2];                                     // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId_1; // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_4;           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8291[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_5;           // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_6;           // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_7;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_Select_Default_4;                           // 0x01D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindSkillDataMaster_bIsValid_1;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8292[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataMaster_SkillDataMaster_1;    // 0x01F0(0x0058)()
	bool                                          Temp_bool_Variable_6;                              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8293[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_5;                           // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillInfoIconForTacticalSkill_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill; // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8294[0x1];                                     // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8295[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_6;                           // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8296[0x4];                                     // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoIconForTacticalSkill_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill_1; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8297[0x3];                                     // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8298[0x5];                                     // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill) == 0x000008, "Wrong alignment on SkillInfoForBattleCordeEdit_C_SetupTacticalSkill");
static_assert(sizeof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill) == 0x0002A8, "Wrong size on SkillInfoForBattleCordeEdit_C_SetupTacticalSkill");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, InTacticalSkillIds) == 0x000000, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::InTacticalSkillIds' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, InSetupByCurrEquip) == 0x000010, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::InSetupByCurrEquip' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, InIsSubPaletteReleased) == 0x000011, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::InIsSubPaletteReleased' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, LocalIsSubPaletteReleased) == 0x000012, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::LocalIsSubPaletteReleased' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, LocalIsSkillMastery) == 0x000013, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::LocalIsSkillMastery' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, LocalSkillLevel) == 0x000014, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::LocalSkillLevel' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, LocalSkillDataMasterData) == 0x000018, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::LocalSkillDataMasterData' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, LocalSetupByCurrEquip) == 0x000070, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::LocalSetupByCurrEquip' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleCordeEdit_C_SetupTacticalSkill, LocalDirtySkillId) == 0x000074, "Member 'SkillInfoForBattleCordeEdit_C_SetupTacticalSkill::LocalDirtySkillId' has a wrong offset!");
