#pragma once

 

// Package: SkillStatusDescAndListForBattleSet

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "E_BattleSetInfoType_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SkillStatusDescAndListForBattleSet.SkillStatusDescAndListForBattleSet_C.OnSkillInfoItemSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature final
{
public:
	int32                                         InEquippedSkillId;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSelectedSkillId;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature) == 0x000004, "Wrong alignment on SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature");
static_assert(sizeof(SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature) == 0x000008, "Wrong size on SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature, InEquippedSkillId) == 0x000000, "Member 'SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature::InEquippedSkillId' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature, InSelectedSkillId) == 0x000004, "Member 'SkillStatusDescAndListForBattleSet_C_OnSkillInfoItemSelected__DelegateSignature::InSelectedSkillId' has a wrong offset!");

// Function SkillStatusDescAndListForBattleSet.SkillStatusDescAndListForBattleSet_C.OnLeftSideParameterStatusUpdated__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature final
{
public:
	E_BattleSetInfoType                           InBattleSetInfoType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIncludesClassInfoUpdate;                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature) == 0x000001, "Wrong alignment on SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature");
static_assert(sizeof(SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature) == 0x000002, "Wrong size on SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature, InBattleSetInfoType) == 0x000000, "Member 'SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature::InBattleSetInfoType' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature, InIncludesClassInfoUpdate) == 0x000001, "Member 'SkillStatusDescAndListForBattleSet_C_OnLeftSideParameterStatusUpdated__DelegateSignature::InIncludesClassInfoUpdate' has a wrong offset!");

// Function SkillStatusDescAndListForBattleSet.SkillStatusDescAndListForBattleSet_C.ExecuteUbergraph_SkillStatusDescAndListForBattleSet
// 0x04E8 (0x04E8 - 0x0000)
struct SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423C[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InSkillId_1;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InDisarm_1;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423D[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_RetCode_1;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_423E[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0018(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_423F[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4240[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4241[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4242[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerArtsComponent*                 CallFunc_GetPlayerArtsComponent_ReturnValue;       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4243[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4244[0x6];                                     // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerArtsComponent*                 CallFunc_GetPlayerArtsComponent_ReturnValue_1;     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_3;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestEquipPassiveSkill_ReturnValue;     // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestUnequipPassiveSkill_ReturnValue;   // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4245[0x1];                                     // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InSkillId;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InDisarm;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4246[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue_1;            // 0x0108(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4247[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0120(0x0018)()
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue_1;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4248[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0158(0x0018)()
	int32                                         K2Node_CustomEvent_RetCode;                        // 0x0170(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsArtsAssetLoadRequested;       // 0x0174(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4249[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RetCode, bool IsArtsAssetLoadRequested)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_2;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RetCode, bool IsArtsAssetLoadRequested)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424A[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerArtsComponent*                 CallFunc_GetPlayerArtsComponent_ReturnValue_2;     // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424B[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_3;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424C[0x6];                                     // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerArtsComponent*                 CallFunc_GetPlayerArtsComponent_ReturnValue_3;     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424D[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RetCode, bool IsArtsAssetLoadRequested)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_InSelectedSkillTypeId;  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_InSelectedSkillId;      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped; // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBSkillAbilityType                           CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType; // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424E[0x2];                                     // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_424F[0x6];                                     // 0x0202(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckIfTacticalSkillOrAbilityIsActive_ReturnValue; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4250[0x7];                                     // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0220(0x0018)()
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSubPaletteReleased_ReturnValue;         // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues K2Node_CustomEvent_InUnchangeableRetValue;         // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BattleSetInfoType                           K2Node_CustomEvent_InBattleSetInfoType;            // 0x023B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4251[0x3];                                     // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4252[0x4];                                     // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4253[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0260(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4254[0x4];                                     // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeSkill_ReturnValue;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4255[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0298(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4256[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02B8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4257[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0300(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsBlock_1;                    // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4258[0x1];                                     // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x030C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_4;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues CallFunc_IsCharacterEquipsOrSkillsOrCostumesChangeable_ReturnValue; // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsBlock;                      // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x031B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_InPressedSwitchBtnId;   // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0320(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4259[0x3];                                     // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x0328(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x032F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425A[0x2];                                     // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x0334(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_5;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBPlayerArtsComponent*                 CallFunc_GetPlayerArtsComponent_ReturnValue_4;     // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425B[0x2];                                     // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x034C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x036C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsCharaDetailedStatusOpen_OutIsOpen;      // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425C[0x2];                                     // 0x037E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_7;                               // 0x0380(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x0384(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425D[0x3];                                     // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_9;                               // 0x038C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_6;      // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues CallFunc_IsCharacterEquipsOrSkillsOrCostumesChangeable_ReturnValue_1; // 0x039A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425E[0x1];                                     // 0x039B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x039C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InNewEquippedSkillId;           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsDisarm;                     // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHideWindowAnimePlaying_OutIsPlaying;    // 0x03A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425F[0x2];                                     // 0x03A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHideWindowAnimePlaying_OutIsPlaying_1;  // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x03AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHideWindowAnimePlaying_OutIsPlaying_2;  // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x03B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4260[0x5];                                     // 0x03B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoItemForBattleSet_C*           K2Node_ComponentBoundEvent_InSelectedInfoItem;     // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4261[0x3];                                     // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillId_OutSkillId;                    // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BattleSetInfoType                           Temp_byte_Variable;                                // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_BattleSetInfoType                           K2Node_ComponentBoundEvent_InInfoType;             // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4262[0x1];                                     // 0x03CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_InSkillId;              // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_5;                           // 0x03D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4263[0x4];                                     // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_5;           // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4264[0x7];                                     // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x03F0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(int32 RetCode, bool IsArtsAssetLoadRequested)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x040C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4265[0x3];                                     // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 RetCode)>                K2Node_CreateDelegate_OutputDelegate_11;           // 0x0420(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_11;                              // 0x0430(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4266[0x3];                                     // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_12;                              // 0x0438(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x043C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x0440(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4267[0x3];                                     // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBCharacterEquipsOrSkillsOrCostumesChangeableRetValues Temp_byte_Variable_1;                              // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4268[0x2];                                     // 0x0452(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_6;                           // 0x0454(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_6;           // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0468(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0480(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x04C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x04D0(0x0018)()
};
static_assert(alignof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet) == 0x000008, "Wrong alignment on SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet");
static_assert(sizeof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet) == 0x0004E8, "Wrong size on SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, EntryPoint) == 0x000000, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, Temp_bool_Variable) == 0x000005, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_InSkillId_1) == 0x000008, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_InSkillId_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_InDisarm_1) == 0x00000C, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_InDisarm_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, Temp_bool_Variable_1) == 0x00000D, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_RetCode_1) == 0x000010, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_RetCode_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBRetMessage_ReturnValue) == 0x000018, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetTextFromAsset_ReturnValue) == 0x000068, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, Temp_int_Variable) == 0x000090, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBPlayerController_ReturnValue) == 0x0000A8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBPlayerCharacter_ReturnValue) == 0x0000B0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_1) == 0x0000B9, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetPlayerArtsComponent_ReturnValue) == 0x0000C0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetPlayerArtsComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_2) == 0x0000C8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_3) == 0x0000C9, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000CA, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBPlayerController_ReturnValue_1) == 0x0000D0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000D8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_4) == 0x0000D9, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetPlayerArtsComponent_ReturnValue_1) == 0x0000E0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetPlayerArtsComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000E8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_5) == 0x0000F8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_RequestEquipPassiveSkill_ReturnValue) == 0x0000F9, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_RequestEquipPassiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_RequestUnequipPassiveSkill_ReturnValue) == 0x0000FA, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_RequestUnequipPassiveSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_InSkillId) == 0x0000FC, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_InSkillId' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_InDisarm) == 0x000100, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_InDisarm' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBRetMessage_ReturnValue_1) == 0x000108, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBRetMessage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, Temp_int_Variable_1) == 0x000118, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000120, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBPlayerCharacter_ReturnValue_1) == 0x000138, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_6) == 0x000140, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000148, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000158, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_RetCode) == 0x000170, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_RetCode' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CustomEvent_IsArtsAssetLoadRequested) == 0x000174, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CustomEvent_IsArtsAssetLoadRequested' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate_4) == 0x000178, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBPlayerController_ReturnValue_2) == 0x000188, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate_5) == 0x000190, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_7) == 0x0001A0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetPlayerArtsComponent_ReturnValue_2) == 0x0001A8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetPlayerArtsComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_8) == 0x0001B0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetSBPlayerController_ReturnValue_3) == 0x0001B8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetSBPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0001C0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_9) == 0x0001C1, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetPlayerArtsComponent_ReturnValue_3) == 0x0001C8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetPlayerArtsComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_IsValid_ReturnValue_10) == 0x0001D0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001D4, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_ComponentBoundEvent_InSelectedSkillTypeId) == 0x0001E4, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_ComponentBoundEvent_InSelectedSkillTypeId' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, K2Node_ComponentBoundEvent_InSelectedSkillId) == 0x0001E8, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::K2Node_ComponentBoundEvent_InSelectedSkillId' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped) == 0x0001EC, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType) == 0x0001ED, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId) == 0x0001F0, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId' has a wrong offset!");
static_assert(offsetof(SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet, Temp_int_Variable_2) == 0x0001F4, "Member 'SkillStatusDescAndListForBattleSet_C_ExecuteUbergraph_SkillStatusDescAndListForBattleSet::Temp_int_Variable_2' has a wrong offset!");
