#pragma once

 

// Package: SkillInfoForBattleSetTop

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.OnTacticalSkillIconPressed__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature final
{
public:
	ESkillActionPosition                          InTacticalSkillSAP;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSkillId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSkillLevel;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature) == 0x000004, "Wrong alignment on SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature");
static_assert(sizeof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature) == 0x00000C, "Wrong size on SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature, InTacticalSkillSAP) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature::InTacticalSkillSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature, InSkillId) == 0x000004, "Member 'SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature::InSkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature, InSkillLevel) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_OnTacticalSkillIconPressed__DelegateSignature::InSkillLevel' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.OnBattleImagineIconPresssed__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature final
{
public:
	ESkillActionPosition                          InBattleImagineSAP;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_665D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InBattleImagineUniqueId;                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature) == 0x000008, "Wrong alignment on SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature");
static_assert(sizeof(SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature) == 0x000018, "Wrong size on SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature, InBattleImagineSAP) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature::InBattleImagineSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature, InBattleImagineUniqueId) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_OnBattleImagineIconPresssed__DelegateSignature::InBattleImagineUniqueId' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.ExecuteUbergraph_SkillInfoForBattleSetTop
// 0x00E0 (0x00E0 - 0x0000)
struct SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665E[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_665F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6660[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6661[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          K2Node_ComponentBoundEvent_InBattleImagineSAP_1;   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6662[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_InBattleImagineUniqueId_1; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESkillActionPosition                          K2Node_ComponentBoundEvent_InBattleImagineSAP;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6663[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_InBattleImagineUniqueId; // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_InIsEnabled;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6664[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0080(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6665[0x1];                                     // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkillInfoIconForTacticalSkill_C*> K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USkillInfoIconForTacticalSkill_C*> K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue_1;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSubPaletteReleased_ReturnValue;         // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          K2Node_CustomEvent_InTacticalSkillSAP;             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6666[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InSkillId;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_InSkillLevel;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop) == 0x000008, "Wrong alignment on SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop");
static_assert(sizeof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop) == 0x0000E0, "Wrong size on SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, EntryPoint) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, Temp_byte_Variable) == 0x000004, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_Event_IsDesignTime) == 0x000005, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, Temp_int_Variable) == 0x000014, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_MakeStruct_Margin) == 0x000018, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000038, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000041, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, Temp_bool_Variable) == 0x000048, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_ComponentBoundEvent_InBattleImagineSAP_1) == 0x000049, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_ComponentBoundEvent_InBattleImagineSAP_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_ComponentBoundEvent_InBattleImagineUniqueId_1) == 0x000050, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_ComponentBoundEvent_InBattleImagineUniqueId_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_ComponentBoundEvent_InBattleImagineSAP) == 0x000060, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_ComponentBoundEvent_InBattleImagineSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_ComponentBoundEvent_InBattleImagineUniqueId) == 0x000068, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_ComponentBoundEvent_InBattleImagineUniqueId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette) == 0x000078, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_ComponentBoundEvent_bInSwitchToSubSkillPalette' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_CustomEvent_InIsEnabled) == 0x000079, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_CustomEvent_InIsEnabled' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_Event_Animation) == 0x000080, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000088, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00008C, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00008D, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_BooleanAND_ReturnValue) == 0x00008E, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_MakeArray_Array) == 0x000090, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000B0, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000B8, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_GetPosition_ReturnValue) == 0x0000C0, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_GetPosition_ReturnValue_1) == 0x0000C8, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_GetPosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, Temp_byte_Variable_1) == 0x0000D0, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_GetClassType_ReturnValue) == 0x0000D1, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_Select_Default) == 0x0000D2, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, CallFunc_IsSubPaletteReleased_ReturnValue) == 0x0000D3, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::CallFunc_IsSubPaletteReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_CustomEvent_InTacticalSkillSAP) == 0x0000D4, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_CustomEvent_InTacticalSkillSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_CustomEvent_InSkillId) == 0x0000D8, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_CustomEvent_InSkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop, K2Node_CustomEvent_InSkillLevel) == 0x0000DC, "Member 'SkillInfoForBattleSetTop_C_ExecuteUbergraph_SkillInfoForBattleSetTop::K2Node_CustomEvent_InSkillLevel' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.OnTacticalSkillIconSelected
// 0x000C (0x000C - 0x0000)
struct SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected final
{
public:
	ESkillActionPosition                          InTacticalSkillSAP;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6667[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSkillId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSkillLevel;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected) == 0x000004, "Wrong alignment on SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected");
static_assert(sizeof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected) == 0x00000C, "Wrong size on SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected, InTacticalSkillSAP) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected::InTacticalSkillSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected, InSkillId) == 0x000004, "Member 'SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected::InSkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected, InSkillLevel) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_OnTacticalSkillIconSelected::InSkillLevel' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct SkillInfoForBattleSetTop_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_OnAnimationFinished) == 0x000008, "Wrong alignment on SkillInfoForBattleSetTop_C_OnAnimationFinished");
static_assert(sizeof(SkillInfoForBattleSetTop_C_OnAnimationFinished) == 0x000008, "Wrong size on SkillInfoForBattleSetTop_C_OnAnimationFinished");
static_assert(offsetof(SkillInfoForBattleSetTop_C_OnAnimationFinished, Animation) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.SetUIBlockerMostFrontEnable
// 0x0001 (0x0001 - 0x0000)
struct SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable final
{
public:
	bool                                          InIsEnabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable) == 0x000001, "Wrong alignment on SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable");
static_assert(sizeof(SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable) == 0x000001, "Wrong size on SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable, InIsEnabled) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_SetUIBlockerMostFrontEnable::InIsEnabled' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature final
{
public:
	bool                                          bInSwitchToSubSkillPalette;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000001, "Wrong alignment on SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(sizeof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature) == 0x000001, "Wrong size on SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature");
static_assert(offsetof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature, bInSwitchToSubSkillPalette) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_SkillPaletteSwitchBtn_K2Node_ComponentBoundEvent_0_OnPressed__DelegateSignature::bInSwitchToSubSkillPalette' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature final
{
public:
	ESkillActionPosition                          InBattleImagineSAP;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6668[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InBattleImagineUniqueId;                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature) == 0x000008, "Wrong alignment on SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature");
static_assert(sizeof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature) == 0x000018, "Wrong size on SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature");
static_assert(offsetof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature, InBattleImagineSAP) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature::InBattleImagineSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature, InBattleImagineUniqueId) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine2a_K2Node_ComponentBoundEvent_7_OnBattleImagineIconPressed__DelegateSignature::InBattleImagineUniqueId' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature final
{
public:
	ESkillActionPosition                          InBattleImagineSAP;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6669[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InBattleImagineUniqueId;                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature) == 0x000008, "Wrong alignment on SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature");
static_assert(sizeof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature) == 0x000018, "Wrong size on SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature");
static_assert(offsetof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature, InBattleImagineSAP) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature::InBattleImagineSAP' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature, InBattleImagineUniqueId) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_BndEvt__SkillInfoForBattleSetTop_BattleImagine1a_K2Node_ComponentBoundEvent_6_OnBattleImagineIconPressed__DelegateSignature::InBattleImagineUniqueId' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SkillInfoForBattleSetTop_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_PreConstruct) == 0x000001, "Wrong alignment on SkillInfoForBattleSetTop_C_PreConstruct");
static_assert(sizeof(SkillInfoForBattleSetTop_C_PreConstruct) == 0x000001, "Wrong size on SkillInfoForBattleSetTop_C_PreConstruct");
static_assert(offsetof(SkillInfoForBattleSetTop_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.SetupTacticalSkill
// 0x0120 (0x0120 - 0x0000)
struct SkillInfoForBattleSetTop_C_SetupTacticalSkill final
{
public:
	int32                                         LocalDirtySkillId;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSlotId;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillInfoIconForTacticalSkill_C*       LocalSkillInfoIcon;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillId;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_666A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   LocalMasterDataManager;                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSubPaletteReleased_ReturnValue;         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentSkillLevel_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped; // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBSkillAbilityType                           CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType; // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_666B[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666C[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillMasteryParam_IsExists;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666D[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillMasteryParam                   CallFunc_GetSkillMasteryParam_ReturnValue;         // 0x0054(0x0008)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkillInfoIconForTacticalSkill_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666E[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindSkillDataDataBySkillId_IsExists;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_666F[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataDataBySkillId_ReturnValue;   // 0x0080(0x0058)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6670[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_1;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6671[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6672[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6673[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoIconForTacticalSkill_C*       K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill_1; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6674[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SkillInfoForBattleSetTop_C_SetupTacticalSkill) == 0x000008, "Wrong alignment on SkillInfoForBattleSetTop_C_SetupTacticalSkill");
static_assert(sizeof(SkillInfoForBattleSetTop_C_SetupTacticalSkill) == 0x000120, "Wrong size on SkillInfoForBattleSetTop_C_SetupTacticalSkill");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, LocalDirtySkillId) == 0x000000, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::LocalDirtySkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, LocalSlotId) == 0x000004, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::LocalSlotId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, LocalSkillInfoIcon) == 0x000008, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::LocalSkillInfoIcon' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, LocalSkillId) == 0x000010, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::LocalSkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, LocalMasterDataManager) == 0x000018, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::LocalMasterDataManager' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, Temp_int_Variable) == 0x000020, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetEquipedArtsId_ReturnValue) == 0x000024, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetEquipedArtsId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, Temp_bool_Variable) == 0x00002C, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetClassType_ReturnValue) == 0x00002D, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_IsSubPaletteReleased_ReturnValue) == 0x00002E, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_IsSubPaletteReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_IsValid_ReturnValue) == 0x00002F, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetChildrenCount_ReturnValue) == 0x000030, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetCurrentSkillLevel_ReturnValue) == 0x000038, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetCurrentSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped) == 0x00003C, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType) == 0x00003D, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId) == 0x000040, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, K2Node_Select_Default) == 0x000044, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, Temp_int_Variable_1) == 0x00004C, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetSkillMasteryParam_IsExists) == 0x000050, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetSkillMasteryParam_IsExists' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetSkillMasteryParam_ReturnValue) == 0x000054, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetSkillMasteryParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetChildAt_ReturnValue) == 0x000060, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill) == 0x000068, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000072, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_Add_IntInt_ReturnValue_2) == 0x000074, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_FindSkillDataDataBySkillId_IsExists) == 0x000078, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_FindSkillDataDataBySkillId_IsExists' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_FindSkillDataDataBySkillId_ReturnValue) == 0x000080, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_FindSkillDataDataBySkillId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetEquipedArtsId_ReturnValue_1) == 0x0000DC, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetEquipedArtsId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetMasterDataManager_IsValid) == 0x0000E0, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetMasterDataManager_ReturnValue) == 0x0000E8, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_IsValid_ReturnValue_2) == 0x0000F0, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetChildAt_ReturnValue_1) == 0x0000F8, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_GetChildrenCount_ReturnValue_1) == 0x000100, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill_1) == 0x000108, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::K2Node_DynamicCast_AsSkill_Info_Icon_for_Tactical_Skill_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000114, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000118, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillInfoForBattleSetTop_C_SetupTacticalSkill, CallFunc_IsValid_ReturnValue_3) == 0x000119, "Member 'SkillInfoForBattleSetTop_C_SetupTacticalSkill::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function SkillInfoForBattleSetTop.SkillInfoForBattleSetTop_C.SetupMainSubULTSkill
// 0x0268 (0x0268 - 0x0000)
struct SkillInfoForBattleSetTop_C_SetupMainSubULTSkill final
{
public:
	bool                                          LocalSkillMasteryParamFounded;                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalSkillDataMasterFounded;                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalIsMasterySkill;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  LocalClassType;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillLevel;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalSkillId;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6675[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LocalSkillDataTableRowNames;                       // 0x0010(0x0010)(Edit, BlueprintVisible)
	class UDataTable*                             LocalSkillDataTable;                               // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0030(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBClassType                                  CallFunc_GetPlayerClassType_ClassType;             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6676[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
