#pragma once

 

// Package: SkillListForBattleSet

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "E_BattleSetInfoType_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SkillListForBattleSet.SkillListForBattleSet_C.OnInfoItemSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature final
{
public:
	class USkillInfoItemForBattleSet_C*           InSelectedInfoItem;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature) == 0x000008, "Wrong alignment on SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature");
static_assert(sizeof(SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature) == 0x000008, "Wrong size on SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature");
static_assert(offsetof(SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature, InSelectedInfoItem) == 0x000000, "Member 'SkillListForBattleSet_C_OnInfoItemSelected__DelegateSignature::InSelectedInfoItem' has a wrong offset!");

// Function SkillListForBattleSet.SkillListForBattleSet_C.OnSkillChangeBtnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature final
{
public:
	E_BattleSetInfoType                           InInfoType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSkillId;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature) == 0x000004, "Wrong alignment on SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature");
static_assert(sizeof(SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature) == 0x000008, "Wrong size on SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature");
static_assert(offsetof(SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature, InInfoType) == 0x000000, "Member 'SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature::InInfoType' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature, InSkillId) == 0x000004, "Member 'SkillListForBattleSet_C_OnSkillChangeBtnPressed__DelegateSignature::InSkillId' has a wrong offset!");

// Function SkillListForBattleSet.SkillListForBattleSet_C.ExecuteUbergraph_SkillListForBattleSet
// 0x0080 (0x0080 - 0x0000)
struct SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerArtsType                             Temp_byte_Variable;                                // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505E[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoItemForBattleSet_C*           K2Node_DynamicCast_AsSkill_Info_Item_for_Battle_Set; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_505F[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5060[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoItemForBattleSet_C*           K2Node_CustomEvent_InInfoItem;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USkillInfoItemForBattleSet_C* InInfoItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5061[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSkillId_OutSkillId;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped; // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBSkillAbilityType                           CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType; // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBPlayerArtsType                             Temp_byte_Variable_1;                              // 0x007A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerArtsType                             K2Node_Select_Default_1;                           // 0x007B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquipedArtsId_ReturnValue_1;           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet) == 0x000008, "Wrong alignment on SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet");
static_assert(sizeof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet) == 0x000080, "Wrong size on SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, EntryPoint) == 0x000000, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::EntryPoint' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, Temp_byte_Variable) == 0x000004, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, Temp_int_Variable) == 0x000008, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, Temp_int_Variable_1) == 0x00000C, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_DynamicCast_AsSkill_Info_Item_for_Battle_Set) == 0x000028, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_DynamicCast_AsSkill_Info_Item_for_Battle_Set' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetChildrenCount_ReturnValue) == 0x000038, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_Subtract_IntInt_ReturnValue) == 0x00003C, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_CustomEvent_InInfoItem) == 0x000048, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_CustomEvent_InInfoItem' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetSkillId_OutSkillId) == 0x000064, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetSkillId_OutSkillId' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, Temp_bool_Variable) == 0x000068, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000069, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped) == 0x00006A, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetEquipedActiveArtsAbility_OutIsActiveAbilityEquiped' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType) == 0x00006B, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilityType' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId) == 0x00006C, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetEquipedActiveArtsAbility_OutEquipedActiveAbilitySkillId' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetEquipedArtsId_ReturnValue) == 0x000070, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetEquipedArtsId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_Select_Default) == 0x000074, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000079, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, Temp_byte_Variable_1) == 0x00007A, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, K2Node_Select_Default_1) == 0x00007B, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet, CallFunc_GetEquipedArtsId_ReturnValue_1) == 0x00007C, "Member 'SkillListForBattleSet_C_ExecuteUbergraph_SkillListForBattleSet::CallFunc_GetEquipedArtsId_ReturnValue_1' has a wrong offset!");

// Function SkillListForBattleSet.SkillListForBattleSet_C.OnSkillInfoItemPressed
// 0x0008 (0x0008 - 0x0000)
struct SkillListForBattleSet_C_OnSkillInfoItemPressed final
{
public:
	class USkillInfoItemForBattleSet_C*           InInfoItem;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillListForBattleSet_C_OnSkillInfoItemPressed) == 0x000008, "Wrong alignment on SkillListForBattleSet_C_OnSkillInfoItemPressed");
static_assert(sizeof(SkillListForBattleSet_C_OnSkillInfoItemPressed) == 0x000008, "Wrong size on SkillListForBattleSet_C_OnSkillInfoItemPressed");
static_assert(offsetof(SkillListForBattleSet_C_OnSkillInfoItemPressed, InInfoItem) == 0x000000, "Member 'SkillListForBattleSet_C_OnSkillInfoItemPressed::InInfoItem' has a wrong offset!");

// Function SkillListForBattleSet.SkillListForBattleSet_C.InitList
// 0x0790 (0x0790 - 0x0000)
struct SkillListForBattleSet_C_InitList final
{
public:
	E_BattleSetInfoType                           InBattleSetInfoType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBClassType                                  InSkillClassType;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5062[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSkillSlotId;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InClassAbilityTypeId;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalListItemCnt;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsClassAbility;                               // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5063[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalClassName;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   LocalHeadingTextB;                                 // 0x0028(0x0018)(Edit, BlueprintVisible)
	class FText                                   LocalNoSkillMsgText;                               // 0x0040(0x0018)(Edit, BlueprintVisible)
	class FText                                   LocalSkillTypeText;                                // 0x0058(0x0018)(Edit, BlueprintVisible)
	int32                                         LocalLoopId;                                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5064[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoItemForBattleSet_C*           LocalInfoItem;                                     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalColumn;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalRow;                                          // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalColumnNumMax;                                 // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalListCapacity;                                 // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5065[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerArtsType                             Temp_byte_Variable_2;                              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5066[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBPlayerArtsType                             Temp_byte_Variable_3;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5067[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkillInfoItemForBattleSet_C*           CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5068[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5069[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_5;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_506A[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	E_BattleSetInfoType                           Temp_byte_Variable_4;                              // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_506B[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBPlayerPassiveSkillData              CallFunc_Array_Get_Item;                           // 0x00E8(0x00B8)()
	struct FSBPlayerSkillData                     CallFunc_Array_Get_Item_1;                         // 0x01A0(0x0180)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_506C[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x0330(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_506D[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBPlayerPassiveSkillData>      CallFunc_GetClassAbilityDatas_OutDataArray;        // 0x0338(0x0010)(ReferenceParm)
	TArray<struct FSBPlayerSkillData>             CallFunc_GetTacticalSkillDatas_OutDataArray;       // 0x0348(0x0010)(ReferenceParm)
	TDelegate<void(class USkillInfoItemForBattleSet_C* InInfoItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0368(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0380(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x03C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x03D8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0428(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetClassNameText_ReturnValue;             // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0448(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_506E[0x4];                                     // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_506F[0x7];                                     // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0468(0x0018)()
	int32                                         Temp_int_Variable_12;                              // 0x0480(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5070[0x4];                                     // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x04B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x04D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x04E8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0500(0x0018)()
	ESBPlayerArtsType                             Temp_byte_Variable_5;                              // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5071[0x3];                                     // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x051C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0520(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0570(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0580(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x0598(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x05A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x05C0(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0600(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0618(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_5;           // 0x0628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_6;           // 0x0638(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_7;          // 0x0648(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_8;          // 0x0660(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0678(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5072[0x2];                                     // 0x0692(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_13;                              // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBPlayerArtsType                             Temp_byte_Variable_6;                              // 0x0699(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5073[0x6];                                     // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_7;           // 0x06A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_9;          // 0x06B0(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x06C8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x06E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x06F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0708(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_10;         // 0x0718(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5074[0x7];                                     // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0738(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0752(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBPlayerArtsType                             Temp_byte_Variable_7;                              // 0x0753(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0754(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5075[0x3];                                     // 0x0755(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x0758(0x0018)()
	ESBPlayerArtsType                             K2Node_Select_Default_5;                           // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5076[0x2];                                     // 0x0772(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_6;                           // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_7;                           // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0788(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SkillListForBattleSet_C_InitList) == 0x000008, "Wrong alignment on SkillListForBattleSet_C_InitList");
static_assert(sizeof(SkillListForBattleSet_C_InitList) == 0x000790, "Wrong size on SkillListForBattleSet_C_InitList");
static_assert(offsetof(SkillListForBattleSet_C_InitList, InBattleSetInfoType) == 0x000000, "Member 'SkillListForBattleSet_C_InitList::InBattleSetInfoType' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, InSkillClassType) == 0x000001, "Member 'SkillListForBattleSet_C_InitList::InSkillClassType' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, InSkillSlotId) == 0x000004, "Member 'SkillListForBattleSet_C_InitList::InSkillSlotId' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, InClassAbilityTypeId) == 0x000008, "Member 'SkillListForBattleSet_C_InitList::InClassAbilityTypeId' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalListItemCnt) == 0x00000C, "Member 'SkillListForBattleSet_C_InitList::LocalListItemCnt' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalIsClassAbility) == 0x000010, "Member 'SkillListForBattleSet_C_InitList::LocalIsClassAbility' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalClassName) == 0x000018, "Member 'SkillListForBattleSet_C_InitList::LocalClassName' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalHeadingTextB) == 0x000028, "Member 'SkillListForBattleSet_C_InitList::LocalHeadingTextB' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalNoSkillMsgText) == 0x000040, "Member 'SkillListForBattleSet_C_InitList::LocalNoSkillMsgText' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalSkillTypeText) == 0x000058, "Member 'SkillListForBattleSet_C_InitList::LocalSkillTypeText' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalLoopId) == 0x000070, "Member 'SkillListForBattleSet_C_InitList::LocalLoopId' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalInfoItem) == 0x000078, "Member 'SkillListForBattleSet_C_InitList::LocalInfoItem' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalColumn) == 0x000080, "Member 'SkillListForBattleSet_C_InitList::LocalColumn' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalRow) == 0x000084, "Member 'SkillListForBattleSet_C_InitList::LocalRow' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalColumnNumMax) == 0x000088, "Member 'SkillListForBattleSet_C_InitList::LocalColumnNumMax' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, LocalListCapacity) == 0x00008C, "Member 'SkillListForBattleSet_C_InitList::LocalListCapacity' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_bool_Variable) == 0x000090, "Member 'SkillListForBattleSet_C_InitList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable) == 0x000091, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable_1) == 0x000092, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_bool_Variable_1) == 0x000093, "Member 'SkillListForBattleSet_C_InitList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable) == 0x000094, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_bool_Variable_2) == 0x000098, "Member 'SkillListForBattleSet_C_InitList::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_1) == 0x00009C, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_2) == 0x0000A0, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable_2) == 0x0000A4, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable_3) == 0x0000AC, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_bool_Variable_3) == 0x0000B8, "Member 'SkillListForBattleSet_C_InitList::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_3) == 0x0000BC, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_4) == 0x0000C0, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C4, "Member 'SkillListForBattleSet_C_InitList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_5) == 0x0000C8, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_6) == 0x0000CC, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_7) == 0x0000D0, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000D4, "Member 'SkillListForBattleSet_C_InitList::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_8) == 0x0000DC, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_9) == 0x0000E0, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E4, "Member 'SkillListForBattleSet_C_InitList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable_4) == 0x0000E5, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Array_Get_Item_1) == 0x0001A0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Array_Length_ReturnValue) == 0x000320, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_Select_Default) == 0x000324, "Member 'SkillListForBattleSet_C_InitList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Array_Length_ReturnValue_1) == 0x000328, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Greater_IntInt_ReturnValue) == 0x00032C, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_10) == 0x000330, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetClassAbilityDatas_OutDataArray) == 0x000338, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetClassAbilityDatas_OutDataArray' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTacticalSkillDatas_OutDataArray) == 0x000348, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTacticalSkillDatas_OutDataArray' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_CreateDelegate_OutputDelegate) == 0x000358, "Member 'SkillListForBattleSet_C_InitList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue) == 0x000368, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeStruct_FormatArgumentData) == 0x000380, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0003C0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeArray_Array) == 0x0003D8, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeStruct_FormatArgumentData_1) == 0x0003E8, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeArray_Array_1) == 0x000428, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetClassNameText_ReturnValue) == 0x000438, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetClassNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_11) == 0x000448, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue) == 0x000450, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_IsValid_ReturnValue) == 0x000460, "Member 'SkillListForBattleSet_C_InitList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000468, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_12) == 0x000480, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_TextToString_ReturnValue) == 0x000488, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000498, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x0004A8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0004B8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0004D0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Format_ReturnValue) == 0x0004E8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Format_ReturnValue_1) == 0x000500, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable_5) == 0x000518, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_Select_Default_1) == 0x00051C, "Member 'SkillListForBattleSet_C_InitList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeStruct_FormatArgumentData_2) == 0x000520, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_3) == 0x000560, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeArray_Array_2) == 0x000570, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000580, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_4) == 0x000598, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_6) == 0x0005A8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeStruct_FormatArgumentData_3) == 0x0005C0, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_text_Variable) == 0x000600, "Member 'SkillListForBattleSet_C_InitList::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_MakeArray_Array_3) == 0x000618, "Member 'SkillListForBattleSet_C_InitList::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_5) == 0x000628, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_6) == 0x000638, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_7) == 0x000648, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_8) == 0x000660, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Format_ReturnValue_2) == 0x000678, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000690, "Member 'SkillListForBattleSet_C_InitList::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_Select_Default_2) == 0x000691, "Member 'SkillListForBattleSet_C_InitList::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_int_Variable_13) == 0x000694, "Member 'SkillListForBattleSet_C_InitList::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_IsValid_ReturnValue_1) == 0x000698, "Member 'SkillListForBattleSet_C_InitList::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, Temp_byte_Variable_6) == 0x000699, "Member 'SkillListForBattleSet_C_InitList::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_GetTextFromAsset_ReturnValue_7) == 0x0006A0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_GetTextFromAsset_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_9) == 0x0006B0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, K2Node_Select_Default_3) == 0x0006C8, "Member 'SkillListForBattleSet_C_InitList::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Format_ReturnValue_3) == 0x0006E0, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0006F8, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Concat_StrStr_ReturnValue) == 0x000708, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SkillListForBattleSet_C_InitList, CallFunc_Conv_StringToText_ReturnValue_10) == 0x000718, "Member 'SkillListForBattleSet_C_InitList::CallFunc_Conv_StringToText_ReturnValue_10' has a wrong offset!");
