#pragma once

 

// Package: StackBEnhanceImagineIconTypeName

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function StackBEnhanceImagineIconTypeName.StackBEnhanceImagineIconTypeName_C.ExecuteUbergraph_StackBEnhanceImagineIconTypeName
// 0x0004 (0x0004 - 0x0000)
struct StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName) == 0x000004, "Wrong alignment on StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName");
static_assert(sizeof(StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName) == 0x000004, "Wrong size on StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName, EntryPoint) == 0x000000, "Member 'StackBEnhanceImagineIconTypeName_C_ExecuteUbergraph_StackBEnhanceImagineIconTypeName::EntryPoint' has a wrong offset!");

// Function StackBEnhanceImagineIconTypeName.StackBEnhanceImagineIconTypeName_C.SetMasterData
// 0x00E8 (0x00E8 - 0x0000)
struct StackBEnhanceImagineIconTypeName_C_SetMasterData final
{
public:
	struct FSBMasterImagine                       SBMasterImagine;                                   // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9264[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9265[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9266[0x3];                                     // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9267[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StackBEnhanceImagineIconTypeName_C_SetMasterData) == 0x000008, "Wrong alignment on StackBEnhanceImagineIconTypeName_C_SetMasterData");
static_assert(sizeof(StackBEnhanceImagineIconTypeName_C_SetMasterData) == 0x0000E8, "Wrong size on StackBEnhanceImagineIconTypeName_C_SetMasterData");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, SBMasterImagine) == 0x000000, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::SBMasterImagine' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_bool_Variable) == 0x0000B0, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_int_Variable) == 0x0000B4, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_int_Variable_1) == 0x0000B8, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_bool_Variable_1) == 0x0000BC, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_int_Variable_2) == 0x0000C0, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_bool_Variable_2) == 0x0000C4, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_int_Variable_3) == 0x0000C8, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_bool_Variable_3) == 0x0000CC, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, Temp_int_Variable_4) == 0x0000D0, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, K2Node_Select_Default) == 0x0000D4, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, K2Node_Select_Default_1) == 0x0000D8, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, K2Node_Select_Default_2) == 0x0000DC, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetMasterData, K2Node_Select_Default_3) == 0x0000E0, "Member 'StackBEnhanceImagineIconTypeName_C_SetMasterData::K2Node_Select_Default_3' has a wrong offset!");

// Function StackBEnhanceImagineIconTypeName.StackBEnhanceImagineIconTypeName_C.SetFontColorSize
// 0x00D8 (0x00D8 - 0x0000)
struct StackBEnhanceImagineIconTypeName_C_SetFontColorSize final
{
public:
	struct FLinearColor                           ImgColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            TxtColor;                                          // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FLinearColor                           IconColor;                                         // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FontSize;                                          // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0050(0x0088)(HasGetValueTypeHash)
};
static_assert(alignof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize) == 0x000008, "Wrong alignment on StackBEnhanceImagineIconTypeName_C_SetFontColorSize");
static_assert(sizeof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize) == 0x0000D8, "Wrong size on StackBEnhanceImagineIconTypeName_C_SetFontColorSize");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize, ImgColor) == 0x000000, "Member 'StackBEnhanceImagineIconTypeName_C_SetFontColorSize::ImgColor' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize, TxtColor) == 0x000010, "Member 'StackBEnhanceImagineIconTypeName_C_SetFontColorSize::TxtColor' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize, IconColor) == 0x000038, "Member 'StackBEnhanceImagineIconTypeName_C_SetFontColorSize::IconColor' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize, FontSize) == 0x000048, "Member 'StackBEnhanceImagineIconTypeName_C_SetFontColorSize::FontSize' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize, CallFunc_FTrunc_ReturnValue) == 0x00004C, "Member 'StackBEnhanceImagineIconTypeName_C_SetFontColorSize::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(StackBEnhanceImagineIconTypeName_C_SetFontColorSize, K2Node_MakeStruct_SlateFontInfo) == 0x000050, "Member 'StackBEnhanceImagineIconTypeName_C_SetFontColorSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

}

