#pragma once

 

// Package: TacticalSkillTypeRadioBtn

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.OnRadioBtnSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature final
{
public:
	int32                                         InSkillTypeId;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature) == 0x000004, "Wrong alignment on TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature) == 0x000004, "Wrong size on TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature, InSkillTypeId) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_OnRadioBtnSelected__DelegateSignature::InSkillTypeId' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.ExecuteUbergraph_TacticalSkillTypeRadioBtn
// 0x0008 (0x0008 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn) == 0x000004, "Wrong alignment on TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn) == 0x000008, "Wrong size on TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn, EntryPoint) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn::EntryPoint' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn, K2Node_ComponentBoundEvent_bIsChecked) == 0x000004, "Member 'TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn, K2Node_Event_IsDesignTime) == 0x000005, "Member 'TacticalSkillTypeRadioBtn_C_ExecuteUbergraph_TacticalSkillTypeRadioBtn::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_BndEvt__TacticalSkillTypeRadioButton_RadioBtn_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_PreConstruct) == 0x000001, "Wrong alignment on TacticalSkillTypeRadioBtn_C_PreConstruct");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_PreConstruct) == 0x000001, "Wrong size on TacticalSkillTypeRadioBtn_C_PreConstruct");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.SetSkillType
// 0x0038 (0x0038 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_SetSkillType final
{
public:
	int32                                         InSkillTypeId;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83DB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalSkillTypeString;                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_SetSkillType) == 0x000008, "Wrong alignment on TacticalSkillTypeRadioBtn_C_SetSkillType");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_SetSkillType) == 0x000038, "Wrong size on TacticalSkillTypeRadioBtn_C_SetSkillType");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSkillType, InSkillTypeId) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_SetSkillType::InSkillTypeId' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSkillType, LocalSkillTypeString) == 0x000008, "Member 'TacticalSkillTypeRadioBtn_C_SetSkillType::LocalSkillTypeString' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSkillType, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'TacticalSkillTypeRadioBtn_C_SetSkillType::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSkillType, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'TacticalSkillTypeRadioBtn_C_SetSkillType::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSkillType, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'TacticalSkillTypeRadioBtn_C_SetSkillType::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.SetSelectMode
// 0x000B (0x000B - 0x0000)
struct TacticalSkillTypeRadioBtn_C_SetSelectMode final
{
public:
	bool                                          InIsSelectMode;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_SetSelectMode) == 0x000001, "Wrong alignment on TacticalSkillTypeRadioBtn_C_SetSelectMode");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_SetSelectMode) == 0x00000B, "Wrong size on TacticalSkillTypeRadioBtn_C_SetSelectMode");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, InIsSelectMode) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::InIsSelectMode' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, Temp_byte_Variable) == 0x000001, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, Temp_byte_Variable_1) == 0x000002, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, Temp_bool_Variable) == 0x000003, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, Temp_byte_Variable_2) == 0x000004, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, Temp_byte_Variable_3) == 0x000005, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, Temp_bool_Variable_1) == 0x000006, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, K2Node_Select_Default) == 0x000007, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, K2Node_Select_Default_1) == 0x000008, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetSelectMode, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'TacticalSkillTypeRadioBtn_C_SetSelectMode::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.SetEquipped
// 0x0060 (0x0060 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_SetEquipped final
{
public:
	bool                                          InIsEquipped;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83DC[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_SetEquipped) == 0x000008, "Wrong alignment on TacticalSkillTypeRadioBtn_C_SetEquipped");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_SetEquipped) == 0x000060, "Wrong size on TacticalSkillTypeRadioBtn_C_SetEquipped");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, InIsEquipped) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::InIsEquipped' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, Temp_byte_Variable) == 0x000001, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, Temp_byte_Variable_1) == 0x000002, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, Temp_bool_Variable) == 0x000058, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, K2Node_Select_Default) == 0x000059, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetEquipped, CallFunc_IsValid_ReturnValue) == 0x00005A, "Member 'TacticalSkillTypeRadioBtn_C_SetEquipped::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.SetRadioBtnSelected
// 0x0060 (0x0060 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83DD[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected) == 0x000008, "Wrong alignment on TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected) == 0x000060, "Wrong size on TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected, InIsSelected) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.IsRedioBtnSelected
// 0x0004 (0x0004 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected final
{
public:
	bool                                          OutIsSelected;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECheckBoxState                                CallFunc_GetCheckedState_ReturnValue;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected) == 0x000001, "Wrong alignment on TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected) == 0x000004, "Wrong size on TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected, OutIsSelected) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected::OutIsSelected' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected, CallFunc_GetCheckedState_ReturnValue) == 0x000002, "Member 'TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected::CallFunc_GetCheckedState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'TacticalSkillTypeRadioBtn_C_IsRedioBtnSelected::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.SetRadioBtnVisibility
// 0x0006 (0x0006 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility final
{
public:
	bool                                          InIsVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility) == 0x000001, "Wrong alignment on TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility) == 0x000006, "Wrong size on TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility, InIsVisible) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility::InIsVisible' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility, Temp_byte_Variable) == 0x000001, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility, Temp_bool_Variable) == 0x000003, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility, K2Node_Select_Default) == 0x000005, "Member 'TacticalSkillTypeRadioBtn_C_SetRadioBtnVisibility::K2Node_Select_Default' has a wrong offset!");

// Function TacticalSkillTypeRadioBtn.TacticalSkillTypeRadioBtn_C.GetSkillTypeId
// 0x0004 (0x0004 - 0x0000)
struct TacticalSkillTypeRadioBtn_C_GetSkillTypeId final
{
public:
	int32                                         OutSkillTypeId;                                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TacticalSkillTypeRadioBtn_C_GetSkillTypeId) == 0x000004, "Wrong alignment on TacticalSkillTypeRadioBtn_C_GetSkillTypeId");
static_assert(sizeof(TacticalSkillTypeRadioBtn_C_GetSkillTypeId) == 0x000004, "Wrong size on TacticalSkillTypeRadioBtn_C_GetSkillTypeId");
static_assert(offsetof(TacticalSkillTypeRadioBtn_C_GetSkillTypeId, OutSkillTypeId) == 0x000000, "Member 'TacticalSkillTypeRadioBtn_C_GetSkillTypeId::OutSkillTypeId' has a wrong offset!");

}

