#pragma once

 

// Package: TokenSelectorListItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function TokenSelectorListItem.TokenSelectorListItem_C.OnSelect__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TokenSelectorListItem_C_OnSelect__DelegateSignature final
{
public:
	class UTokenSelectorListItem_C*               Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TokenSelectorListItem_C_OnSelect__DelegateSignature) == 0x000008, "Wrong alignment on TokenSelectorListItem_C_OnSelect__DelegateSignature");
static_assert(sizeof(TokenSelectorListItem_C_OnSelect__DelegateSignature) == 0x000008, "Wrong size on TokenSelectorListItem_C_OnSelect__DelegateSignature");
static_assert(offsetof(TokenSelectorListItem_C_OnSelect__DelegateSignature, Target) == 0x000000, "Member 'TokenSelectorListItem_C_OnSelect__DelegateSignature::Target' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.ExecuteUbergraph_TokenSelectorListItem
// 0x0008 (0x0008 - 0x0000)
struct TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem) == 0x000004, "Wrong alignment on TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem");
static_assert(sizeof(TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem) == 0x000008, "Wrong size on TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem");
static_assert(offsetof(TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem, EntryPoint) == 0x000000, "Member 'TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem, K2Node_ComponentBoundEvent_bIsChecked) == 0x000004, "Member 'TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem, K2Node_ComponentBoundEvent_bIsChecked_1) == 0x000005, "Member 'TokenSelectorListItem_C_ExecuteUbergraph_TokenSelectorListItem::K2Node_ComponentBoundEvent_bIsChecked_1' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_SBRadioBtnCmn01_C_198_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'TokenSelectorListItem_C_BndEvt__TokenSelectorListItem_CB_Select_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.SetTokenData
// 0x0100 (0x0100 - 0x0000)
struct TokenSelectorListItem_C_SetTokenData final
{
public:
	int32                                         Param_TokenID;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         CallFunc_GetTokenAmount_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B64[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_FindTokenMaster_bIsValid;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B65[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterToken                           CallFunc_FindTokenMaster_TokenMaster;              // 0x0070(0x0058)()
	class FString                                 CallFunc_GetMasterTokenText_ReturnValue;           // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMasterTokenText_ReturnValue_1;         // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0018)()
};
static_assert(alignof(TokenSelectorListItem_C_SetTokenData) == 0x000008, "Wrong alignment on TokenSelectorListItem_C_SetTokenData");
static_assert(sizeof(TokenSelectorListItem_C_SetTokenData) == 0x000100, "Wrong size on TokenSelectorListItem_C_SetTokenData");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, Param_TokenID) == 0x000000, "Member 'TokenSelectorListItem_C_SetTokenData::Param_TokenID' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_GetTokenAmount_ReturnValue) == 0x000020, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_GetTokenAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000028, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_GetTextFromAsset_ReturnValue) == 0x000040, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_FindTokenMaster_bIsValid) == 0x000068, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_FindTokenMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_FindTokenMaster_TokenMaster) == 0x000070, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_FindTokenMaster_TokenMaster' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_GetMasterTokenText_ReturnValue) == 0x0000C8, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_GetMasterTokenText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_GetMasterTokenText_ReturnValue_1) == 0x0000D8, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_GetMasterTokenText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetTokenData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E8, "Member 'TokenSelectorListItem_C_SetTokenData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.SetRecepiData
// 0x0088 (0x0088 - 0x0000)
struct TokenSelectorListItem_C_SetRecepiData final
{
public:
	struct FCraftMasterData                       RecepiData;                                        // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TokenSelectorListItem_C_SetRecepiData) == 0x000008, "Wrong alignment on TokenSelectorListItem_C_SetRecepiData");
static_assert(sizeof(TokenSelectorListItem_C_SetRecepiData) == 0x000088, "Wrong size on TokenSelectorListItem_C_SetRecepiData");
static_assert(offsetof(TokenSelectorListItem_C_SetRecepiData, RecepiData) == 0x000000, "Member 'TokenSelectorListItem_C_SetRecepiData::RecepiData' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.Set Select
// 0x0005 (0x0005 - 0x0000)
struct TokenSelectorListItem_C_Set_Select final
{
public:
	bool                                          bSelect;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TokenSelectorListItem_C_Set_Select) == 0x000001, "Wrong alignment on TokenSelectorListItem_C_Set_Select");
static_assert(sizeof(TokenSelectorListItem_C_Set_Select) == 0x000005, "Wrong size on TokenSelectorListItem_C_Set_Select");
static_assert(offsetof(TokenSelectorListItem_C_Set_Select, bSelect) == 0x000000, "Member 'TokenSelectorListItem_C_Set_Select::bSelect' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_Set_Select, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'TokenSelectorListItem_C_Set_Select::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_Set_Select, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000002, "Member 'TokenSelectorListItem_C_Set_Select::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_Set_Select, Temp_bool_Variable) == 0x000003, "Member 'TokenSelectorListItem_C_Set_Select::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_Set_Select, K2Node_Select_Default) == 0x000004, "Member 'TokenSelectorListItem_C_Set_Select::K2Node_Select_Default' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.SetCraftCount
// 0x0004 (0x0004 - 0x0000)
struct TokenSelectorListItem_C_SetCraftCount final
{
public:
	int32                                         Param_CraftCount;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TokenSelectorListItem_C_SetCraftCount) == 0x000004, "Wrong alignment on TokenSelectorListItem_C_SetCraftCount");
static_assert(sizeof(TokenSelectorListItem_C_SetCraftCount) == 0x000004, "Wrong size on TokenSelectorListItem_C_SetCraftCount");
static_assert(offsetof(TokenSelectorListItem_C_SetCraftCount, Param_CraftCount) == 0x000000, "Member 'TokenSelectorListItem_C_SetCraftCount::Param_CraftCount' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.UpdateNeedNum
// 0x0028 (0x0028 - 0x0000)
struct TokenSelectorListItem_C_UpdateNeedNum final
{
public:
	int32                                         CallFunc_GetTokenAmount_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TokenSelectorListItem_C_UpdateNeedNum) == 0x000008, "Wrong alignment on TokenSelectorListItem_C_UpdateNeedNum");
static_assert(sizeof(TokenSelectorListItem_C_UpdateNeedNum) == 0x000028, "Wrong size on TokenSelectorListItem_C_UpdateNeedNum");
static_assert(offsetof(TokenSelectorListItem_C_UpdateNeedNum, CallFunc_GetTokenAmount_ReturnValue) == 0x000000, "Member 'TokenSelectorListItem_C_UpdateNeedNum::CallFunc_GetTokenAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_UpdateNeedNum, CallFunc_Multiply_IntInt_ReturnValue) == 0x000004, "Member 'TokenSelectorListItem_C_UpdateNeedNum::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_UpdateNeedNum, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'TokenSelectorListItem_C_UpdateNeedNum::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_UpdateNeedNum, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000020, "Member 'TokenSelectorListItem_C_UpdateNeedNum::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.SetUIScreen 
// 0x0090 (0x0090 - 0x0000)
struct TokenSelectorListItem_C_SetUIScreen_ final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B66[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetImpossibleColor_ReturnValue;           // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	int32                                         CallFunc_GetTokenId_TokenId;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTokenAmount_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B67[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0068(0x0028)()
};
static_assert(alignof(TokenSelectorListItem_C_SetUIScreen_) == 0x000008, "Wrong alignment on TokenSelectorListItem_C_SetUIScreen_");
static_assert(sizeof(TokenSelectorListItem_C_SetUIScreen_) == 0x000090, "Wrong size on TokenSelectorListItem_C_SetUIScreen_");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, Temp_bool_Variable) == 0x000000, "Member 'TokenSelectorListItem_C_SetUIScreen_::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, CallFunc_GetImpossibleColor_ReturnValue) == 0x000008, "Member 'TokenSelectorListItem_C_SetUIScreen_::CallFunc_GetImpossibleColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'TokenSelectorListItem_C_SetUIScreen_::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, CallFunc_GetTokenId_TokenId) == 0x000058, "Member 'TokenSelectorListItem_C_SetUIScreen_::CallFunc_GetTokenId_TokenId' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, CallFunc_GetTokenAmount_ReturnValue) == 0x00005C, "Member 'TokenSelectorListItem_C_SetUIScreen_::CallFunc_GetTokenAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, CallFunc_Multiply_IntInt_ReturnValue) == 0x000060, "Member 'TokenSelectorListItem_C_SetUIScreen_::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000064, "Member 'TokenSelectorListItem_C_SetUIScreen_::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TokenSelectorListItem_C_SetUIScreen_, K2Node_Select_Default) == 0x000068, "Member 'TokenSelectorListItem_C_SetUIScreen_::K2Node_Select_Default' has a wrong offset!");

// Function TokenSelectorListItem.TokenSelectorListItem_C.GetTokenId
// 0x0004 (0x0004 - 0x0000)
struct TokenSelectorListItem_C_GetTokenId final
{
public:
	int32                                         Param_TokenID;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TokenSelectorListItem_C_GetTokenId) == 0x000004, "Wrong alignment on TokenSelectorListItem_C_GetTokenId");
static_assert(sizeof(TokenSelectorListItem_C_GetTokenId) == 0x000004, "Wrong size on TokenSelectorListItem_C_GetTokenId");
static_assert(offsetof(TokenSelectorListItem_C_GetTokenId, Param_TokenID) == 0x000000, "Member 'TokenSelectorListItem_C_GetTokenId::Param_TokenID' has a wrong offset!");

}

