#pragma once

 

// Package: UMG_LiquidMemoryShop

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_LiquidMemoryShop.UMG_LiquidMemoryShop_C.OnClose__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_LiquidMemoryShop_C_OnClose__DelegateSignature final
{
public:
	bool                                          Param_IsLiquidMemoryUsed;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryShop_C_OnClose__DelegateSignature) == 0x000001, "Wrong alignment on UMG_LiquidMemoryShop_C_OnClose__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryShop_C_OnClose__DelegateSignature) == 0x000001, "Wrong size on UMG_LiquidMemoryShop_C_OnClose__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryShop_C_OnClose__DelegateSignature, Param_IsLiquidMemoryUsed) == 0x000000, "Member 'UMG_LiquidMemoryShop_C_OnClose__DelegateSignature::Param_IsLiquidMemoryUsed' has a wrong offset!");

// Function UMG_LiquidMemoryShop.UMG_LiquidMemoryShop_C.ExecuteUbergraph_UMG_LiquidMemoryShop
// 0x0490 (0x0490 - 0x0000)
struct UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUMG_LiquidMemoryProductListItem_C* InItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUMG_LiquidMemoryProductListItem_C* InItem)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUMG_LiquidMemoryProductListItem_C* InItem)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D6[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerLiquidMemoryComponent*         CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D7[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InRetCode, TArray<struct FSBLiquidMemoryInfo>& InUpdatedLiquidMemoryInfos)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 InRetCode, TArray<struct FSBLiquidMemoryInfo>& InUpdatedLiquidMemoryInfos)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_52D8[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52D9[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerLiquidMemoryComponent*         CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DA[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 InRetCode, TArray<struct FSBLiquidMemoryInfo>& InUpdatedLiquidMemoryInfos)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DB[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 InRetCode, TArray<struct FSBLiquidMemoryInfo>& InUpdatedLiquidMemoryInfos)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetOwnActivatedLiquidMemoryEfficacyValue_ByCategoryAndEfficacyType_OutIsValid; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DC[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOwnActivatedLiquidMemoryEfficacyValue_ByCategoryAndEfficacyType_ReturnValue; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_2;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DD[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerLiquidMemoryComponent*         CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_2; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DE[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52DF[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsLiquidMemoryUsed;             // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E0[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LiquidMemoryProductListItem_C*     K2Node_CustomEvent_InItem_2;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_LiquidMemoryProductListItem_C*     K2Node_CustomEvent_InItem_1;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_LiquidMemoryProductListItem_C*     K2Node_CustomEvent_InItem;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_InWidget;                       // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrUseBottleNum_OutBottleNum;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLiquidMemoryId_OutProductItemIndex;    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E1[0x2];                                     // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E2[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E3[0x2];                                     // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMoney_ReturnValue;                     // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E4[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0190(0x0018)()
	EDialogResult                                 K2Node_CustomEvent_Result;                         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E5[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EDialogResult Result)>         K2Node_CreateDelegate_OutputDelegate_7;            // 0x01AC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetSystemMessageManager_IsValid;          // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E6[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBSystemMessageManager*                CallFunc_GetSystemMessageManager_ReturnValue;      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_3;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E7[0x7];                                     // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPlayerLiquidMemoryComponent*         CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_3; // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E8[0x3];                                     // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRetCode_1;                    // 0x01E4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBLiquidMemoryInfo>            K2Node_CustomEvent_InUpdatedLiquidMemoryInfos_1;   // 0x01E8(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E9[0x7];                                     // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0210(0x0018)()
	class FText                                   K2Node_CustomEvent_InMessageText;                  // 0x0228(0x0018)()
	int32                                         CallFunc_GetCurrUseBottleNum_OutBottleNum_1;       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_3;            // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EA[0x3];                                     // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_InRetCode;                      // 0x0248(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52EB[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBLiquidMemoryInfo>            K2Node_CustomEvent_InUpdatedLiquidMemoryInfos;     // 0x0250(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_GetSBRetMessage_ReturnValue;              // 0x0260(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EC[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0278(0x0018)()
	class UUMG_LiquidMemoryActivateListItem_C*    CallFunc_Create_ReturnValue;                       // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52ED[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x02B0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x02D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x02F8(0x0028)()
	class UBP_Dialog_C*                           CallFunc_Create_ReturnValue_1;                     // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_2;                     // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EE[0x3];                                     // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_3;                     // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52EF[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBLiquidMemoryAccumulateTokenInfo> CallFunc_GetLiquidMemoryAccumulateTokenInfoMaster_ReturnValue; // 0x0340(0x0010)(ConstParm, ReferenceParm)
	class USBToken*                               CallFunc_SpawnObject_ReturnValue;                  // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBTokenStates                         K2Node_CustomEvent_States;                         // 0x0358(0x0010)(ConstParm)
	TDelegate<void(struct FSBTokenStates& States)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0368(0x0010)(ZeroConstructor, NoDestructor)
	class ASBPlayerController*                    CallFunc_GetSBPlayerController_ReturnValue_4;      // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LiquidMemoryId;                 // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFullCharge;                   // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Request_DeleteExpired_ReturnValue;        // 0x0385(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F0[0x2];                                     // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F1[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_4;                     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_5;                     // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_6;                     // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F2[0x3];                                     // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F3[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LiquidMemoryDetails_C*             K2Node_DynamicCast_AsUMG_Liquid_Memory_Details;    // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F4[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x03D0(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x03E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F5[0x1];                                     // 0x03E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_Map_Keys_Keys;                            // 0x03E8(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_IntArraySort_ReturnValue;                 // 0x03F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F6[0x3];                                     // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F7[0x5];                                     // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52F8[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52F9[0x3];                                     // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0440(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FA[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LiquidMemoryProductListItem_C*     K2Node_DynamicCast_AsUMG_Liquid_Memory_Product_List_Item; // 0x0450(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FB[0x2];                                     // 0x045A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue_7;                     // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0464(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0478(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FC[0x3];                                     // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop) == 0x000008, "Wrong alignment on UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop");
static_assert(sizeof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop) == 0x000490, "Wrong size on UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, EntryPoint) == 0x000000, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, Temp_int_Array_Index_Variable) == 0x000034, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSBPlayerController_ReturnValue) == 0x000038, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSBPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000040, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue) == 0x000048, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_4) == 0x000064, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSBPlayerController_ReturnValue_1) == 0x000078, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSBPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_1) == 0x000088, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_3) == 0x000090, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_5) == 0x000094, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetNetworkDataCache_IsValid) == 0x0000A4, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetNetworkDataCache_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetNetworkDataCache_ReturnValue) == 0x0000A8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetOwnActivatedLiquidMemoryEfficacyValue_ByCategoryAndEfficacyType_OutIsValid) == 0x0000C0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetOwnActivatedLiquidMemoryEfficacyValue_ByCategoryAndEfficacyType_OutIsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetOwnActivatedLiquidMemoryEfficacyValue_ByCategoryAndEfficacyType_ReturnValue) == 0x0000C4, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetOwnActivatedLiquidMemoryEfficacyValue_ByCategoryAndEfficacyType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSBPlayerController_ReturnValue_2) == 0x0000C8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSBPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_4) == 0x0000D0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_2) == 0x0000D8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_5) == 0x0000E0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_6) == 0x0000E1, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetChildrenCount_ReturnValue) == 0x0000E4, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000EC, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000F0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_K2_SetTimer_ReturnValue) == 0x0000F8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000100, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlaySE_ReturnValue) == 0x000108, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_IsLiquidMemoryUsed) == 0x00010C, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_IsLiquidMemoryUsed' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Not_PreBool_ReturnValue) == 0x00010D, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InItem_2) == 0x000110, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InItem_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InItem_1) == 0x000118, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InItem_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InItem) == 0x000120, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InItem' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InWidget) == 0x000128, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InWidget' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetCurrUseBottleNum_OutBottleNum) == 0x000130, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetCurrUseBottleNum_OutBottleNum' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetLiquidMemoryId_OutProductItemIndex) == 0x000134, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetLiquidMemoryId_OutProductItemIndex' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_7) == 0x000138, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000139, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, Temp_int_Loop_Counter_Variable) == 0x00013C, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_8) == 0x000140, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Add_IntInt_ReturnValue) == 0x000144, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x000148, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_BooleanOR_ReturnValue) == 0x000149, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetMoney_ReturnValue) == 0x00014C, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetMoney_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetTextFromAsset_ReturnValue) == 0x000150, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000160, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000180, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000190, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_Result) == 0x0001A8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A9, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001AC, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSystemMessageManager_IsValid) == 0x0001BC, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSystemMessageManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSystemMessageManager_ReturnValue) == 0x0001C0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSystemMessageManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSBPlayerController_ReturnValue_3) == 0x0001C8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSBPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_9) == 0x0001D0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_3) == 0x0001D8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetPlayerLiquidMemoryComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_IsValid_ReturnValue_10) == 0x0001E0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InRetCode_1) == 0x0001E4, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InRetCode_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InUpdatedLiquidMemoryInfos_1) == 0x0001E8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InUpdatedLiquidMemoryInfos_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001F8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x000200, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000210, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InMessageText) == 0x000228, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InMessageText' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetCurrUseBottleNum_OutBottleNum_1) == 0x000240, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetCurrUseBottleNum_OutBottleNum_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_NotEqual_IntInt_ReturnValue_3) == 0x000244, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_NotEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InRetCode) == 0x000248, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InRetCode' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_InUpdatedLiquidMemoryInfos) == 0x000250, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_InUpdatedLiquidMemoryInfos' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSBRetMessage_ReturnValue) == 0x000260, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSBRetMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000270, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000278, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Create_ReturnValue) == 0x000290, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlaySE_ReturnValue_1) == 0x000298, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00029C, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetTextFromAsset_ReturnValue_3) == 0x0002A0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetTextFromAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0002B0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0002C8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_MakeStruct_SlateColor) == 0x0002D0, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_MakeStruct_SlateColor_1) == 0x0002F8, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Create_ReturnValue_1) == 0x000320, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlaySE_ReturnValue_2) == 0x000328, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00032C, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlaySE_ReturnValue_3) == 0x000330, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlaySE_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetMasterDataManager_IsValid) == 0x000334, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetMasterDataManager_ReturnValue) == 0x000338, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetLiquidMemoryAccumulateTokenInfoMaster_ReturnValue) == 0x000340, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetLiquidMemoryAccumulateTokenInfoMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_SpawnObject_ReturnValue) == 0x000350, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_States) == 0x000358, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_States' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CreateDelegate_OutputDelegate_8) == 0x000368, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_GetSBPlayerController_ReturnValue_4) == 0x000378, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_GetSBPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_LiquidMemoryId) == 0x000380, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_LiquidMemoryId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, K2Node_CustomEvent_IsFullCharge) == 0x000384, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::K2Node_CustomEvent_IsFullCharge' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_Request_DeleteExpired_ReturnValue) == 0x000385, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_Request_DeleteExpired_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, CallFunc_PlayAnimation_ReturnValue) == 0x000388, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop, Temp_bool_Variable) == 0x000390, "Member 'UMG_LiquidMemoryShop_C_ExecuteUbergraph_UMG_LiquidMemoryShop::Temp_bool_Variable' has a wrong offset!");
