#pragma once

 

// Package: UMG_SeasonPassMenuBtn1

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_SeasonPassMenuBtn1.UMG_SeasonPassMenuBtn1_C.ExecuteUbergraph_UMG_SeasonPassMenuBtn1
// 0x0008 (0x0008 - 0x0000)
struct UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1) == 0x000004, "Wrong alignment on UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1");
static_assert(sizeof(UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1) == 0x000008, "Wrong size on UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1");
static_assert(offsetof(UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1, EntryPoint) == 0x000000, "Member 'UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1, K2Node_Event_IsDesignTime) == 0x000005, "Member 'UMG_SeasonPassMenuBtn1_C_ExecuteUbergraph_UMG_SeasonPassMenuBtn1::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_SeasonPassMenuBtn1.UMG_SeasonPassMenuBtn1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_SeasonPassMenuBtn1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_SeasonPassMenuBtn1_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_SeasonPassMenuBtn1_C_PreConstruct");
static_assert(sizeof(UMG_SeasonPassMenuBtn1_C_PreConstruct) == 0x000001, "Wrong size on UMG_SeasonPassMenuBtn1_C_PreConstruct");
static_assert(offsetof(UMG_SeasonPassMenuBtn1_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_SeasonPassMenuBtn1_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

