#pragma once

 

// Package: UMG_PhotoMode_ThumbnailData

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.ThumbnailBtnClickEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature final
{
public:
	int32                                         OutThumbnailNo;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature) == 0x000004, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature) == 0x000004, "Wrong size on UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature, OutThumbnailNo) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_ThumbnailBtnClickEvent__DelegateSignature::OutThumbnailNo' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SelectFrameImageClickEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature final
{
public:
	int32                                         OutThumbnailNo;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature) == 0x000004, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature) == 0x000004, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature, OutThumbnailNo) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SelectFrameImageClickEvent__DelegateSignature::OutThumbnailNo' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.ExecuteUbergraph_UMG_PhotoMode_ThumbnailData
// 0x0020 (0x0020 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsUpload;                            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_972F[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ThumbnailNo;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInIsEnabled;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9730[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData) == 0x000004, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData) == 0x000020, "Wrong size on UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, EntryPoint) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable) == 0x000004, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_1) == 0x000005, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_2) == 0x000006, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_3) == 0x000007, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_4) == 0x000008, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_5) == 0x000009, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_bool_Variable) == 0x00000A, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_6) == 0x00000B, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, Temp_byte_Variable_7) == 0x00000C, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, K2Node_Event_bIsUpload) == 0x00000D, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::K2Node_Event_bIsUpload' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, K2Node_CustomEvent_ThumbnailNo) == 0x000010, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::K2Node_CustomEvent_ThumbnailNo' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, K2Node_CustomEvent_bInIsEnabled) == 0x000014, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::K2Node_CustomEvent_bInIsEnabled' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000018, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, K2Node_Select_Default) == 0x00001D, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, CallFunc_GetVisibility_ReturnValue) == 0x00001E, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData, K2Node_Select_Default_1) == 0x00001F, "Member 'UMG_PhotoMode_ThumbnailData_C_ExecuteUbergraph_UMG_PhotoMode_ThumbnailData::K2Node_Select_Default_1' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetIsEnableBtn
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn) == 0x000001, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn, bInIsEnabled) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetIsEnableBtn::bInIsEnabled' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.Init
// 0x0004 (0x0004 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_Init final
{
public:
	int32                                         Param_ThumbnailNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_Init) == 0x000004, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_Init");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_Init) == 0x000004, "Wrong size on UMG_PhotoMode_ThumbnailData_C_Init");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_Init, Param_ThumbnailNo) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_Init::Param_ThumbnailNo' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetIsUpload_Bp
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp final
{
public:
	bool                                          bIsUpload;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp) == 0x000001, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp, bIsUpload) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetIsUpload_Bp::bIsUpload' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetThumbnailTexture
// 0x0020 (0x0020 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 InImage_PNGData;                                   // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          OutIsTextureNone;                                  // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture) == 0x000020, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture, Texture) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture::Texture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture, InImage_PNGData) == 0x000008, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture::InImage_PNGData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture, OutIsTextureNone) == 0x000018, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture::OutIsTextureNone' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000019, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetActiveWidgetIndex
// 0x0008 (0x0008 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex final
{
public:
	int32                                         OutActiveWidgetIndex;                              // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex) == 0x000004, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex) == 0x000008, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex, OutActiveWidgetIndex) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex::OutActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'UMG_PhotoMode_ThumbnailData_C_GetActiveWidgetIndex::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetSlateBrush
// 0x00B0 (0x00B0 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetSlateBrush final
{
public:
	struct FSlateBrush                            Brush_Image;                                       // 0x0000(0x0088)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9731[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9732[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_DynamicCast_AsImage;                        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetSlateBrush");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush) == 0x0000B0, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetSlateBrush");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, Brush_Image) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::Brush_Image' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, ReturnValue) == 0x000088, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, CallFunc_GetActiveWidget_ReturnValue) == 0x000090, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000098, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, K2Node_DynamicCast_AsImage) == 0x0000A0, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::K2Node_DynamicCast_AsImage' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetSlateBrush, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'UMG_PhotoMode_ThumbnailData_C_GetSlateBrush::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.IsSelectFrame
// 0x0003 (0x0003 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_IsSelectFrame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_IsSelectFrame) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_IsSelectFrame");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_IsSelectFrame) == 0x000003, "Wrong size on UMG_PhotoMode_ThumbnailData_C_IsSelectFrame");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_IsSelectFrame, ReturnValue) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_IsSelectFrame::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_IsSelectFrame, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'UMG_PhotoMode_ThumbnailData_C_IsSelectFrame::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_IsSelectFrame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'UMG_PhotoMode_ThumbnailData_C_IsSelectFrame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetFrameImageVisibility
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility) == 0x000001, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility, InVisibility) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetFrameImageVisibility::InVisibility' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetThumbnailNo
// 0x0004 (0x0004 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo final
{
public:
	int32                                         Param_ThumbnailNo;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo) == 0x000004, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo) == 0x000004, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo, Param_ThumbnailNo) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailNo::Param_ThumbnailNo' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetIsUpload
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetIsUpload final
{
public:
	bool                                          Param_IsUpload;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetIsUpload) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetIsUpload");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetIsUpload) == 0x000001, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetIsUpload");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetIsUpload, Param_IsUpload) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetIsUpload::Param_IsUpload' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.SetThumbnailTexture_Bp
// 0x0020 (0x0020 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 InImagePNGData;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetThumbnailTexture_outIsTextureNone;     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp) == 0x000020, "Wrong size on UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp, Texture) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp::Texture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp, InImagePNGData) == 0x000008, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp::InImagePNGData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp, ReturnValue) == 0x000018, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp, CallFunc_SetThumbnailTexture_outIsTextureNone) == 0x000019, "Member 'UMG_PhotoMode_ThumbnailData_C_SetThumbnailTexture_Bp::CallFunc_SetThumbnailTexture_outIsTextureNone' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetThumbnailTexture
// 0x0010 (0x0010 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture final
{
public:
	class UTexture2DDynamic*                      OutThumbnailTexture;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      CallFunc_GetThumbnailTexture_Internal_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture) == 0x000010, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture, OutThumbnailTexture) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture::OutThumbnailTexture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture, CallFunc_GetThumbnailTexture_Internal_ReturnValue) == 0x000008, "Member 'UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture::CallFunc_GetThumbnailTexture_Internal_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetImage_PNGData
// 0x0010 (0x0010 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData final
{
public:
	TArray<uint8>                                 OutImage_PNGData;                                  // 0x0000(0x0010)(Parm, OutParm)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData) == 0x000010, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData, OutImage_PNGData) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetImage_PNGData::OutImage_PNGData' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetIsUpload
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetIsUpload final
{
public:
	bool                                          Param_IsUpload;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetIsUpload");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload) == 0x000001, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetIsUpload");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload, Param_IsUpload) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetIsUpload::Param_IsUpload' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetThumbnailTexture_Bp
// 0x0010 (0x0010 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp final
{
public:
	class UTexture2DDynamic*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      CallFunc_GetThumbnailTexture_outThumbnailTexture;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp) == 0x000010, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp, ReturnValue) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp, CallFunc_GetThumbnailTexture_outThumbnailTexture) == 0x000008, "Member 'UMG_PhotoMode_ThumbnailData_C_GetThumbnailTexture_Bp::CallFunc_GetThumbnailTexture_outThumbnailTexture' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetIsUpload_Bp
// 0x0002 (0x0002 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsUpload_IsUpload;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp) == 0x000001, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp) == 0x000002, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp, ReturnValue) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp, CallFunc_GetIsUpload_IsUpload) == 0x000001, "Member 'UMG_PhotoMode_ThumbnailData_C_GetIsUpload_Bp::CallFunc_GetIsUpload_IsUpload' has a wrong offset!");

// Function UMG_PhotoMode_ThumbnailData.UMG_PhotoMode_ThumbnailData_C.GetImagePNGData_Bp
// 0x0020 (0x0020 - 0x0000)
struct UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp final
{
public:
	TArray<uint8>                                 OutImagePngData;                                   // 0x0000(0x0010)(Parm, OutParm)
	TArray<uint8>                                 CallFunc_GetImage_PNGData_outImage_PNGData;        // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp) == 0x000008, "Wrong alignment on UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp");
static_assert(sizeof(UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp) == 0x000020, "Wrong size on UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp, OutImagePngData) == 0x000000, "Member 'UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp::OutImagePngData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp, CallFunc_GetImage_PNGData_outImage_PNGData) == 0x000010, "Member 'UMG_PhotoMode_ThumbnailData_C_GetImagePNGData_Bp::CallFunc_GetImage_PNGData_outImage_PNGData' has a wrong offset!");

}

