#pragma once

 

// Package: UMG_MatchingMenu_Reward

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SBMasterRewardWithAmountRange_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.OnClickIcon__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature final
{
public:
	class UQuestRewardIcon_C*                     Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature) == 0x000008, "Wrong size on UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature, Sender) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_OnClickIcon__DelegateSignature::Sender' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.ExecuteUbergraph_UMG_MatchingMenu_Reward
// 0x0010 (0x0010 - 0x0000)
struct UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8655[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestRewardIcon_C*                     K2Node_CustomEvent_Sender;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward) == 0x000010, "Wrong size on UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward, EntryPoint) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward, K2Node_CustomEvent_Sender) == 0x000008, "Member 'UMG_MatchingMenu_Reward_C_ExecuteUbergraph_UMG_MatchingMenu_Reward::K2Node_CustomEvent_Sender' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.OnClickIconEvent
// 0x0008 (0x0008 - 0x0000)
struct UMG_MatchingMenu_Reward_C_OnClickIconEvent final
{
public:
	class UQuestRewardIcon_C*                     Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_OnClickIconEvent) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_OnClickIconEvent");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_OnClickIconEvent) == 0x000008, "Wrong size on UMG_MatchingMenu_Reward_C_OnClickIconEvent");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_OnClickIconEvent, Sender) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_OnClickIconEvent::Sender' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.Setup
// 0x0020 (0x0020 - 0x0000)
struct UMG_MatchingMenu_Reward_C_Setup final
{
public:
	class FString                                 Param_GameMode;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Param_MapId;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_Setup) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_Setup");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_Setup) == 0x000020, "Wrong size on UMG_MatchingMenu_Reward_C_Setup");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_Setup, Param_GameMode) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_Setup::Param_GameMode' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_Setup, Param_MapId) == 0x000010, "Member 'UMG_MatchingMenu_Reward_C_Setup::Param_MapId' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_Setup, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'UMG_MatchingMenu_Reward_C_Setup::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_Setup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'UMG_MatchingMenu_Reward_C_Setup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.SetReward
// 0x0150 (0x0150 - 0x0000)
struct UMG_MatchingMenu_Reward_C_SetReward final
{
public:
	class FName                                   RewardInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FloorNum;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FloorMax;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBRewardBoostMissionMasterData        RewardBoostData;                                   // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          RewardBoostIsValid;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8656[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterRewardWithAmountRange> RewardList;                                        // 0x0040(0x0010)(Edit, BlueprintVisible)
	struct FSBMasterRewardWithAmountRange         MasterRewardWithRange;                             // 0x0050(0x002C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8657[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterDungeonReward>         DungeonRewardArray;                                // 0x0080(0x0010)(Edit, BlueprintVisible)
	class UQuestRewardIcon_C*                     CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8658[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterRewardWithAmountRange> CallFunc_GetRewardList_OutRewardList;              // 0x00A8(0x0010)(ReferenceParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRewardAmount_AmountFixed;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRewardAmount_AmountLottery;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRewardAmount_AmountChanged;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8659[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865A[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UQuestRewardIcon_C* Sender)> K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_865B[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865C[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMasterRewardWithAmountRange         CallFunc_Array_Get_Item;                           // 0x0118(0x002C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_SetReward) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_SetReward");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_SetReward) == 0x000150, "Wrong size on UMG_MatchingMenu_Reward_C_SetReward");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, RewardInfo) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_SetReward::RewardInfo' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, FloorNum) == 0x000008, "Member 'UMG_MatchingMenu_Reward_C_SetReward::FloorNum' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, FloorMax) == 0x00000C, "Member 'UMG_MatchingMenu_Reward_C_SetReward::FloorMax' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, RewardBoostData) == 0x000010, "Member 'UMG_MatchingMenu_Reward_C_SetReward::RewardBoostData' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, RewardBoostIsValid) == 0x000038, "Member 'UMG_MatchingMenu_Reward_C_SetReward::RewardBoostIsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, RewardList) == 0x000040, "Member 'UMG_MatchingMenu_Reward_C_SetReward::RewardList' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, MasterRewardWithRange) == 0x000050, "Member 'UMG_MatchingMenu_Reward_C_SetReward::MasterRewardWithRange' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, DungeonRewardArray) == 0x000080, "Member 'UMG_MatchingMenu_Reward_C_SetReward::DungeonRewardArray' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Create_ReturnValue) == 0x000090, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, Temp_int_Array_Index_Variable) == 0x000098, "Member 'UMG_MatchingMenu_Reward_C_SetReward::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'UMG_MatchingMenu_Reward_C_SetReward::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetRewardList_OutRewardList) == 0x0000A8, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetRewardList_OutRewardList' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, K2Node_MakeStruct_Margin) == 0x0000B8, "Member 'UMG_MatchingMenu_Reward_C_SetReward::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetRewardAmount_AmountFixed) == 0x0000C8, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetRewardAmount_AmountFixed' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetRewardAmount_AmountLottery) == 0x0000CC, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetRewardAmount_AmountLottery' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetRewardAmount_AmountChanged) == 0x0000D0, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetRewardAmount_AmountChanged' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D4, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetChildrenCount_ReturnValue) == 0x0000D8, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Divide_IntInt_ReturnValue) == 0x0000DC, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Percent_IntInt_ReturnValue) == 0x0000E0, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetChildrenCount_ReturnValue_1) == 0x0000E4, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E9, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'UMG_MatchingMenu_Reward_C_SetReward::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000100, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetMasterDataManager_IsValid) == 0x000108, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_GetMasterDataManager_ReturnValue) == 0x000110, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Array_Get_Item) == 0x000118, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000149, "Member 'UMG_MatchingMenu_Reward_C_SetReward::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.SetReward2
// 0x0150 (0x0150 - 0x0000)
struct UMG_MatchingMenu_Reward_C_SetReward2 final
{
public:
	class FName                                   RewardInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FloorNum;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FloorMax;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBRewardBoostMissionMasterData        RewardBoostData;                                   // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          RewardBoostIsValid;                                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_865D[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterRewardWithAmountRange> RewardList;                                        // 0x0040(0x0010)(Edit, BlueprintVisible)
	struct FSBMasterRewardWithAmountRange         MasterRewardWithRange;                             // 0x0050(0x002C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_865E[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterDungeonReward>         DungeonRewardArray;                                // 0x0080(0x0010)(Edit, BlueprintVisible)
	class UQuestRewardIcon_C*                     CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_865F[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBMasterRewardWithAmountRange> CallFunc_GetRewardList_OutRewardList;              // 0x00A8(0x0010)(ReferenceParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRewardAmount_AmountFixed;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRewardAmount_AmountLottery;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRewardAmount_AmountChanged;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8660[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8661[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UQuestRewardIcon_C* Sender)> K2Node_CreateDelegate_OutputDelegate;              // 0x00EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8662[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8663[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMasterRewardWithAmountRange         CallFunc_Array_Get_Item;                           // 0x0118(0x002C)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_SetReward2) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_SetReward2");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_SetReward2) == 0x000150, "Wrong size on UMG_MatchingMenu_Reward_C_SetReward2");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, RewardInfo) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::RewardInfo' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, FloorNum) == 0x000008, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::FloorNum' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, FloorMax) == 0x00000C, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::FloorMax' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, RewardBoostData) == 0x000010, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::RewardBoostData' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, RewardBoostIsValid) == 0x000038, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::RewardBoostIsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, RewardList) == 0x000040, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::RewardList' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, MasterRewardWithRange) == 0x000050, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::MasterRewardWithRange' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, DungeonRewardArray) == 0x000080, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::DungeonRewardArray' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Create_ReturnValue) == 0x000090, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, Temp_int_Array_Index_Variable) == 0x000098, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, Temp_int_Loop_Counter_Variable) == 0x00009C, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetRewardList_OutRewardList) == 0x0000A8, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetRewardList_OutRewardList' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, K2Node_MakeStruct_Margin) == 0x0000B8, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetRewardAmount_AmountFixed) == 0x0000C8, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetRewardAmount_AmountFixed' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetRewardAmount_AmountLottery) == 0x0000CC, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetRewardAmount_AmountLottery' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetRewardAmount_AmountChanged) == 0x0000D0, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetRewardAmount_AmountChanged' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D4, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetChildrenCount_ReturnValue) == 0x0000D8, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Divide_IntInt_ReturnValue) == 0x0000DC, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Percent_IntInt_ReturnValue) == 0x0000E0, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetChildrenCount_ReturnValue_1) == 0x0000E4, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E8, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E9, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, K2Node_CreateDelegate_OutputDelegate) == 0x0000EC, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000100, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetMasterDataManager_IsValid) == 0x000108, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_GetMasterDataManager_ReturnValue) == 0x000110, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Array_Get_Item) == 0x000118, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetReward2, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000149, "Member 'UMG_MatchingMenu_Reward_C_SetReward2::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.SetRewardRanked
// 0x0064 (0x0064 - 0x0000)
struct UMG_MatchingMenu_Reward_C_SetRewardRanked final
{
public:
	ESBRewardSetType                              Param_RewardSetType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8664[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBRewardBoostMissionMasterData        RewardBoostData;                                   // 0x0004(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          RewardBoostIsValid;                                // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8665[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterDungeonRankedReward           MasterDungeonRankedReward;                         // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_ShouldRankedRewardBeAdded_ShouldBeAdded;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataDungeonRankedReward_bExist;  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8666[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterDungeonRankedReward           CallFunc_GetMasterDataDungeonRankedReward_MasterDataDungeonRankedReward; // 0x004C(0x0018)(NoDestructor)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_SetRewardRanked) == 0x000004, "Wrong alignment on UMG_MatchingMenu_Reward_C_SetRewardRanked");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_SetRewardRanked) == 0x000064, "Wrong size on UMG_MatchingMenu_Reward_C_SetRewardRanked");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, Param_RewardSetType) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::Param_RewardSetType' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, RewardBoostData) == 0x000004, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::RewardBoostData' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, RewardBoostIsValid) == 0x00002C, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::RewardBoostIsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, MasterDungeonRankedReward) == 0x000030, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::MasterDungeonRankedReward' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, CallFunc_ShouldRankedRewardBeAdded_ShouldBeAdded) == 0x000048, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::CallFunc_ShouldRankedRewardBeAdded_ShouldBeAdded' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, CallFunc_GetMasterDataDungeonRankedReward_bExist) == 0x000049, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::CallFunc_GetMasterDataDungeonRankedReward_bExist' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardRanked, CallFunc_GetMasterDataDungeonRankedReward_MasterDataDungeonRankedReward) == 0x00004C, "Member 'UMG_MatchingMenu_Reward_C_SetRewardRanked::CallFunc_GetMasterDataDungeonRankedReward_MasterDataDungeonRankedReward' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.SetRewardTower
// 0x0268 (0x0268 - 0x0000)
struct UMG_MatchingMenu_Reward_C_SetRewardTower final
{
public:
	struct FSBRewardBoostMissionMasterData        RewardBoostData;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          RewardBoostIsValid;                                // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8667[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8668[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8669[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_866A[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_866B[0x1];                                     // 0x0057(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMapInfo_IsExists;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_866C[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMapInfo                             CallFunc_GetMapInfo_ReturnValue;                   // 0x0068(0x01E0)()
	bool                                          CallFunc_FindMasterDungeonRankedReward_IsExists;   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_866D[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterDungeonRankedReward           CallFunc_FindMasterDungeonRankedReward_ReturnValue; // 0x024C(0x0018)(NoDestructor)
	bool                                          CallFunc_ShouldTheFirstRewardBeRemoved_Individually_ShouldBeRemoved; // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_SetRewardTower) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_SetRewardTower");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_SetRewardTower) == 0x000268, "Wrong size on UMG_MatchingMenu_Reward_C_SetRewardTower");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, RewardBoostData) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::RewardBoostData' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, RewardBoostIsValid) == 0x000028, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::RewardBoostIsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, Temp_int_Variable) == 0x00002C, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, Temp_int_Variable_1) == 0x000030, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_Conv_IntToByte_ReturnValue) == 0x000034, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_GetValidValue_ReturnValue) == 0x00003C, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x00003D, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00003E, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00003F, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000040, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000044, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000048, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x000049, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x00004A, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, K2Node_SwitchEnum_CmpSuccess) == 0x00004B, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_BooleanAND_ReturnValue) == 0x00004C, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_BooleanAND_ReturnValue_1) == 0x00004D, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_BooleanAND_ReturnValue_2) == 0x00004E, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_MakeLiteralInt_ReturnValue) == 0x000050, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_BooleanAND_ReturnValue_3) == 0x000054, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_Less_IntInt_ReturnValue) == 0x000055, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_GetMasterDataManager_IsValid) == 0x000056, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_GetMasterDataManager_ReturnValue) == 0x000058, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_GetMapInfo_IsExists) == 0x000060, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_GetMapInfo_IsExists' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_GetMapInfo_ReturnValue) == 0x000068, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_GetMapInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_FindMasterDungeonRankedReward_IsExists) == 0x000248, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_FindMasterDungeonRankedReward_IsExists' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_FindMasterDungeonRankedReward_ReturnValue) == 0x00024C, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_FindMasterDungeonRankedReward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetRewardTower, CallFunc_ShouldTheFirstRewardBeRemoved_Individually_ShouldBeRemoved) == 0x000264, "Member 'UMG_MatchingMenu_Reward_C_SetRewardTower::CallFunc_ShouldTheFirstRewardBeRemoved_Individually_ShouldBeRemoved' has a wrong offset!");

// Function UMG_MatchingMenu_Reward.UMG_MatchingMenu_Reward_C.SetCaption
// 0x0088 (0x0088 - 0x0000)
struct UMG_MatchingMenu_Reward_C_SetCaption final
{
public:
	ESBRewardSetType                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_866E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBDungeonEvaluation                          Temp_byte_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_866F[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_6;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_7;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_8;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8670[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_MatchingMenu_Reward_C_SetCaption) == 0x000008, "Wrong alignment on UMG_MatchingMenu_Reward_C_SetCaption");
static_assert(sizeof(UMG_MatchingMenu_Reward_C_SetCaption) == 0x000088, "Wrong size on UMG_MatchingMenu_Reward_C_SetCaption");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_byte_Variable) == 0x000000, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable) == 0x000004, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_1) == 0x000008, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_2) == 0x00000C, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_3) == 0x000010, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_4) == 0x000014, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_5) == 0x000018, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_6) == 0x00001C, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_int_Variable_7) == 0x000020, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_byte_Variable_1) == 0x000024, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable) == 0x000028, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_1) == 0x000030, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_2) == 0x000038, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_3) == 0x000040, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_4) == 0x000048, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_5) == 0x000050, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_6) == 0x000058, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_7) == 0x000060, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, Temp_object_Variable_8) == 0x000068, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000070, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, K2Node_Select_Default) == 0x000074, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, K2Node_Select_Default_1) == 0x000078, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_Reward_C_SetCaption, K2Node_SwitchEnum_CmpSuccess) == 0x000080, "Member 'UMG_MatchingMenu_Reward_C_SetCaption::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
