#pragma once

 

// Package: UMG_PhotoModeControllCheckBox

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_OnCheckStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.ExecuteUbergraph_UMG_PhotoModeControllCheckBox
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bValue_1;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOnlyDisplay;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9CE0[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9CE1[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonToolTipText_Variable_C*      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	float                                         K2Node_CustomEvent_Def;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bValue;                         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9CE2[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9CE3[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox) == 0x000008, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox) == 0x0000A8, "Wrong size on UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, EntryPoint) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, Temp_bool_Variable) == 0x000006, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, Temp_bool_Variable_1) == 0x000007, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, Temp_name_Variable) == 0x000008, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, Temp_name_Variable_1) == 0x000010, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, Temp_bool_Variable_2) == 0x000018, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000019, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_ComponentBoundEvent_bIsChecked) == 0x00001B, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_CustomEvent_bValue_1) == 0x00001C, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_CustomEvent_bValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_CustomEvent_bOnlyDisplay) == 0x00001D, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_CustomEvent_bOnlyDisplay' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001E, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_Select_Default) == 0x000028, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_Create_ReturnValue) == 0x000030, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x000038, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_CustomEvent_Def) == 0x000060, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_CustomEvent_Def' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_CustomEvent_bValue) == 0x000064, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_CustomEvent_bValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000065, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_Select_Default_1) == 0x000068, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_Not_PreBool_ReturnValue) == 0x000070, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_GetTextFromAssetByName_ReturnValue_1) == 0x000078, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_GetTextFromAssetByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox, K2Node_Select_Default_2) == 0x0000A1, "Member 'UMG_PhotoModeControllCheckBox_C_ExecuteUbergraph_UMG_PhotoModeControllCheckBox::K2Node_Select_Default_2' has a wrong offset!");

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.SetEnableDOF
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_SetEnableDOF final
{
public:
	bool                                          Param_bValue;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_SetEnableDOF) == 0x000001, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_SetEnableDOF");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_SetEnableDOF) == 0x000001, "Wrong size on UMG_PhotoModeControllCheckBox_C_SetEnableDOF");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_SetEnableDOF, Param_bValue) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_SetEnableDOF::Param_bValue' has a wrong offset!");

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.SetDof
// 0x0004 (0x0004 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_SetDof final
{
public:
	float                                         Def;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_SetDof) == 0x000004, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_SetDof");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_SetDof) == 0x000004, "Wrong size on UMG_PhotoModeControllCheckBox_C_SetDof");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_SetDof, Def) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_SetDof::Def' has a wrong offset!");

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.SetValue
// 0x0002 (0x0002 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_SetValue final
{
public:
	bool                                          Param_bValue;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bOnlyDisplay;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_SetValue) == 0x000001, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_SetValue");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_SetValue) == 0x000002, "Wrong size on UMG_PhotoModeControllCheckBox_C_SetValue");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_SetValue, Param_bValue) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_SetValue::Param_bValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_SetValue, bOnlyDisplay) == 0x000001, "Member 'UMG_PhotoModeControllCheckBox_C_SetValue::bOnlyDisplay' has a wrong offset!");

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_BndEvt__SBCheckBoxCmnCheckBox01_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function UMG_PhotoModeControllCheckBox.UMG_PhotoModeControllCheckBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoModeControllCheckBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoModeControllCheckBox_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_PhotoModeControllCheckBox_C_PreConstruct");
static_assert(sizeof(UMG_PhotoModeControllCheckBox_C_PreConstruct) == 0x000001, "Wrong size on UMG_PhotoModeControllCheckBox_C_PreConstruct");
static_assert(offsetof(UMG_PhotoModeControllCheckBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_PhotoModeControllCheckBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

