#pragma once

 

// Package: UMG_LiquidMemoryBottleStatus

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function UMG_LiquidMemoryBottleStatus.UMG_LiquidMemoryBottleStatus_C.ExecuteUbergraph_UMG_LiquidMemoryBottleStatus
// 0x0070 (0x0070 - 0x0000)
struct UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6599[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659B[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659C[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659D[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659E[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659F[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A0[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_LiquidMemoryUnfilledIcon_C*        CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus) == 0x000008, "Wrong alignment on UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus");
static_assert(sizeof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus) == 0x000070, "Wrong size on UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, EntryPoint) == 0x000000, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, Temp_int_Variable) == 0x000004, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000C, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_GetChildrenCount_ReturnValue) == 0x00001C, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000020, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000038, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000040, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, Temp_int_Variable_1) == 0x000044, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, K2Node_Event_IsDesignTime) == 0x000054, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00005C, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_Create_ReturnValue) == 0x000060, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000068, "Member 'UMG_LiquidMemoryBottleStatus_C_ExecuteUbergraph_UMG_LiquidMemoryBottleStatus::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function UMG_LiquidMemoryBottleStatus.UMG_LiquidMemoryBottleStatus_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_LiquidMemoryBottleStatus_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryBottleStatus_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_LiquidMemoryBottleStatus_C_PreConstruct");
static_assert(sizeof(UMG_LiquidMemoryBottleStatus_C_PreConstruct) == 0x000001, "Wrong size on UMG_LiquidMemoryBottleStatus_C_PreConstruct");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_LiquidMemoryBottleStatus_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_LiquidMemoryBottleStatus.UMG_LiquidMemoryBottleStatus_C.SetBottleStatus
// 0x00F0 (0x00F0 - 0x0000)
struct UMG_LiquidMemoryBottleStatus_C_SetBottleStatus final
{
public:
	struct FSBLiquidMemoryInfo                    InLiquidMemoryInfo;                                // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         TmpCurrLevel;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpLiquidMemoryId;                                 // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpBottleAccumulateLimit;                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpCurrAccumulatedAmount;                          // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A1[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A2[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A3[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A4[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A5[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindLiquidMemoryMaster_IsExists;       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A6[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLiquidMemoryMasterData              CallFunc_BP_FindLiquidMemoryMaster_ReturnValue;    // 0x0090(0x0038)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A7[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65A8[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus) == 0x000008, "Wrong alignment on UMG_LiquidMemoryBottleStatus_C_SetBottleStatus");
static_assert(sizeof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus) == 0x0000F0, "Wrong size on UMG_LiquidMemoryBottleStatus_C_SetBottleStatus");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, InLiquidMemoryInfo) == 0x000000, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::InLiquidMemoryInfo' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, TmpCurrLevel) == 0x000028, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::TmpCurrLevel' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, TmpLiquidMemoryId) == 0x00002C, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::TmpLiquidMemoryId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, TmpBottleAccumulateLimit) == 0x000030, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::TmpBottleAccumulateLimit' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, TmpCurrAccumulatedAmount) == 0x000034, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::TmpCurrAccumulatedAmount' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, Temp_bool_Variable) == 0x000038, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, Temp_int_Variable) == 0x00003C, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Multiply_IntInt_ReturnValue) == 0x000044, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, Temp_byte_Variable) == 0x000049, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Less_IntInt_ReturnValue) == 0x00004A, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000050, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000054, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Percent_IntInt_ReturnValue) == 0x000058, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000064, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000068, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Divide_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Less_IntInt_ReturnValue_1) == 0x000070, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_GetMasterDataManager_IsValid) == 0x000078, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_GetMasterDataManager_ReturnValue) == 0x000080, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, Temp_byte_Variable_1) == 0x000088, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_BP_FindLiquidMemoryMaster_IsExists) == 0x000089, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_BP_FindLiquidMemoryMaster_IsExists' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_BP_FindLiquidMemoryMaster_ReturnValue) == 0x000090, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_BP_FindLiquidMemoryMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, K2Node_Select_Default) == 0x0000C8, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, Temp_int_Variable_1) == 0x0000CC, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_GetChildAt_ReturnValue) == 0x0000D0, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D9, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000DC, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_GetChildrenCount_ReturnValue) == 0x0000E0, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000E4, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000E8, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleStatus, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E9, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleStatus::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function UMG_LiquidMemoryBottleStatus.UMG_LiquidMemoryBottleStatus_C.SetBottleAccumulatedRate_One
// 0x0020 (0x0020 - 0x0000)
struct UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One final
{
public:
	int32                                         InBottleId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumlatedRate;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_LiquidMemoryUnfilledIcon_C*        K2Node_DynamicCast_AsUMG_Liquid_Memory_Unfilled_Icon; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One) == 0x000008, "Wrong alignment on UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One");
static_assert(sizeof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One) == 0x000020, "Wrong size on UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One, InBottleId) == 0x000000, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One::InBottleId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One, AccumlatedRate) == 0x000004, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One::AccumlatedRate' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One, K2Node_DynamicCast_AsUMG_Liquid_Memory_Unfilled_Icon) == 0x000010, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One::K2Node_DynamicCast_AsUMG_Liquid_Memory_Unfilled_Icon' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleAccumulatedRate_One::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_LiquidMemoryBottleStatus.UMG_LiquidMemoryBottleStatus_C.SetBottleLiquidMemory_One
// 0x0028 (0x0028 - 0x0000)
struct UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One final
{
public:
	int32                                         InBottleId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLiquidMemoryId;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InAccumulatedRate;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65A9[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_LiquidMemoryUnfilledIcon_C*        K2Node_DynamicCast_AsUMG_Liquid_Memory_Unfilled_Icon; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One) == 0x000008, "Wrong alignment on UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One");
static_assert(sizeof(UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One) == 0x000028, "Wrong size on UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One, InBottleId) == 0x000000, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One::InBottleId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One, InLiquidMemoryId) == 0x000004, "Member 'UMG_LiquidMemoryBottleStatus_C_SetBottleLiquidMemory_One::InLiquidMemoryId' has a wrong offset!");
