#pragma once

 

// Package: UMG_RewardBoostTooltopElement

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UMG_RewardBoostTooltopElement.UMG_RewardBoostTooltopElement_C.ExecuteUbergraph_UMG_RewardBoostTooltopElement
// 0x0090 (0x0090 - 0x0000)
struct UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBRewardBoostTooltipData              K2Node_CustomEvent_Data;                           // 0x0018(0x0030)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA4[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA5[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	bool                                          CallFunc_NotEqual_DateTimeDateTime_ReturnValue;    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement) == 0x000008, "Wrong alignment on UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement");
static_assert(sizeof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement) == 0x000090, "Wrong size on UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, EntryPoint) == 0x000000, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_DateTimeMinValue_ReturnValue) == 0x000008, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000011, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000012, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, Temp_bool_Variable) == 0x000013, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, Temp_bool_Variable_1) == 0x000014, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, Temp_bool_Variable_2) == 0x000015, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000016, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000017, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, K2Node_CustomEvent_Data) == 0x000018, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, K2Node_Select_Default) == 0x000069, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_NotEqual_DateTimeDateTime_ReturnValue) == 0x000088, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_NotEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000089, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, K2Node_Select_Default_1) == 0x00008A, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement, K2Node_Select_Default_2) == 0x00008B, "Member 'UMG_RewardBoostTooltopElement_C_ExecuteUbergraph_UMG_RewardBoostTooltopElement::K2Node_Select_Default_2' has a wrong offset!");

// Function UMG_RewardBoostTooltopElement.UMG_RewardBoostTooltopElement_C.SetData
// 0x0030 (0x0030 - 0x0000)
struct UMG_RewardBoostTooltopElement_C_SetData final
{
public:
	struct FSBRewardBoostTooltipData              Data;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_RewardBoostTooltopElement_C_SetData) == 0x000008, "Wrong alignment on UMG_RewardBoostTooltopElement_C_SetData");
static_assert(sizeof(UMG_RewardBoostTooltopElement_C_SetData) == 0x000030, "Wrong size on UMG_RewardBoostTooltopElement_C_SetData");
static_assert(offsetof(UMG_RewardBoostTooltopElement_C_SetData, Data) == 0x000000, "Member 'UMG_RewardBoostTooltopElement_C_SetData::Data' has a wrong offset!");

}

