#pragma once

 

// Package: UMG_LiquidMemoryActivateListItem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.OnBtnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_OnBtnHovered__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.OnBtnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_OnBtnUnhovered__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.OnBtnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_OnBtnSelected__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.OnAdd__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_OnAdd__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.OnSub__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_OnSub__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.OnPopupTokenList__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature final
{
public:
	int32                                         Param_LiquidMemoryId;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullCharge;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature) == 0x000004, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature, Param_LiquidMemoryId) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature::Param_LiquidMemoryId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature, IsFullCharge) == 0x000004, "Member 'UMG_LiquidMemoryActivateListItem_C_OnPopupTokenList__DelegateSignature::IsFullCharge' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.ExecuteUbergraph_UMG_LiquidMemoryActivateListItem
// 0x00A8 (0x00A8 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindLiquidMemoryMaster_IsExists;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLiquidMemoryMasterData              CallFunc_BP_FindLiquidMemoryMaster_ReturnValue;    // 0x0018(0x0038)()
	class FString                                 CallFunc_GetLiquidMemoryText_ReturnValue;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FString                                 CallFunc_GetLiquidMemoryText_ReturnValue_1;        // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	int32                                         K2Node_CustomEvent_id;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem) == 0x0000A8, "Wrong size on UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, EntryPoint) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_GetMasterDataManager_IsValid) == 0x000004, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_GetMasterDataManager_ReturnValue) == 0x000008, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_BP_FindLiquidMemoryMaster_IsExists) == 0x000010, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_BP_FindLiquidMemoryMaster_IsExists' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_BP_FindLiquidMemoryMaster_ReturnValue) == 0x000018, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_BP_FindLiquidMemoryMaster_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_GetLiquidMemoryText_ReturnValue) == 0x000050, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_GetLiquidMemoryText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_GetLiquidMemoryText_ReturnValue_1) == 0x000078, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_GetLiquidMemoryText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000088, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, K2Node_CustomEvent_id) == 0x0000A0, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::K2Node_CustomEvent_id' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem, K2Node_CustomEvent_Level) == 0x0000A4, "Member 'UMG_LiquidMemoryActivateListItem_C_ExecuteUbergraph_UMG_LiquidMemoryActivateListItem::K2Node_CustomEvent_Level' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.SetLiquidMemoryInfo
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo) == 0x000004, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo) == 0x000008, "Wrong size on UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo, ID) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo::ID' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo, Level) == 0x000004, "Member 'UMG_LiquidMemoryActivateListItem_C_SetLiquidMemoryInfo::Level' has a wrong offset!");

// Function UMG_LiquidMemoryActivateListItem.UMG_LiquidMemoryActivateListItem_C.UpdateBottleStatus
// 0x02A0 (0x02A0 - 0x0000)
struct UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus final
{
public:
	int32                                         InLiquidMemoryId;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLiquidMemoryInfo                    LiquidMemoryInfo;                                  // 0x0008(0x0028)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501E[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501F[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5020[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5021[0x4];                                     // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0130(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0140(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0198(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5022[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0018)()
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5023[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5024[0x5];                                     // 0x01DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0200(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0218(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0230(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0248(0x0018)()
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5025[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindOwnLiquidMemoryInfo_OutExists;        // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5026[0x7];                                     // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBLiquidMemoryInfo                    CallFunc_FindOwnLiquidMemoryInfo_ReturnValue;      // 0x0278(0x0028)(NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus) == 0x000008, "Wrong alignment on UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus");
static_assert(sizeof(UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus) == 0x0002A0, "Wrong size on UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus, InLiquidMemoryId) == 0x000000, "Member 'UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus::InLiquidMemoryId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus, LiquidMemoryInfo) == 0x000008, "Member 'UMG_LiquidMemoryActivateListItem_C_UpdateBottleStatus::LiquidMemoryInfo' has a wrong offset!");
