#pragma once

 

// Package: UMG_AestheShopStepInfo

#include "Basic.hpp"

#include "E_AestheShop_Step_structs.hpp"


namespace SDK::Params
{

// Function UMG_AestheShopStepInfo.UMG_AestheShopStepInfo_C.ExecuteUbergraph_UMG_AestheShopStepInfo
// 0x0058 (0x0058 - 0x0000)
struct UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B51[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_AestheShopStepInfo_StepIcon_C*     CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B52[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B53[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AestheShop_Step                             Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B54[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B55[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B56[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo) == 0x000008, "Wrong alignment on UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo");
static_assert(sizeof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo) == 0x000058, "Wrong size on UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, EntryPoint) == 0x000000, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000010, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, Temp_int_Variable) == 0x000018, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, Temp_int_Variable_1) == 0x00001C, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_Conv_IntToByte_ReturnValue) == 0x000020, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_GetValidValue_ReturnValue) == 0x000028, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000029, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00002A, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00002C, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, Temp_byte_Variable) == 0x000030, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, Temp_int_Variable_2) == 0x000034, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, Temp_int_Variable_3) == 0x000038, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, Temp_int_Variable_4) == 0x00003C, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, K2Node_Event_IsDesignTime) == 0x000040, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, K2Node_Select_Default) == 0x000044, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_MakeLiteralInt_ReturnValue) == 0x00004C, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'UMG_AestheShopStepInfo_C_ExecuteUbergraph_UMG_AestheShopStepInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_AestheShopStepInfo.UMG_AestheShopStepInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_AestheShopStepInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AestheShopStepInfo_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_AestheShopStepInfo_C_PreConstruct");
static_assert(sizeof(UMG_AestheShopStepInfo_C_PreConstruct) == 0x000001, "Wrong size on UMG_AestheShopStepInfo_C_PreConstruct");
static_assert(offsetof(UMG_AestheShopStepInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_AestheShopStepInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_AestheShopStepInfo.UMG_AestheShopStepInfo_C.SetStep
// 0x0058 (0x0058 - 0x0000)
struct UMG_AestheShopStepInfo_C_SetStep final
{
public:
	E_AestheShop_Step                             InStep;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B57[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_AestheShopStepInfo_StepIcon_C*     TmpStepIcon;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AestheShop_Step                             TmpLoopStep;                                       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_AestheShop_Step                             TmpStep;                                           // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B58[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B59[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B5A[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B5B[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B5C[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_AestheShopStepInfo_StepIcon_C*     K2Node_DynamicCast_AsUMG_Aesthe_Shop_Step_Info_Step_Icon; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AestheShopStepInfo_C_SetStep) == 0x000008, "Wrong alignment on UMG_AestheShopStepInfo_C_SetStep");
static_assert(sizeof(UMG_AestheShopStepInfo_C_SetStep) == 0x000058, "Wrong size on UMG_AestheShopStepInfo_C_SetStep");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, InStep) == 0x000000, "Member 'UMG_AestheShopStepInfo_C_SetStep::InStep' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, TmpStepIcon) == 0x000008, "Member 'UMG_AestheShopStepInfo_C_SetStep::TmpStepIcon' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, TmpLoopStep) == 0x000010, "Member 'UMG_AestheShopStepInfo_C_SetStep::TmpLoopStep' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, TmpStep) == 0x000011, "Member 'UMG_AestheShopStepInfo_C_SetStep::TmpStep' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, Temp_int_Variable) == 0x000014, "Member 'UMG_AestheShopStepInfo_C_SetStep::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, Temp_int_Variable_1) == 0x000018, "Member 'UMG_AestheShopStepInfo_C_SetStep::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001C, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_GetValidValue_ReturnValue) == 0x000024, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000025, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000026, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000028, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_MakeLiteralInt_ReturnValue) == 0x00002C, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000031, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000034, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_GetChildAt_ReturnValue) == 0x000038, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'UMG_AestheShopStepInfo_C_SetStep::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, K2Node_DynamicCast_AsUMG_Aesthe_Shop_Step_Info_Step_Icon) == 0x000048, "Member 'UMG_AestheShopStepInfo_C_SetStep::K2Node_DynamicCast_AsUMG_Aesthe_Shop_Step_Info_Step_Icon' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_C_SetStep, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UMG_AestheShopStepInfo_C_SetStep::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

