#pragma once

 

// Package: UMG_PhotoModeControlMenuSkillList

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function UMG_PhotoModeControlMenuSkillList.UMG_PhotoModeControlMenuSkillList_C.OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature final
{
public:
	class UCharaCreateClassSkillMenuItem_C*       Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature");
static_assert(sizeof(UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature, Sender) == 0x000000, "Member 'UMG_PhotoModeControlMenuSkillList_C_OnPressed__DelegateSignature::Sender' has a wrong offset!");

// Function UMG_PhotoModeControlMenuSkillList.UMG_PhotoModeControlMenuSkillList_C.OnReleased__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature final
{
public:
	class UCharaCreateClassSkillMenuItem_C*       Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature) == 0x000008, "Wrong alignment on UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature");
static_assert(sizeof(UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature) == 0x000008, "Wrong size on UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature, Sender) == 0x000000, "Member 'UMG_PhotoModeControlMenuSkillList_C_OnReleased__DelegateSignature::Sender' has a wrong offset!");

// Function UMG_PhotoModeControlMenuSkillList.UMG_PhotoModeControlMenuSkillList_C.ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList
// 0x0018 (0x0018 - 0x0000)
struct UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A88[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaCreateClassSkillMenuItem_C*       K2Node_CustomEvent_Sender;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharaCreateClassSkillMenuItem_C*       K2Node_CustomEvent_Sender_1;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList) == 0x000008, "Wrong alignment on UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList");
static_assert(sizeof(UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList) == 0x000018, "Wrong size on UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList, EntryPoint) == 0x000000, "Member 'UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList, K2Node_CustomEvent_Sender) == 0x000008, "Member 'UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList::K2Node_CustomEvent_Sender' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList, K2Node_CustomEvent_Sender_1) == 0x000010, "Member 'UMG_PhotoModeControlMenuSkillList_C_ExecuteUbergraph_UMG_PhotoModeControlMenuSkillList::K2Node_CustomEvent_Sender_1' has a wrong offset!");

// Function UMG_PhotoModeControlMenuSkillList.UMG_PhotoModeControlMenuSkillList_C.OnItemButtonReleased
// 0x0008 (0x0008 - 0x0000)
struct UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased final
{
public:
	class UCharaCreateClassSkillMenuItem_C*       Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased) == 0x000008, "Wrong alignment on UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased");
static_assert(sizeof(UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased) == 0x000008, "Wrong size on UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased, Sender) == 0x000000, "Member 'UMG_PhotoModeControlMenuSkillList_C_OnItemButtonReleased::Sender' has a wrong offset!");

// Function UMG_PhotoModeControlMenuSkillList.UMG_PhotoModeControlMenuSkillList_C.OnItemButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed final
{
public:
	class UCharaCreateClassSkillMenuItem_C*       Sender;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed) == 0x000008, "Wrong alignment on UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed");
static_assert(sizeof(UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed) == 0x000008, "Wrong size on UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed, Sender) == 0x000000, "Member 'UMG_PhotoModeControlMenuSkillList_C_OnItemButtonPressed::Sender' has a wrong offset!");

// Function UMG_PhotoModeControlMenuSkillList.UMG_PhotoModeControlMenuSkillList_C.UpdateSkillList
// 0x03E8 (0x03E8 - 0x0000)
struct UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList final
{
public:
	class ASBPlayerCharacter*                     PC;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBSkillDataMasterData                 SkillData;                                         // 0x0008(0x0058)(Edit, BlueprintVisible)
	class USBMasterDataManager*                   MasterDataManager;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBSkillInfoClass*                      SkillInfo;                                         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ESkillActionPosition>                  SkillActionPosList;                                // 0x0070(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Variable;                                 // 0x0080(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0084(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0088(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x008C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0090(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0094(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_6;                               // 0x0098(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x009C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_8;                               // 0x00A0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x00A4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_10;                              // 0x00A8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x00AC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_12;                              // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x00B4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_14;                              // 0x00B8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_15;                              // 0x00BC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_16;                              // 0x00C0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_17;                              // 0x00C4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_18;                              // 0x00C8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_19;                              // 0x00CC(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_20;                              // 0x00D0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_21;                              // 0x00D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A89[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMasterSkillDataText_ReturnValue;       // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	int32                                         CallFunc_GetSkillID_ReturnValue;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSkillID_ReturnValue_1;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMasterySkill_ReturnValue;               // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A8A[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_22;                              // 0x0118(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          Temp_byte_Variable;                                // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A8B[0x1];                                     // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A8C[0x4];                                     // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A8D[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          CallFunc_Array_Get_Item_1;                         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A8E[0x1];                                     // 0x016F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0170(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A8F[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A90[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0190(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBPlayerSkillPaletteSide                     CallFunc_GetCurrentSkillPaletteSide_ReturnValue;   // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          Temp_byte_Variable_1;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          Temp_byte_Variable_2;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A91[0x1];                                     // 0x01B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetImagineName_ReturnValue;               // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A92[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindMasterImagineByArtsName_ReturnValue;  // 0x01C0(0x00B0)()
	class FString                                 CallFunc_GetMasterImagineText_ReturnValue;         // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	const class USBSkillInfoClass*                CallFunc_GetSkillInfo_ReturnValue;                 // 0x0280(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0288(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          Temp_byte_Variable_3;                              // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          K2Node_Select_Default_1;                           // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          Temp_byte_Variable_4;                              // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillActionPosition                          Temp_byte_Variable_5;                              // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          K2Node_Select_Default_2;                           // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          Temp_byte_Variable_6;                              // 0x02A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x02A8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A93[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindSkillDataDataBySkillId_IsExists;      // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A94[0x6];                                     // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 CallFunc_FindSkillDataDataBySkillId_ReturnValue;   // 0x02F0(0x0058)()
	ESkillActionPosition                          K2Node_Select_Default_3;                           // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A95[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x0350(0x0010)(ReferenceParm)
	ESkillActionPosition                          Temp_byte_Variable_7;                              // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A96[0x7];                                     // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerCharacter*                     CallFunc_GetSBPlayerCharacter_ReturnValue;         // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESkillActionPosition                          Temp_byte_Variable_8;                              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A97[0x7];                                     // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillActionPosition                          K2Node_Select_Default_4;                           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A98[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharaCreateClassSkillMenuItem_C*       CallFunc_Create_ReturnValue;                       // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ESkillActionPosition>                  K2Node_MakeArray_Array_3;                          // 0x03B0(0x0010)(ReferenceParm)
	TDelegate<void(class UCharaCreateClassSkillMenuItem_C* Sender)> K2Node_CreateDelegate_OutputDelegate;              // 0x03C0(0x0010)(ZeroConstructor, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCharaCreateClassSkillMenuItem_C* Sender)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList) == 0x000008, "Wrong alignment on UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList");
static_assert(sizeof(UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList) == 0x0003E8, "Wrong size on UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList, PC) == 0x000000, "Member 'UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList::PC' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList, SkillData) == 0x000008, "Member 'UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList::SkillData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList, MasterDataManager) == 0x000060, "Member 'UMG_PhotoModeControlMenuSkillList_C_UpdateSkillList::MasterDataManager' has a wrong offset!");
