#pragma once

 

// Package: UMG_MatchingMenu_EntryConditionClass

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchingMenu_EntryConditionClass.UMG_MatchingMenu_EntryConditionClass_C.ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass
// 0x0050 (0x0050 - 0x0000)
struct UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MatchingMenu_EntryConditionClassItem_C* CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ESBClassType>                          K2Node_CustomEvent_Class;                          // 0x0018(0x0010)(ConstParm, ReferenceParm)
	ESBClassType                                  CallFunc_Array_Get_Item;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86B4[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86B5[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass) == 0x000008, "Wrong alignment on UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass");
static_assert(sizeof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass) == 0x000050, "Wrong size on UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, EntryPoint) == 0x000000, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_Create_ReturnValue) == 0x000010, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, K2Node_CustomEvent_Class) == 0x000018, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::K2Node_CustomEvent_Class' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_Array_Get_Item) == 0x000028, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_AddChild_ReturnValue) == 0x000038, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'UMG_MatchingMenu_EntryConditionClass_C_ExecuteUbergraph_UMG_MatchingMenu_EntryConditionClass::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UMG_MatchingMenu_EntryConditionClass.UMG_MatchingMenu_EntryConditionClass_C.SetClass
// 0x0010 (0x0010 - 0x0000)
struct UMG_MatchingMenu_EntryConditionClass_C_SetClass final
{
public:
	TArray<ESBClassType>                          Param_Class;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_MatchingMenu_EntryConditionClass_C_SetClass) == 0x000008, "Wrong alignment on UMG_MatchingMenu_EntryConditionClass_C_SetClass");
static_assert(sizeof(UMG_MatchingMenu_EntryConditionClass_C_SetClass) == 0x000010, "Wrong size on UMG_MatchingMenu_EntryConditionClass_C_SetClass");
static_assert(offsetof(UMG_MatchingMenu_EntryConditionClass_C_SetClass, Param_Class) == 0x000000, "Member 'UMG_MatchingMenu_EntryConditionClass_C_SetClass::Param_Class' has a wrong offset!");

}

