#pragma once

 

// Package: UMG_AestheShopStepInfo_StepIcon

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_AestheShopStepInfo_StepIcon.UMG_AestheShopStepInfo_StepIcon_C.ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon
// 0x0008 (0x0008 - 0x0000)
struct UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon) == 0x000004, "Wrong alignment on UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon");
static_assert(sizeof(UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon) == 0x000008, "Wrong size on UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon, EntryPoint) == 0x000000, "Member 'UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_AestheShopStepInfo_StepIcon_C_ExecuteUbergraph_UMG_AestheShopStepInfo_StepIcon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_AestheShopStepInfo_StepIcon.UMG_AestheShopStepInfo_StepIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_AestheShopStepInfo_StepIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AestheShopStepInfo_StepIcon_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_AestheShopStepInfo_StepIcon_C_PreConstruct");
static_assert(sizeof(UMG_AestheShopStepInfo_StepIcon_C_PreConstruct) == 0x000001, "Wrong size on UMG_AestheShopStepInfo_StepIcon_C_PreConstruct");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_AestheShopStepInfo_StepIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_AestheShopStepInfo_StepIcon.UMG_AestheShopStepInfo_StepIcon_C.SetIconSelected
// 0x0018 (0x0018 - 0x0000)
struct UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected final
{
public:
	bool                                          InIsSelected;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EAA[0x1];                                      // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected) == 0x000008, "Wrong alignment on UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected");
static_assert(sizeof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected) == 0x000018, "Wrong size on UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, InIsSelected) == 0x000000, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::InIsSelected' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, Temp_byte_Variable) == 0x000001, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, Temp_byte_Variable_1) == 0x000002, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, Temp_bool_Variable) == 0x000003, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, Temp_byte_Variable_2) == 0x000004, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, Temp_byte_Variable_3) == 0x000005, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, K2Node_Select_Default) == 0x000006, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, Temp_bool_Variable_1) == 0x000010, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected, K2Node_Select_Default_1) == 0x000011, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetIconSelected::K2Node_Select_Default_1' has a wrong offset!");

// Function UMG_AestheShopStepInfo_StepIcon.UMG_AestheShopStepInfo_StepIcon_C.SetTitleTextId
// 0x0004 (0x0004 - 0x0000)
struct UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId final
{
public:
	int32                                         InTextID;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId) == 0x000004, "Wrong alignment on UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId");
static_assert(sizeof(UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId) == 0x000004, "Wrong size on UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId");
static_assert(offsetof(UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId, InTextID) == 0x000000, "Member 'UMG_AestheShopStepInfo_StepIcon_C_SetTitleTextId::InTextID' has a wrong offset!");

}

