#pragma once

 

// Package: UMG_MatchingMenu_PlayerInfo

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function UMG_MatchingMenu_PlayerInfo.UMG_MatchingMenu_PlayerInfo_C.ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo
// 0x00B0 (0x00B0 - 0x0000)
struct UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B86[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_ImageURL;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBDownloadImageImpl*                   CallFunc_DownloadImage_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B87[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetClassLevel_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	int32                                         CallFunc_GetTotalPower_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B88[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
	ESBClassType                                  CallFunc_GetClassType_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B89[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetFaceImageURL_ReturnValue;              // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassNameText_ReturnValue;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
};
static_assert(alignof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo) == 0x000008, "Wrong alignment on UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo");
static_assert(sizeof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo) == 0x0000B0, "Wrong size on UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, EntryPoint) == 0x000000, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, K2Node_CustomEvent_ImageURL) == 0x000008, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::K2Node_CustomEvent_ImageURL' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_DownloadImage_ReturnValue) == 0x000018, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_DownloadImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_GetClassLevel_ReturnValue) == 0x000024, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_GetClassLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_GetTotalPower_ReturnValue) == 0x000040, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_GetTotalPower_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_GetClassType_ReturnValue) == 0x000060, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_GetClassType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_GetCharacterId_ReturnValue) == 0x000068, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_GetFaceImageURL_ReturnValue) == 0x000078, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_GetFaceImageURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_GetClassNameText_ReturnValue) == 0x000088, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_GetClassNameText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'UMG_MatchingMenu_PlayerInfo_C_ExecuteUbergraph_UMG_MatchingMenu_PlayerInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_MatchingMenu_PlayerInfo.UMG_MatchingMenu_PlayerInfo_C.DownLoadFaceImage_Event
// 0x0010 (0x0010 - 0x0000)
struct UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event final
{
public:
	class FString                                 ImageUrl;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event) == 0x000008, "Wrong alignment on UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event");
static_assert(sizeof(UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event) == 0x000010, "Wrong size on UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event");
static_assert(offsetof(UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event, ImageUrl) == 0x000000, "Member 'UMG_MatchingMenu_PlayerInfo_C_DownLoadFaceImage_Event::ImageUrl' has a wrong offset!");

}

