#pragma once

 

// Package: UMG_AdminGotoBookmarkRegistrationWindowItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_AdminGotoBookmarkRegistrationWindowItem.UMG_AdminGotoBookmarkRegistrationWindowItem_C.OnTextChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature");
static_assert(sizeof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature) == 0x000018, "Wrong size on UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

// Function UMG_AdminGotoBookmarkRegistrationWindowItem.UMG_AdminGotoBookmarkRegistrationWindowItem_C.ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem
// 0x0020 (0x0020 - 0x0000)
struct UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43CA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem) == 0x000008, "Wrong alignment on UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem");
static_assert(sizeof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem) == 0x000020, "Wrong size on UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem, EntryPoint) == 0x000000, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_ExecuteUbergraph_UMG_AdminGotoBookmarkRegistrationWindowItem::K2Node_ComponentBoundEvent_Text' has a wrong offset!");

// Function UMG_AdminGotoBookmarkRegistrationWindowItem.UMG_AdminGotoBookmarkRegistrationWindowItem_C.BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_BndEvt__EditableText_0_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function UMG_AdminGotoBookmarkRegistrationWindowItem.UMG_AdminGotoBookmarkRegistrationWindowItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct");
static_assert(sizeof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct) == 0x000001, "Wrong size on UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_AdminGotoBookmarkRegistrationWindowItem.UMG_AdminGotoBookmarkRegistrationWindowItem_C.GetText
// 0x0038 (0x0038 - 0x0000)
struct UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText) == 0x000008, "Wrong alignment on UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText");
static_assert(sizeof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText) == 0x000038, "Wrong size on UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText, Text) == 0x000000, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText::Text' has a wrong offset!");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_GetText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function UMG_AdminGotoBookmarkRegistrationWindowItem.UMG_AdminGotoBookmarkRegistrationWindowItem_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText final
{
public:
	class FString                                 InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText) == 0x000008, "Wrong alignment on UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText");
static_assert(sizeof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText) == 0x000028, "Wrong size on UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText, InText) == 0x000000, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText::InText' has a wrong offset!");
static_assert(offsetof(UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'UMG_AdminGotoBookmarkRegistrationWindowItem_C_SetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

