#pragma once

 

// Package: UMG_PhotoModePlayerListItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function UMG_PhotoModePlayerListItem.UMG_PhotoModePlayerListItem_C.ExecuteUbergraph_UMG_PhotoModePlayerListItem
// 0x01A8 (0x01A8 - 0x0000)
struct UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B5D[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetRestrictText_ReturnValue;              // 0x0010(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B5E[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B5F[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_4;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B60[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_7;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B61[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_8;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_9;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B62[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_10;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_11;                              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B63[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_12;                              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_13;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B64[0x5];                                     // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBPhotoModePlayerControlData*          K2Node_Event_InData;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponVisibility_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabledLookActive_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidRequestEmoteName_ReturnValue;      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidLastEmoteName_ReturnValue;         // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanControlClone_ReturnValue;              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B65[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterId_ReturnValue;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerVisible_ReturnValue;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanControlMotionStop_ReturnValue;         // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanControlVisibility_ReturnValue;         // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabledLookAtEyeActive_ReturnValue;     // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFixHead_ReturnValue;                    // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFixEye_ReturnValue;                     // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLookAtEyeActive_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLookAtActive_ReturnValue;               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMotionStop_ReturnValue;                 // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCloneCharacter_ReturnValue;        // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default_1;                           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B66[0x3];                                     // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_3;                           // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponVisibility_ReturnValue_1;        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerVisible_ReturnValue_1;            // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMotionStop_ReturnValue_1;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCloneCharacter_ReturnValue_1;      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B67[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPhotoModeController*                 CallFunc_GetPhotoModeController_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B68[0x2];                                     // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B69[0x5];                                     // 0x00E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPhotoModeController*                 CallFunc_GetPhotoModeController_ReturnValue_1;     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAllWeaponVisibility_ReturnValue;       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAllWeaponVisibility_ReturnValue_1;     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllMotionStop_ReturnValue;              // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllClone_ReturnValue;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllVisible_ReturnValue;                 // 0x00F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllEnabledLookActive_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanControlAllClone_ReturnValue;           // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllEnabledLookAtEyeActive_ReturnValue;  // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllFixEye_ReturnValue;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllLookAtEyeActive_ReturnValue;         // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllFixHead_ReturnValue;                 // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllLookAtActive_ReturnValue;            // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllClone_ReturnValue_1;                 // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllMotionStop_ReturnValue_1;            // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B6A[0x1];                                     // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_6;                           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_7;                           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanControlAllMotionStop_ReturnValue;      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllVisible_ReturnValue_1;               // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B6B[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBPhotoModeController*                 CallFunc_GetPhotoModeController_ReturnValue_2;     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_8;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShowDebugUi_ReturnValue;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_10;                          // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B6C[0x2];                                     // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterId_ReturnValue_1;             // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B6D[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterName_ReturnValue;             // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBPlatformInfo                        CallFunc_GetPlatformInfo_ReturnValue;              // 0x0150(0x0020)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0170(0x0018)()
	bool                                          CallFunc_CheckXboxPrivacyType_IsUGC;               // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckXboxPrivacyType_IsRestrict;          // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B6E[0x6];                                     // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_11;                          // 0x0190(0x0018)()
};
static_assert(alignof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem) == 0x000008, "Wrong alignment on UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem");
static_assert(sizeof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem) == 0x0001A8, "Wrong size on UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, EntryPoint) == 0x000000, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable) == 0x000006, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_1) == 0x000007, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000008, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_2) == 0x000009, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable) == 0x00000C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetRestrictText_ReturnValue) == 0x000010, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetRestrictText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_1) == 0x000028, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_3) == 0x00002C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_2) == 0x000030, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_3) == 0x000034, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_4) == 0x000038, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_4) == 0x00003C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_5) == 0x000040, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_5) == 0x000044, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_6) == 0x000048, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_7) == 0x00004C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_6) == 0x000050, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_8) == 0x000054, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_8' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_9) == 0x000058, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_9' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_7) == 0x00005C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_10) == 0x000060, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_10' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_11) == 0x000064, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_11' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_8) == 0x000068, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_12) == 0x00006C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_12' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_int_Variable_13) == 0x000070, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_int_Variable_13' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000074, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000075, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_9) == 0x000076, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000077, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_10) == 0x000078, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, Temp_bool_Variable_11) == 0x000079, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00007A, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Event_InData) == 0x000080, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetWeaponVisibility_ReturnValue) == 0x000088, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetWeaponVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsEnabledLookActive_ReturnValue) == 0x000089, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsEnabledLookActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsValidRequestEmoteName_ReturnValue) == 0x00008A, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsValidRequestEmoteName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsValidLastEmoteName_ReturnValue) == 0x00008B, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsValidLastEmoteName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CanControlClone_ReturnValue) == 0x00008C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CanControlClone_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_BooleanOR_ReturnValue) == 0x00008D, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetCharacterId_ReturnValue) == 0x000090, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Conv_NameToString_ReturnValue) == 0x000098, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default) == 0x0000A8, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsPlayerVisible_ReturnValue) == 0x0000A9, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsPlayerVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CanControlMotionStop_ReturnValue) == 0x0000AA, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CanControlMotionStop_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CanControlVisibility_ReturnValue) == 0x0000AB, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CanControlVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsEnabledLookAtEyeActive_ReturnValue) == 0x0000AC, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsEnabledLookAtEyeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsFixHead_ReturnValue) == 0x0000AD, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsFixHead_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_BooleanAND_ReturnValue) == 0x0000AE, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsFixEye_ReturnValue) == 0x0000AF, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsFixEye_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsLookAtEyeActive_ReturnValue) == 0x0000B0, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsLookAtEyeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsLookAtActive_ReturnValue) == 0x0000B1, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsLookAtActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsMotionStop_ReturnValue) == 0x0000B2, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsMotionStop_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsValidCloneCharacter_ReturnValue) == 0x0000B3, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsValidCloneCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_1) == 0x0000B4, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_2) == 0x0000B8, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsVisible_ReturnValue) == 0x0000BC, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_3) == 0x0000C0, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetWeaponVisibility_ReturnValue_1) == 0x0000C4, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetWeaponVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsPlayerVisible_ReturnValue_1) == 0x0000C5, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsPlayerVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue) == 0x0000C6, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000C7, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsMotionStop_ReturnValue_1) == 0x0000C8, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsMotionStop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsValidCloneCharacter_ReturnValue_1) == 0x0000C9, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsValidCloneCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000CA, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000CB, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsVisible_ReturnValue_1) == 0x0000CC, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetPhotoModeController_ReturnValue) == 0x0000D0, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetPhotoModeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_4) == 0x0000D8, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Event_IsDesignTime) == 0x0000D9, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_4) == 0x0000DC, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_5) == 0x0000E0, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_5) == 0x0000E1, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x0000E2, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetPhotoModeController_ReturnValue_1) == 0x0000E8, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetPhotoModeController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetAllWeaponVisibility_ReturnValue) == 0x0000F0, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetAllWeaponVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetAllWeaponVisibility_ReturnValue_1) == 0x0000F1, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetAllWeaponVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_6) == 0x0000F2, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllMotionStop_ReturnValue) == 0x0000F3, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllMotionStop_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllClone_ReturnValue) == 0x0000F4, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllClone_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_7) == 0x0000F5, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_8) == 0x0000F6, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllVisible_ReturnValue) == 0x0000F7, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllEnabledLookActive_ReturnValue) == 0x0000F8, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllEnabledLookActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_9) == 0x0000F9, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CanControlAllClone_ReturnValue) == 0x0000FA, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CanControlAllClone_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllEnabledLookAtEyeActive_ReturnValue) == 0x0000FB, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllEnabledLookAtEyeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_BooleanAND_ReturnValue_1) == 0x0000FC, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllFixEye_ReturnValue) == 0x0000FD, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllFixEye_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllLookAtEyeActive_ReturnValue) == 0x0000FE, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllLookAtEyeActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllFixHead_ReturnValue) == 0x0000FF, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllFixHead_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllLookAtActive_ReturnValue) == 0x000100, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllLookAtActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllClone_ReturnValue_1) == 0x000101, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllClone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllMotionStop_ReturnValue_1) == 0x000102, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllMotionStop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_6) == 0x000104, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_7) == 0x000108, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CanControlAllMotionStop_ReturnValue) == 0x00010C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CanControlAllMotionStop_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsAllVisible_ReturnValue_1) == 0x00010D, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsAllVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetPhotoModeController_ReturnValue_2) == 0x000110, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetPhotoModeController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_8) == 0x000118, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_IsShowDebugUi_ReturnValue) == 0x00011C, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_IsShowDebugUi_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_9) == 0x00011D, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Not_PreBool_ReturnValue_10) == 0x00011E, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_BooleanAND_ReturnValue_2) == 0x00011F, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000120, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_10) == 0x000121, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetCharacterId_ReturnValue_1) == 0x000124, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetCharacterId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000130, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetCharacterName_ReturnValue) == 0x000140, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_GetPlatformInfo_ReturnValue) == 0x000150, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_GetPlatformInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000170, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CheckXboxPrivacyType_IsUGC) == 0x000188, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CheckXboxPrivacyType_IsUGC' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, CallFunc_CheckXboxPrivacyType_IsRestrict) == 0x000189, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::CallFunc_CheckXboxPrivacyType_IsRestrict' has a wrong offset!");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem, K2Node_Select_Default_11) == 0x000190, "Member 'UMG_PhotoModePlayerListItem_C_ExecuteUbergraph_UMG_PhotoModePlayerListItem::K2Node_Select_Default_11' has a wrong offset!");

// Function UMG_PhotoModePlayerListItem.UMG_PhotoModePlayerListItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoModePlayerListItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoModePlayerListItem_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_PhotoModePlayerListItem_C_PreConstruct");
static_assert(sizeof(UMG_PhotoModePlayerListItem_C_PreConstruct) == 0x000001, "Wrong size on UMG_PhotoModePlayerListItem_C_PreConstruct");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_PhotoModePlayerListItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_PhotoModePlayerListItem.UMG_PhotoModePlayerListItem_C.BP_SetData
// 0x0008 (0x0008 - 0x0000)
struct UMG_PhotoModePlayerListItem_C_BP_SetData final
{
public:
	class USBPhotoModePlayerControlData*          InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoModePlayerListItem_C_BP_SetData) == 0x000008, "Wrong alignment on UMG_PhotoModePlayerListItem_C_BP_SetData");
static_assert(sizeof(UMG_PhotoModePlayerListItem_C_BP_SetData) == 0x000008, "Wrong size on UMG_PhotoModePlayerListItem_C_BP_SetData");
static_assert(offsetof(UMG_PhotoModePlayerListItem_C_BP_SetData, InData) == 0x000000, "Member 'UMG_PhotoModePlayerListItem_C_BP_SetData::InData' has a wrong offset!");

}

