#pragma once

 

// Package: UMG_PSOnlyDialog

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.SetMode
// 0x0001 (0x0001 - 0x0000)
struct UMG_PSOnlyDialog_C_SetMode final
{
public:
	bool                                          OffToOn;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PSOnlyDialog_C_SetMode) == 0x000001, "Wrong alignment on UMG_PSOnlyDialog_C_SetMode");
static_assert(sizeof(UMG_PSOnlyDialog_C_SetMode) == 0x000001, "Wrong size on UMG_PSOnlyDialog_C_SetMode");
static_assert(offsetof(UMG_PSOnlyDialog_C_SetMode, OffToOn) == 0x000000, "Member 'UMG_PSOnlyDialog_C_SetMode::OffToOn' has a wrong offset!");

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature final
{
public:
	int32                                         SelectIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature");
static_assert(sizeof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature) == 0x000004, "Wrong size on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature");
static_assert(offsetof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature, SelectIndex) == 0x000000, "Member 'UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_1_K2Node_ComponentBoundEvent_0_OnSelected__DelegateSignature::SelectIndex' has a wrong offset!");

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature final
{
public:
	int32                                         SelectIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature");
static_assert(sizeof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature) == 0x000004, "Wrong size on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature");
static_assert(offsetof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature, SelectIndex) == 0x000000, "Member 'UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_2_K2Node_ComponentBoundEvent_1_OnSelected__DelegateSignature::SelectIndex' has a wrong offset!");

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature final
{
public:
	int32                                         SelectIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature");
static_assert(sizeof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature) == 0x000004, "Wrong size on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature");
static_assert(offsetof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature, SelectIndex) == 0x000000, "Member 'UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_4_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature::SelectIndex' has a wrong offset!");

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature final
{
public:
	int32                                         SelectIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature");
static_assert(sizeof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature) == 0x000004, "Wrong size on UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature");
static_assert(offsetof(UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature, SelectIndex) == 0x000000, "Member 'UMG_PSOnlyDialog_C_BndEvt__UMG_PSOnlyDialog_UMG_MultipleSelectDialog_Button_5_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature::SelectIndex' has a wrong offset!");

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.ExecuteUbergraph_UMG_PSOnlyDialog
// 0x0014 (0x0014 - 0x0000)
struct UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectIndex_3;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectIndex_2;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectIndex_1;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_SelectIndex;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog) == 0x000004, "Wrong alignment on UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog");
static_assert(sizeof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog) == 0x000014, "Wrong size on UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog");
static_assert(offsetof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog, EntryPoint) == 0x000000, "Member 'UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog, K2Node_ComponentBoundEvent_SelectIndex_3) == 0x000004, "Member 'UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog::K2Node_ComponentBoundEvent_SelectIndex_3' has a wrong offset!");
static_assert(offsetof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog, K2Node_ComponentBoundEvent_SelectIndex_2) == 0x000008, "Member 'UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog::K2Node_ComponentBoundEvent_SelectIndex_2' has a wrong offset!");
static_assert(offsetof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog, K2Node_ComponentBoundEvent_SelectIndex_1) == 0x00000C, "Member 'UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog::K2Node_ComponentBoundEvent_SelectIndex_1' has a wrong offset!");
static_assert(offsetof(UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog, K2Node_ComponentBoundEvent_SelectIndex) == 0x000010, "Member 'UMG_PSOnlyDialog_C_ExecuteUbergraph_UMG_PSOnlyDialog::K2Node_ComponentBoundEvent_SelectIndex' has a wrong offset!");

// Function UMG_PSOnlyDialog.UMG_PSOnlyDialog_C.OnEnd__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_PSOnlyDialog_C_OnEnd__DelegateSignature final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PSOnlyDialog_C_OnEnd__DelegateSignature) == 0x000001, "Wrong alignment on UMG_PSOnlyDialog_C_OnEnd__DelegateSignature");
static_assert(sizeof(UMG_PSOnlyDialog_C_OnEnd__DelegateSignature) == 0x000001, "Wrong size on UMG_PSOnlyDialog_C_OnEnd__DelegateSignature");
static_assert(offsetof(UMG_PSOnlyDialog_C_OnEnd__DelegateSignature, Result) == 0x000000, "Member 'UMG_PSOnlyDialog_C_OnEnd__DelegateSignature::Result' has a wrong offset!");

}

