#pragma once

 

// Package: UMG_PhotoMode_UploadWindowMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu
// 0x01C8 (0x01C8 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E53[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E54[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E55[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E56[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E57[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E58[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E59[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      K2Node_CustomEvent_inTexture;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_inOpenTextureNum;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5A[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5B[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_outActiveWidgetIndex; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5C[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      CallFunc_GetThumbnailTexture_outThumbnailTexture;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5D[0x2];                                     // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5E[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_outActiveWidgetIndex_1; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5F[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      CallFunc_GetThumbnailTexture_outThumbnailTexture_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E60[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E61[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E62[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E63[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue_1;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E64[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBPlayerState*                         CallFunc_GetSBPlayerState_ReturnValue;             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item_3;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCharacterId_ReturnValue;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E65[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GetImage_PNGData_outImage_PNGData;        // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bResult;                        // 0x0179(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E66[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E67[0x3];                                     // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E68[0x4];                                     // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E69[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UploadImage_Request_ReturnValue;          // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu) == 0x000008, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu) == 0x0001C8, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, EntryPoint) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_bool_Variable) == 0x000004, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_object_Variable) == 0x000010, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_object_Variable_1) == 0x000030, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_bool_Variable_1) == 0x000038, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Loop_Counter_Variable_1) == 0x00003C, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Array_Index_Variable_2) == 0x000044, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Array_Index_Variable_3) == 0x000048, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_CustomEvent_inTexture) == 0x000050, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_CustomEvent_inTexture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_CustomEvent_inOpenTextureNum) == 0x000058, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_CustomEvent_inOpenTextureNum' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000060, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Variable) == 0x000078, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000080, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000084, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Get_Item) == 0x000088, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetActiveWidgetIndex_outActiveWidgetIndex) == 0x000090, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetActiveWidgetIndex_outActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetThumbnailTexture_outThumbnailTexture) == 0x000098, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetThumbnailTexture_outThumbnailTexture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000A1, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Length_ReturnValue_2) == 0x0000A4, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Length_ReturnValue_3) == 0x0000AC, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x0000B0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B4, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetActiveWidgetIndex_outActiveWidgetIndex_1) == 0x0000C0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetActiveWidgetIndex_outActiveWidgetIndex_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetThumbnailTexture_outThumbnailTexture_1) == 0x0000C8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetThumbnailTexture_outThumbnailTexture_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000D0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Loop_Counter_Variable_2) == 0x0000D4, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000DC, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_BooleanAND_ReturnValue) == 0x0000E0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Length_ReturnValue_4) == 0x0000F0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F4, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000108, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_object_Variable_2) == 0x000118, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_IsHovered_ReturnValue) == 0x000120, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_IsHovered_ReturnValue_1) == 0x000121, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_IsHovered_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_Select_Default) == 0x000128, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_PlayAnimation_ReturnValue_2) == 0x000130, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_PlayAnimation_ReturnValue_3) == 0x000138, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetSBPlayerState_ReturnValue) == 0x000140, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetSBPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Get_Item_3) == 0x000148, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetCharacterId_ReturnValue) == 0x000150, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetCharacterId_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Array_Length_ReturnValue_5) == 0x000160, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_GetImage_PNGData_outImage_PNGData) == 0x000168, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_GetImage_PNGData_outImage_PNGData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000178, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_CustomEvent_bResult) == 0x000179, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_object_Variable_3) == 0x000180, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000188, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, K2Node_Select_Default_1) == 0x000198, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Variable_1) == 0x0001A0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001A4, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, Temp_int_Loop_Counter_Variable_3) == 0x0001A8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_PlayAnimation_ReturnValue_4) == 0x0001B0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001B8, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_Add_IntInt_ReturnValue_4) == 0x0001BC, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_BooleanAND_ReturnValue_1) == 0x0001C0, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu, CallFunc_UploadImage_Request_ReturnValue) == 0x0001C1, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ExecuteUbergraph_UMG_PhotoMode_UploadWindowMenu::CallFunc_UploadImage_Request_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.OnUploadPhotoModeImageDelegate
// 0x0001 (0x0001 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate) == 0x000001, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate) == 0x000001, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate, bResult) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_OnUploadPhotoModeImageDelegate::bResult' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.ViewerInit
// 0x0010 (0x0010 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_ViewerInit final
{
public:
	class UTexture2DDynamic*                      InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InOpenTextureNum;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_ViewerInit) == 0x000008, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_ViewerInit");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_ViewerInit) == 0x000010, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_ViewerInit");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ViewerInit, InTexture) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ViewerInit::InTexture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_ViewerInit, InOpenTextureNum) == 0x000008, "Member 'UMG_PhotoMode_UploadWindowMenu_C_ViewerInit::InOpenTextureNum' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.SetThumbnailTexture2D
// 0x0040 (0x0040 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D final
{
public:
	int32                                         TmpOutImageCount;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6A[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_GetImage_PNGData_Image_PNGData;           // 0x0020(0x0010)(ReferenceParm)
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item_1;                         // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSaveUploadImage_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetThumbnailTexture_Cpp_ReturnValue;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6B[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D) == 0x000008, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D) == 0x000040, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, TmpOutImageCount) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::TmpOutImageCount' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, Temp_int_Variable) == 0x000004, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_Array_Get_Item) == 0x000008, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_GetImage_PNGData_Image_PNGData) == 0x000020, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_GetImage_PNGData_Image_PNGData' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_Array_Get_Item_1) == 0x000030, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_SetSaveUploadImage_ReturnValue) == 0x000038, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_SetSaveUploadImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_SetThumbnailTexture_Cpp_ReturnValue) == 0x000039, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_SetThumbnailTexture_Cpp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailTexture2D::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.GetThumbnailTexture2DDynamicList
// 0x0050 (0x0050 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList final
{
public:
	TArray<class UTexture2DDynamic*>              OutThumbnailImage;                                 // 0x0000(0x0010)(Parm, OutParm)
	TArray<class UTexture2DDynamic*>              TmpThumbnailTextureList;                           // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6C[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2DDynamic*                      CallFunc_GetThumbnailTexture_outThumbnailTexture;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList) == 0x000008, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList) == 0x000050, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, OutThumbnailImage) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::OutThumbnailImage' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, TmpThumbnailTextureList) == 0x000010, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::TmpThumbnailTextureList' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, CallFunc_Array_Get_Item) == 0x000030, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, CallFunc_GetThumbnailTexture_outThumbnailTexture) == 0x000040, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::CallFunc_GetThumbnailTexture_outThumbnailTexture' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetThumbnailTexture2DDynamicList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.SetThumbnailBtn
// 0x0020 (0x0020 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn) == 0x000008, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn) == 0x000020, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn, CallFunc_Array_Get_Item) == 0x000010, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'UMG_PhotoMode_UploadWindowMenu_C_SetThumbnailBtn::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.GetActiveWidgetCastImage
// 0x0028 (0x0028 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage final
{
public:
	class UWidgetSwitcher*                        InWidgetSwitcher;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 OutImage;                                          // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 K2Node_DynamicCast_AsImage;                        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage) == 0x000008, "Wrong alignment on UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage");
static_assert(sizeof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage) == 0x000028, "Wrong size on UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage, InWidgetSwitcher) == 0x000000, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage::InWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage, OutImage) == 0x000008, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage::OutImage' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage, CallFunc_GetActiveWidget_ReturnValue) == 0x000010, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage, K2Node_DynamicCast_AsImage) == 0x000018, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage::K2Node_DynamicCast_AsImage' has a wrong offset!");
static_assert(offsetof(UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UMG_PhotoMode_UploadWindowMenu_C_GetActiveWidgetCastImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UMG_PhotoMode_UploadWindowMenu.UMG_PhotoMode_UploadWindowMenu_C.SetBtn
// 0x0038 (0x0038 - 0x0000)
struct UMG_PhotoMode_UploadWindowMenu_C_SetBtn final
{
public:
	int32                                         TmpOpenTextureNum;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6D[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_PhotoMode_ThumbnailData_C*         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
