#pragma once

 

// Package: UMG_LiquidMemoryDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_LiquidMemoryDetails.UMG_LiquidMemoryDetails_C
// 0x0130 (0x03A8 - 0x0278)
class UUMG_LiquidMemoryDetails_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimitemChangeIn;                                  // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimitemChangeOut;                                 // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimEffectOut;                                     // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimationTextChange;                               // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimLoopArrow;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimOut;                                           // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimationTextIn;                                   // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           AccumulateLevelTextGrp;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ArrowGrp;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar1_1;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar1_2;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar1_3;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar2_1;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar2_2;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar2_3;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar3_1;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar3_2;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar3_3;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar4_1;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar4_2;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar4_3;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar5_1;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar5_2;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryShop_EffectStar_C*     EffectStar5_3;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           EffectStarGrp;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_1;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Arrow_2;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BLine;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LiquidMemoryFilledIconL_C*         LiquidMemoryIconL;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_FilledLevel;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LiquidMemoryId;                                    // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F34[0x4];                                     // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnCloseAnimationFinished;                          // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         FilledLevel;                                       // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FilledLevelMax;                                    // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnDrinkingAnimationFinished;                       // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnCloseAnimationFinished__DelegateSignature(class UUserWidget* InWidget);
	void OnDrinkingAnimationFinished__DelegateSignature();
	void ExecuteUbergraph_UMG_LiquidMemoryDetails(int32 EntryPoint);
	void Construct();
	void BndEvt__LiquidMemoryIconL_K2Node_ComponentBoundEvent_0_OnDrinkingAnimationFinished__DelegateSignature();
	void ShowDetails(int32 InLiquidMemoryId, int32 InFilledLevel);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void HideDetails();
	void SetFilledLevel(int32 InFilledLevel);
	void PlayDrinkingAnimation();
	void PlayAnimEffectOut();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_LiquidMemoryDetails_C">();
	}
	static class UUMG_LiquidMemoryDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_LiquidMemoryDetails_C>();
	}
};
static_assert(alignof(UUMG_LiquidMemoryDetails_C) == 0x000008, "Wrong alignment on UUMG_LiquidMemoryDetails_C");
static_assert(sizeof(UUMG_LiquidMemoryDetails_C) == 0x0003A8, "Wrong size on UUMG_LiquidMemoryDetails_C");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, UberGraphFrame) == 0x000278, "Member 'UUMG_LiquidMemoryDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimitemChangeIn) == 0x000280, "Member 'UUMG_LiquidMemoryDetails_C::AnimitemChangeIn' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimitemChangeOut) == 0x000288, "Member 'UUMG_LiquidMemoryDetails_C::AnimitemChangeOut' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimEffectOut) == 0x000290, "Member 'UUMG_LiquidMemoryDetails_C::AnimEffectOut' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimationTextChange) == 0x000298, "Member 'UUMG_LiquidMemoryDetails_C::AnimationTextChange' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimLoopArrow) == 0x0002A0, "Member 'UUMG_LiquidMemoryDetails_C::AnimLoopArrow' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimOut) == 0x0002A8, "Member 'UUMG_LiquidMemoryDetails_C::AnimOut' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AnimationTextIn) == 0x0002B0, "Member 'UUMG_LiquidMemoryDetails_C::AnimationTextIn' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, AccumulateLevelTextGrp) == 0x0002B8, "Member 'UUMG_LiquidMemoryDetails_C::AccumulateLevelTextGrp' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, ArrowGrp) == 0x0002C0, "Member 'UUMG_LiquidMemoryDetails_C::ArrowGrp' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar1_1) == 0x0002C8, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar1_1' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar1_2) == 0x0002D0, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar1_2' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar1_3) == 0x0002D8, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar1_3' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar2_1) == 0x0002E0, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar2_1' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar2_2) == 0x0002E8, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar2_2' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar2_3) == 0x0002F0, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar2_3' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar3_1) == 0x0002F8, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar3_1' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar3_2) == 0x000300, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar3_2' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar3_3) == 0x000308, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar3_3' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar4_1) == 0x000310, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar4_1' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar4_2) == 0x000318, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar4_2' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar4_3) == 0x000320, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar4_3' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar5_1) == 0x000328, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar5_1' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar5_2) == 0x000330, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar5_2' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStar5_3) == 0x000338, "Member 'UUMG_LiquidMemoryDetails_C::EffectStar5_3' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, EffectStarGrp) == 0x000340, "Member 'UUMG_LiquidMemoryDetails_C::EffectStarGrp' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, Image_Arrow_1) == 0x000348, "Member 'UUMG_LiquidMemoryDetails_C::Image_Arrow_1' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, Image_Arrow_2) == 0x000350, "Member 'UUMG_LiquidMemoryDetails_C::Image_Arrow_2' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, Image_BG) == 0x000358, "Member 'UUMG_LiquidMemoryDetails_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, Image_BLine) == 0x000360, "Member 'UUMG_LiquidMemoryDetails_C::Image_BLine' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, LiquidMemoryIconL) == 0x000368, "Member 'UUMG_LiquidMemoryDetails_C::LiquidMemoryIconL' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, Txt_FilledLevel) == 0x000370, "Member 'UUMG_LiquidMemoryDetails_C::Txt_FilledLevel' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, LiquidMemoryId) == 0x000378, "Member 'UUMG_LiquidMemoryDetails_C::LiquidMemoryId' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, OnCloseAnimationFinished) == 0x000380, "Member 'UUMG_LiquidMemoryDetails_C::OnCloseAnimationFinished' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, FilledLevel) == 0x000390, "Member 'UUMG_LiquidMemoryDetails_C::FilledLevel' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, FilledLevelMax) == 0x000394, "Member 'UUMG_LiquidMemoryDetails_C::FilledLevelMax' has a wrong offset!");
static_assert(offsetof(UUMG_LiquidMemoryDetails_C, OnDrinkingAnimationFinished) == 0x000398, "Member 'UUMG_LiquidMemoryDetails_C::OnDrinkingAnimationFinished' has a wrong offset!");

}

