#pragma once

 

// Package: UMG_LiquidMemoryProductListItem

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.OnBtnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_OnBtnHovered__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.OnBtnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_OnBtnUnhovered__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.OnBtnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_OnBtnSelected__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.OnAdd__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_OnAdd__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.OnSub__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature final
{
public:
	class UUMG_LiquidMemoryProductListItem_C*     InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature, InItem) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_OnSub__DelegateSignature::InItem' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.OnPopupTokenList__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature final
{
public:
	int32                                         Param_LiquidMemoryId;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFullCharge;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature) == 0x000004, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature) == 0x000008, "Wrong size on UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature, Param_LiquidMemoryId) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature::Param_LiquidMemoryId' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature, IsFullCharge) == 0x000004, "Member 'UMG_LiquidMemoryProductListItem_C_OnPopupTokenList__DelegateSignature::IsFullCharge' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.ExecuteUbergraph_UMG_LiquidMemoryProductListItem
// 0x04B8 (0x04B8 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F04[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0018(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0068(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F05[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F06[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00A0(0x0018)()
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00C8(0x0018)()
	struct FSBLiquidMemoryMasterData              K2Node_CustomEvent_InLiquidMemoryMaster;           // 0x00E0(0x0038)()
	int32                                         K2Node_CustomEvent_InUseBottleNum;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsCostDiscount;               // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F07[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_InCostDiscountRate;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUsable;                       // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F08[0x3];                                     // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Count;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F09[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0130(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0A[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLiquidMemoryText_ReturnValue;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0168(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0198(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01D8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetLiquidMemoryText_ReturnValue_1;        // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0210(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0228(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0246(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0B[0x1];                                     // 0x0247(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBLiquidMemoryEfficacyParameter       CallFunc_Array_Get_Item;                           // 0x0250(0x0030)()
	int32                                         Temp_int_Variable;                                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0C[0x3];                                     // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0D[0x2];                                     // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainUsableBottleNum_Remain;          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0E[0x1];                                     // 0x02AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_2;     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_3;     // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F0F[0x2];                                     // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02CC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6F10[0x4];                                     // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x02E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_4;     // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_5;     // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F11[0x2];                                     // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x02EC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_CalculateDiscountValue_OutDiscountValue;  // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0300(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_6;     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F12[0x3];                                     // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_7;     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F13[0x2];                                     // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F14[0x3];                                     // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonIconToolTip_C*                   CallFunc_CreateToolTipWidgetifNeeded_Widget;       // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainUsableBottleNum_Remain_1;        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F15[0x3];                                     // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F16[0x3];                                     // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_5;             // 0x0346(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F17[0x1];                                     // 0x0347(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0348(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0358(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F18[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F19[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0380(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0398(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x03F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0400(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x0420(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0438(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0478(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x0490(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x04A0(0x0018)()
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem) == 0x0004B8, "Wrong size on UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, EntryPoint) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeArray_Array) == 0x000008, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Format_ReturnValue) == 0x000018, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetTextFromAsset_ReturnValue) == 0x000030, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeArray_Array_1) == 0x000058, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Format_ReturnValue_1) == 0x000068, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x000088, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000A0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x0000B8, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000C8, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CustomEvent_InLiquidMemoryMaster) == 0x0000E0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CustomEvent_InLiquidMemoryMaster' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CustomEvent_InUseBottleNum) == 0x000118, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CustomEvent_InUseBottleNum' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CustomEvent_InIsCostDiscount) == 0x00011C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CustomEvent_InIsCostDiscount' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CustomEvent_InCostDiscountRate) == 0x000120, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CustomEvent_InCostDiscountRate' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CustomEvent_IsUsable) == 0x000124, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CustomEvent_IsUsable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CustomEvent_Count) == 0x000128, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CustomEvent_Count' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Greater_IntInt_ReturnValue) == 0x00012C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000130, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Array_Length_ReturnValue_1) == 0x00014C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_SwitchEnum_CmpSuccess) == 0x000151, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetLiquidMemoryText_ReturnValue) == 0x000158, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetLiquidMemoryText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_FloatToText_ReturnValue) == 0x000168, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000180, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeStruct_FormatArgumentData) == 0x000198, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001D8, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeArray_Array_2) == 0x0001F0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetLiquidMemoryText_ReturnValue_1) == 0x000200, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetLiquidMemoryText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Format_ReturnValue_2) == 0x000210, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000228, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x000240, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_bool_True_if_break_was_hit_Variable) == 0x000244, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Not_PreBool_ReturnValue) == 0x000245, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_BooleanAND_ReturnValue) == 0x000246, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_int_Array_Index_Variable) == 0x000248, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x00024C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Array_Get_Item) == 0x000250, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_int_Variable) == 0x000280, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_bool_Variable) == 0x000284, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_int_Variable_1) == 0x000288, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_bool_Variable_1) == 0x00028C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, Temp_bool_Variable_2) == 0x00028D, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CreateDelegate_OutputDelegate) == 0x000290, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002A0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetRemainUsableBottleNum_Remain) == 0x0002A8, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetRemainUsableBottleNum_Remain' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0002AC, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0002AD, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_1) == 0x0002AE, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002B0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002C0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_2) == 0x0002C8, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_3) == 0x0002C9, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002CC, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0002E0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_4) == 0x0002E8, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_5) == 0x0002E9, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002EC, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_CalculateDiscountValue_OutDiscountValue) == 0x0002FC, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_CalculateDiscountValue_OutDiscountValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000300, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_6) == 0x000308, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_Select_Default) == 0x00030C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_7) == 0x000310, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000311, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Multiply_IntInt_ReturnValue) == 0x000314, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_Select_Default_1) == 0x000318, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00031C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Multiply_IntInt_ReturnValue_1) == 0x000320, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Multiply_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_Select_Default_2) == 0x000324, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_CreateToolTipWidgetifNeeded_Widget) == 0x000328, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_CreateToolTipWidgetifNeeded_Widget' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_GetRemainUsableBottleNum_Remain_1) == 0x000330, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_GetRemainUsableBottleNum_Remain_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000334, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_PlaySE_ReturnValue) == 0x000338, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x00033C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_PlaySE_ReturnValue_1) == 0x000340, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000344, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Greater_IntInt_ReturnValue_4) == 0x000345, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Greater_IntInt_ReturnValue_5) == 0x000346, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Greater_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeArray_Array_3) == 0x000348, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Format_ReturnValue_3) == 0x000358, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000370, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_SwitchEnum_CmpSuccess_1) == 0x000374, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Clamp_ReturnValue) == 0x000378, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_SwitchEnum_CmpSuccess_2) == 0x00037C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000380, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000398, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x0003B0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeArray_Array_4) == 0x0003F0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Format_ReturnValue_4) == 0x000400, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000418, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Clamp_ReturnValue_1) == 0x00041C, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_FloatToText_ReturnValue_2) == 0x000420, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_FloatToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeStruct_FormatArgumentData_2) == 0x000438, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000478, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, K2Node_MakeArray_Array_5) == 0x000490, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem, CallFunc_Format_ReturnValue_5) == 0x0004A0, "Member 'UMG_LiquidMemoryProductListItem_C_ExecuteUbergraph_UMG_LiquidMemoryProductListItem::CallFunc_Format_ReturnValue_5' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.SetPurchaseCountValue
// 0x0004 (0x0004 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue) == 0x000004, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue) == 0x000004, "Wrong size on UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue");
static_assert(offsetof(UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue, Count) == 0x000000, "Member 'UMG_LiquidMemoryProductListItem_C_SetPurchaseCountValue::Count' has a wrong offset!");

// Function UMG_LiquidMemoryProductListItem.UMG_LiquidMemoryProductListItem_C.Init
// 0x0048 (0x0048 - 0x0000)
struct UMG_LiquidMemoryProductListItem_C_Init final
{
public:
	struct FSBLiquidMemoryMasterData              InLiquidMemoryMaster;                              // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InUseBottleNum;                                    // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsCostDiscount;                                  // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InCostDiscountRate;                                // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsable;                                          // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryProductListItem_C_Init) == 0x000008, "Wrong alignment on UMG_LiquidMemoryProductListItem_C_Init");
static_assert(sizeof(UMG_LiquidMemoryProductListItem_C_Init) == 0x000048, "Wrong size on UMG_LiquidMemoryProductListItem_C_Init");
