#pragma once

 

// Package: UMG_LiquidMemoryAccumlulateItem

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UMG_LiquidMemoryAccumlulateItem.UMG_LiquidMemoryAccumlulateItem_C.ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem
// 0x00F0 (0x00F0 - 0x0000)
struct UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE3[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6EE4[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE5[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6EE6[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_2;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_3;     // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_4;     // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_5;     // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_6;     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_7;     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE7[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem) == 0x000008, "Wrong alignment on UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem");
static_assert(sizeof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem) == 0x0000F0, "Wrong size on UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, EntryPoint) == 0x000000, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, Temp_int_Variable) == 0x000008, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_PlaySE_ReturnValue) == 0x000028, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x00002C, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_1) == 0x00002D, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002E, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, Temp_int_Variable_1) == 0x000038, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000060, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000068, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_2) == 0x000070, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_3) == 0x000071, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_4) == 0x000072, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_5) == 0x000073, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_PlaySE_ReturnValue_1) == 0x000084, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000088, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_6) == 0x000090, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_K2_IsTimerActiveHandle_ReturnValue_7) == 0x000091, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_K2_IsTimerActiveHandle_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000092, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Conv_IntToString_ReturnValue) == 0x000098, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000C0, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000D0, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E9, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000EA, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0000EB, "Member 'UMG_LiquidMemoryAccumlulateItem_C_ExecuteUbergraph_UMG_LiquidMemoryAccumlulateItem::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");

// Function UMG_LiquidMemoryAccumlulateItem.UMG_LiquidMemoryAccumlulateItem_C.SetData
// 0x0100 (0x0100 - 0x0000)
struct UMG_LiquidMemoryAccumlulateItem_C_SetData final
{
public:
	struct FSBTokenState                          TokenState;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Param_IsFullCharge;                                // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE8[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EE9[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindMasterToken_bIsValid;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EEA[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterToken                           CallFunc_BP_FindMasterToken_ReturnValue;           // 0x0080(0x0058)()
	class FString                                 CallFunc_GetMasterTokenText_ReturnValue;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00E8(0x0018)()
};
static_assert(alignof(UMG_LiquidMemoryAccumlulateItem_C_SetData) == 0x000008, "Wrong alignment on UMG_LiquidMemoryAccumlulateItem_C_SetData");
static_assert(sizeof(UMG_LiquidMemoryAccumlulateItem_C_SetData) == 0x000100, "Wrong size on UMG_LiquidMemoryAccumlulateItem_C_SetData");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, TokenState) == 0x000000, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::TokenState' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, Param_IsFullCharge) == 0x000048, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::Param_IsFullCharge' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_GetMasterDataManager_IsValid) == 0x000068, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_GetMasterDataManager_ReturnValue) == 0x000070, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_BP_FindMasterToken_bIsValid) == 0x000078, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_BP_FindMasterToken_bIsValid' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_BP_FindMasterToken_ReturnValue) == 0x000080, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_BP_FindMasterToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_GetMasterTokenText_ReturnValue) == 0x0000D8, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_GetMasterTokenText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetData, CallFunc_Conv_StringToText_ReturnValue) == 0x0000E8, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UMG_LiquidMemoryAccumlulateItem.UMG_LiquidMemoryAccumlulateItem_C.GetUseToken
// 0x0008 (0x0008 - 0x0000)
struct UMG_LiquidMemoryAccumlulateItem_C_GetUseToken final
{
public:
	int32                                         Param_TokenID;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UseNum;                                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LiquidMemoryAccumlulateItem_C_GetUseToken) == 0x000004, "Wrong alignment on UMG_LiquidMemoryAccumlulateItem_C_GetUseToken");
static_assert(sizeof(UMG_LiquidMemoryAccumlulateItem_C_GetUseToken) == 0x000008, "Wrong size on UMG_LiquidMemoryAccumlulateItem_C_GetUseToken");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_GetUseToken, Param_TokenID) == 0x000000, "Member 'UMG_LiquidMemoryAccumlulateItem_C_GetUseToken::Param_TokenID' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_GetUseToken, UseNum) == 0x000004, "Member 'UMG_LiquidMemoryAccumlulateItem_C_GetUseToken::UseNum' has a wrong offset!");

// Function UMG_LiquidMemoryAccumlulateItem.UMG_LiquidMemoryAccumlulateItem_C.SetLimitOver
// 0x0002 (0x0002 - 0x0000)
struct UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver final
{
public:
	bool                                          Param_IsLimitOver;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver) == 0x000001, "Wrong alignment on UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver");
static_assert(sizeof(UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver) == 0x000002, "Wrong size on UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver, Param_IsLimitOver) == 0x000000, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver::Param_IsLimitOver' has a wrong offset!");
static_assert(offsetof(UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'UMG_LiquidMemoryAccumlulateItem_C_SetLimitOver::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

