#pragma once

 

// Package: UMG_ProductItemList

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "SlateCore_structs.hpp"
#include "E_SBProductDetailType_structs.hpp"


namespace SDK::Params
{

// Function UMG_ProductItemList.UMG_ProductItemList_C.OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProductItemList_C_OnItemClicked__DelegateSignature final
{
public:
	class UBP_SBProductItemData_C*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProductItemList_C_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_OnItemClicked__DelegateSignature");
static_assert(sizeof(UMG_ProductItemList_C_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on UMG_ProductItemList_C_OnItemClicked__DelegateSignature");
static_assert(offsetof(UMG_ProductItemList_C_OnItemClicked__DelegateSignature, Data) == 0x000000, "Member 'UMG_ProductItemList_C_OnItemClicked__DelegateSignature::Data' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.OnSelectedItemData__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature final
{
public:
	class UBP_SBProductItemData_C*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTrying;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature");
static_assert(sizeof(UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature) == 0x000010, "Wrong size on UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature");
static_assert(offsetof(UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature, Data) == 0x000000, "Member 'UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature::Data' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature, bTrying) == 0x000008, "Member 'UMG_ProductItemList_C_OnSelectedItemData__DelegateSignature::bTrying' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.OnBannerVisibilityChanged __DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature final
{
public:
	bool                                          Param_IsVisible;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature) == 0x000001, "Wrong alignment on UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature");
static_assert(sizeof(UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature) == 0x000001, "Wrong size on UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature");
static_assert(offsetof(UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature, Param_IsVisible) == 0x000000, "Member 'UMG_ProductItemList_C_OnBannerVisibilityChanged___DelegateSignature::Param_IsVisible' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.ExecuteUbergraph_UMG_ProductItemList
// 0x0170 (0x0170 - 0x0000)
struct UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_952F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_2;                        // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_3;                        // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_CustomEvent_URL;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAssetRegistry>        CallFunc_GetAssetRegistry_ReturnValue;             // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          Temp_bool_Variable_3;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9530[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAssetData                             CallFunc_GetAssetByObjectPath_ReturnValue;         // 0x0090(0x0060)(HasGetValueTypeHash)
	class UObject*                                CallFunc_GetAsset_ReturnValue;                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00F8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9531[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SBProductItemData_C*                K2Node_CustomEvent_Data_1;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9532[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SBProductItemData_C*                K2Node_CustomEvent_Data;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bTrying;                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9533[0x3];                                     // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SBProductDetailType                         K2Node_CustomEvent_DetailType;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsItemBox;                     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9534[0x1];                                     // 0x014B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x014C(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9535[0x2];                                     // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UShopMenuDetails_ItemIconL_C*>   K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList");
static_assert(sizeof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList) == 0x000170, "Wrong size on UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, EntryPoint) == 0x000000, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, Temp_object_Variable) == 0x000010, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_DynamicCast_AsTexture_2D) == 0x000018, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000021, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000022, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000023, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, Temp_bool_Variable) == 0x000024, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000025, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_Not_PreBool_ReturnValue) == 0x000026, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000027, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, Temp_bool_Variable_1) == 0x000029, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, Temp_bool_Variable_2) == 0x00002A, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002B, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002C, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002D, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_BooleanAND_ReturnValue_1) == 0x00002E, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_Not_PreBool_ReturnValue_2) == 0x00002F, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_MakeStruct_Margin) == 0x000030, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_MakeStruct_Margin_1) == 0x000040, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_MakeStruct_Margin_2) == 0x000050, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_MakeStruct_Margin_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_MakeStruct_Margin_3) == 0x000060, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_MakeStruct_Margin_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_URL) == 0x000070, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_URL' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_GetAssetRegistry_ReturnValue) == 0x000078, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_GetAssetRegistry_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, Temp_bool_Variable_3) == 0x000088, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_GetAssetByObjectPath_ReturnValue) == 0x000090, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_GetAssetByObjectPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_GetAsset_ReturnValue) == 0x0000F0, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_GetAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000F8, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_Event_IsDesignTime) == 0x000120, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_BooleanAND_ReturnValue_2) == 0x000121, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_Select_Default) == 0x000122, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000123, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_Data_1) == 0x000128, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_Data_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_Select_Default_1) == 0x000130, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_Data) == 0x000138, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_bTrying) == 0x000140, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_bTrying' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_GetScrollOffset_ReturnValue) == 0x000144, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_DetailType) == 0x000148, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_DetailType' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CustomEvent_bIsItemBox) == 0x000149, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CustomEvent_bIsItemBox' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00014A, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_CreateDelegate_OutputDelegate) == 0x00014C, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_Select_Default_2) == 0x00015C, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_Select_Default_3) == 0x00015D, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList, K2Node_MakeArray_Array) == 0x000160, "Member 'UMG_ProductItemList_C_ExecuteUbergraph_UMG_ProductItemList::K2Node_MakeArray_Array' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.LayoutCheck
// 0x0002 (0x0002 - 0x0000)
struct UMG_ProductItemList_C_LayoutCheck final
{
public:
	E_SBProductDetailType                         Param_DetailType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bIsItemBox;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemList_C_LayoutCheck) == 0x000001, "Wrong alignment on UMG_ProductItemList_C_LayoutCheck");
static_assert(sizeof(UMG_ProductItemList_C_LayoutCheck) == 0x000002, "Wrong size on UMG_ProductItemList_C_LayoutCheck");
static_assert(offsetof(UMG_ProductItemList_C_LayoutCheck, Param_DetailType) == 0x000000, "Member 'UMG_ProductItemList_C_LayoutCheck::Param_DetailType' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_LayoutCheck, Param_bIsItemBox) == 0x000001, "Member 'UMG_ProductItemList_C_LayoutCheck::Param_bIsItemBox' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.SetSelectedItemData
// 0x0010 (0x0010 - 0x0000)
struct UMG_ProductItemList_C_SetSelectedItemData final
{
public:
	class UBP_SBProductItemData_C*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTrying;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemList_C_SetSelectedItemData) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_SetSelectedItemData");
static_assert(sizeof(UMG_ProductItemList_C_SetSelectedItemData) == 0x000010, "Wrong size on UMG_ProductItemList_C_SetSelectedItemData");
static_assert(offsetof(UMG_ProductItemList_C_SetSelectedItemData, Data) == 0x000000, "Member 'UMG_ProductItemList_C_SetSelectedItemData::Data' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetSelectedItemData, bTrying) == 0x000008, "Member 'UMG_ProductItemList_C_SetSelectedItemData::bTrying' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.OnItemClicked_Event
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProductItemList_C_OnItemClicked_Event final
{
public:
	class UBP_SBProductItemData_C*                Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProductItemList_C_OnItemClicked_Event) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_OnItemClicked_Event");
static_assert(sizeof(UMG_ProductItemList_C_OnItemClicked_Event) == 0x000008, "Wrong size on UMG_ProductItemList_C_OnItemClicked_Event");
static_assert(offsetof(UMG_ProductItemList_C_OnItemClicked_Event, Data) == 0x000000, "Member 'UMG_ProductItemList_C_OnItemClicked_Event::Data' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_ProductItemList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemList_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_ProductItemList_C_PreConstruct");
static_assert(sizeof(UMG_ProductItemList_C_PreConstruct) == 0x000001, "Wrong size on UMG_ProductItemList_C_PreConstruct");
static_assert(offsetof(UMG_ProductItemList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_ProductItemList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.OnLoad_Icon
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProductItemList_C_OnLoad_Icon final
{
public:
	class FName                                   URL;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProductItemList_C_OnLoad_Icon) == 0x000004, "Wrong alignment on UMG_ProductItemList_C_OnLoad_Icon");
static_assert(sizeof(UMG_ProductItemList_C_OnLoad_Icon) == 0x000008, "Wrong size on UMG_ProductItemList_C_OnLoad_Icon");
static_assert(offsetof(UMG_ProductItemList_C_OnLoad_Icon, URL) == 0x000000, "Member 'UMG_ProductItemList_C_OnLoad_Icon::URL' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9");
static_assert(sizeof(UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9) == 0x000008, "Wrong size on UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9");
static_assert(offsetof(UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9, Loaded) == 0x000000, "Member 'UMG_ProductItemList_C_OnLoaded_2F958F004AA9A8D66934A2BF4E23E3D9::Loaded' has a wrong offset!");

// Function UMG_ProductItemList.UMG_ProductItemList_C.SetDetailType
// 0x00D8 (0x00D8 - 0x0000)
struct UMG_ProductItemList_C_SetDetailType final
{
public:
	E_SBProductDetailType                         InDetailType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9536[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_11;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9537[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9538[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9539[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                CallFunc_GetOffsets_ReturnValue;                   // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_953A[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_4;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_5;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_6;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_7;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_953B[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_8;                           // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_953C[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_10;                          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_11;                          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_953D[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_12;                          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_ProductItemList_C_SetDetailType) == 0x000008, "Wrong alignment on UMG_ProductItemList_C_SetDetailType");
static_assert(sizeof(UMG_ProductItemList_C_SetDetailType) == 0x0000D8, "Wrong size on UMG_ProductItemList_C_SetDetailType");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, InDetailType) == 0x000000, "Member 'UMG_ProductItemList_C_SetDetailType::InDetailType' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable) == 0x000001, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_1) == 0x000002, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_2) == 0x000003, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_3) == 0x000004, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_4) == 0x000005, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_5) == 0x000006, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_6) == 0x000007, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_7) == 0x000008, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000A, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000B, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_8) == 0x00000D, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_1) == 0x00000E, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_float_Variable) == 0x000010, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000014, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000016, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanAND_ReturnValue) == 0x000017, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_float_Variable_1) == 0x000018, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001C, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_MakeLiteralByte_ReturnValue) == 0x00001D, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001E, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanAND_ReturnValue_1) == 0x00001F, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000020, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000021, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000022, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_2) == 0x000023, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_9) == 0x000024, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_3) == 0x000025, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_10) == 0x000026, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000027, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000028, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x000029, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x00002A, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_4) == 0x00002B, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_5) == 0x00002C, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x00002D, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00002E, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_Not_PreBool_ReturnValue_3) == 0x00002F, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanAND_ReturnValue_2) == 0x000030, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x000031, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_Not_PreBool_ReturnValue_4) == 0x000032, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanAND_ReturnValue_3) == 0x000033, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, Temp_bool_Variable_11) == 0x000034, "Member 'UMG_ProductItemList_C_SetDetailType::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default) == 0x000035, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x000036, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000037, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000038, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_6) == 0x000039, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_7) == 0x00003A, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanOR_ReturnValue_8) == 0x00003B, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_BooleanAND_ReturnValue_4) == 0x00003C, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_Not_PreBool_ReturnValue_5) == 0x00003D, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_1) == 0x000040, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000044, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000048, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_2) == 0x000050, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_GetOffsets_ReturnValue) == 0x000054, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_GetOffsets_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_MakeStruct_Margin) == 0x000064, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000074, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000075, "Member 'UMG_ProductItemList_C_SetDetailType::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_3) == 0x000078, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_4) == 0x000080, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_5) == 0x000088, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_6) == 0x000090, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemList_C_SetDetailType, K2Node_Select_Default_7) == 0x000098, "Member 'UMG_ProductItemList_C_SetDetailType::K2Node_Select_Default_7' has a wrong offset!");
