#pragma once

 

// Package: UMG_ProductItemNumberInput

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_ProductItemNumberInput.UMG_ProductItemNumberInput_C.ExecuteUbergraph_UMG_ProductItemNumberInput
// 0x0008 (0x0008 - 0x0000)
struct UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput) == 0x000004, "Wrong alignment on UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput");
static_assert(sizeof(UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput) == 0x000008, "Wrong size on UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput");
static_assert(offsetof(UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput, EntryPoint) == 0x000000, "Member 'UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UMG_ProductItemNumberInput_C_ExecuteUbergraph_UMG_ProductItemNumberInput::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UMG_ProductItemNumberInput.UMG_ProductItemNumberInput_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UMG_ProductItemNumberInput_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_ProductItemNumberInput_C_PreConstruct) == 0x000001, "Wrong alignment on UMG_ProductItemNumberInput_C_PreConstruct");
static_assert(sizeof(UMG_ProductItemNumberInput_C_PreConstruct) == 0x000001, "Wrong size on UMG_ProductItemNumberInput_C_PreConstruct");
static_assert(offsetof(UMG_ProductItemNumberInput_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UMG_ProductItemNumberInput_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

