#pragma once

 

// Package: WBP_ShopMenuDetailsTags

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.ExecuteUbergraph_WBP_ShopMenuDetailsTags
// 0x0638 (0x0638 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBppIrredeemable_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AF8[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AF9[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AFA[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AFB[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImagineView_C*                         CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBMasterCostume                       K2Node_CustomEvent_MasterCostume;                  // 0x0070(0x0088)(ConstParm)
	bool                                          CallFunc_GetNetworkDataCache_IsValid;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AFC[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBNetworkDataCache*                    CallFunc_GetNetworkDataCache_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AFD[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    K2Node_CustomEvent_WeaponMaster;                   // 0x0118(0x00B0)(ConstParm)
	bool                                          K2Node_CustomEvent_bSell;                          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AFE[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_InUniqueId;                     // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetWeaponItemDataByUniqueId_OutIsValid;   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AFF[0x7];                                     // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponItemData                      CallFunc_GetWeaponItemDataByUniqueId_OutWeaponItemData; // 0x01E8(0x0050)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x023A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B00[0x5];                                     // 0x023B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       K2Node_CustomEvent_MasterImagine;                  // 0x0240(0x00B0)(ConstParm)
	struct FSBMasterMountImagine                  K2Node_CustomEvent_MasterMountImagine;             // 0x02F0(0x0070)(ConstParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBRewardItemType                             K2Node_CustomEvent_RewardType;                     // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B01[0x2];                                     // 0x0362(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ItemIndex;                      // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEventTermDataForCurrency_EventTermId;  // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEventTermDataForCurrency_DurationMinutes; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow_2;                        // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B02[0x3];                                     // 0x037D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0380(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow_1;                        // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B03[0x7];                                     // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bShow;                          // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B04[0x6];                                     // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemMasterData                        K2Node_CustomEvent_ItemMaster;                     // 0x03C0(0x00D0)(ConstParm)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B05[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAchievementMasterData                 K2Node_CustomEvent_AchievementMaster;              // 0x0498(0x0078)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B06[0x7];                                     // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBEmoteMasterData                     K2Node_CustomEvent_EmoteMaster;                    // 0x0518(0x0028)(ConstParm)
	struct FSBStampMasterData                     K2Node_CustomEvent_StampMasterData;                // 0x0540(0x0020)(ConstParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B07[0x3];                                     // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_CustomEvent_LimitTimeColor;                 // 0x0564(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_CustomEvent_DescColor;                      // 0x0574(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B08[0x4];                                     // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0588(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x05B0(0x0028)()
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B09[0x6];                                     // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStampCategoryMasterData             K2Node_CustomEvent_StampCategoryMaster;            // 0x05E0(0x0020)(ConstParm)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B0A[0x7];                                     // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBStampMasterData                     CallFunc_Array_Get_Item_2;                         // 0x0608(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x062D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x062E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBppIrredeemable_ReturnValue_1;          // 0x062F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBppIrredeemable_ReturnValue_2;          // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBppIrredeemable_ReturnValue_3;          // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBppIrredeemable_ReturnValue_4;          // 0x0632(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags) == 0x000638, "Wrong size on WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, EntryPoint) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsBppIrredeemable_ReturnValue) == 0x000004, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsBppIrredeemable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable) == 0x000006, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000007, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000008, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsEmpty_ReturnValue) == 0x000009, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00000A, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default) == 0x000038, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable_2) == 0x000050, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000051, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000052, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable_3) == 0x000053, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000054, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000055, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000056, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000057, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable_4) == 0x000058, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000059, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default_1) == 0x00005A, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable_5) == 0x00005B, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_MasterCostume) == 0x000070, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_MasterCostume' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetNetworkDataCache_IsValid) == 0x0000F8, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetNetworkDataCache_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetNetworkDataCache_ReturnValue) == 0x000100, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetNetworkDataCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetEquipmentBag_ReturnValue) == 0x000108, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetEquipmentBag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsEmpty_ReturnValue_1) == 0x000110, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_WeaponMaster) == 0x000118, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_WeaponMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_bSell) == 0x0001C8, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_bSell' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_InUniqueId) == 0x0001D0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_InUniqueId' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetWeaponItemDataByUniqueId_OutIsValid) == 0x0001E0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetWeaponItemDataByUniqueId_OutIsValid' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetWeaponItemDataByUniqueId_OutWeaponItemData) == 0x0001E8, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetWeaponItemDataByUniqueId_OutWeaponItemData' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Not_PreBool_ReturnValue) == 0x000238, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Event_IsDesignTime) == 0x000239, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default_2) == 0x00023A, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_MasterImagine) == 0x000240, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_MasterImagine' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_MasterMountImagine) == 0x0002F0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_MasterMountImagine' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000360, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_RewardType) == 0x000361, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_RewardType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_ItemIndex) == 0x000364, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_ItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetEventTermDataForCurrency_EventTermId) == 0x000368, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetEventTermDataForCurrency_EventTermId' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetEventTermDataForCurrency_DurationMinutes) == 0x000378, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetEventTermDataForCurrency_DurationMinutes' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_bShow_2) == 0x00037C, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_bShow_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_MakeArray_Array_1) == 0x000380, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Array_Get_Item_1) == 0x000390, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000398, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_bShow_1) == 0x0003A0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_bShow_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_GetDisplayName_ReturnValue_1) == 0x0003A8, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default_3) == 0x0003B8, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_bShow) == 0x0003B9, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_bShow' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_ItemMaster) == 0x0003C0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_ItemMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000490, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000491, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_BooleanAND_ReturnValue) == 0x000492, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, Temp_bool_Variable_6) == 0x000493, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_AchievementMaster) == 0x000498, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_AchievementMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default_4) == 0x000510, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_EmoteMaster) == 0x000518, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_EmoteMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_StampMasterData) == 0x000540, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_StampMasterData' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x000560, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_LimitTimeColor) == 0x000564, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_LimitTimeColor' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_DescColor) == 0x000574, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_DescColor' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_MakeStruct_SlateColor) == 0x000588, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_MakeStruct_SlateColor_1) == 0x0005B0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_ComponentBoundEvent_InVisibility) == 0x0005D8, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0005D9, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_CustomEvent_StampCategoryMaster) == 0x0005E0, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_CustomEvent_StampCategoryMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default_5) == 0x000600, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Array_Get_Item_2) == 0x000608, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Array_Length_ReturnValue) == 0x000628, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_Greater_IntInt_ReturnValue) == 0x00062C, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x00062D, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, K2Node_Select_Default_6) == 0x00062E, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsBppIrredeemable_ReturnValue_1) == 0x00062F, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsBppIrredeemable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsBppIrredeemable_ReturnValue_2) == 0x000630, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsBppIrredeemable_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsBppIrredeemable_ReturnValue_3) == 0x000631, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsBppIrredeemable_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags, CallFunc_IsBppIrredeemable_ReturnValue_4) == 0x000632, "Member 'WBP_ShopMenuDetailsTags_C_ExecuteUbergraph_WBP_ShopMenuDetailsTags::CallFunc_IsBppIrredeemable_ReturnValue_4' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetStampDataByCategory
// 0x0020 (0x0020 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetStampDataByCategory final
{
public:
	struct FSBStampCategoryMasterData             StampCategoryMaster;                               // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetStampDataByCategory) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetStampDataByCategory");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetStampDataByCategory) == 0x000020, "Wrong size on WBP_ShopMenuDetailsTags_C_SetStampDataByCategory");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetStampDataByCategory, StampCategoryMaster) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetStampDataByCategory::StampCategoryMaster' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_BndEvt__WBP_ShopMenuDetailsTags_WBP_ShopMenuDetailsExpiryDateTime_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetDateTimeTextColor
// 0x0020 (0x0020 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor final
{
public:
	struct FLinearColor                           LimitTimeColor;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DescColor;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor) == 0x000004, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor) == 0x000020, "Wrong size on WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor, LimitTimeColor) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor::LimitTimeColor' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor, DescColor) == 0x000010, "Member 'WBP_ShopMenuDetailsTags_C_SetDateTimeTextColor::DescColor' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetStampData
// 0x0020 (0x0020 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetStampData final
{
public:
	struct FSBStampMasterData                     StampMasterData;                                   // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetStampData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetStampData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetStampData) == 0x000020, "Wrong size on WBP_ShopMenuDetailsTags_C_SetStampData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetStampData, StampMasterData) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetStampData::StampMasterData' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetEmoteData
// 0x0028 (0x0028 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetEmoteData final
{
public:
	struct FSBEmoteMasterData                     EmoteMaster;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetEmoteData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetEmoteData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetEmoteData) == 0x000028, "Wrong size on WBP_ShopMenuDetailsTags_C_SetEmoteData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetEmoteData, EmoteMaster) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetEmoteData::EmoteMaster' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetAchievementData
// 0x0078 (0x0078 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetAchievementData final
{
public:
	struct FAchievementMasterData                 AchievementMaster;                                 // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetAchievementData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetAchievementData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetAchievementData) == 0x000078, "Wrong size on WBP_ShopMenuDetailsTags_C_SetAchievementData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetAchievementData, AchievementMaster) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetAchievementData::AchievementMaster' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetItemData
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetItemData final
{
public:
	struct FItemMasterData                        ItemMaster;                                        // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetItemData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetItemData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetItemData) == 0x0000D0, "Wrong size on WBP_ShopMenuDetailsTags_C_SetItemData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetItemData, ItemMaster) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetItemData::ItemMaster' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.ShowViewIllustImagineButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton) == 0x000001, "Wrong alignment on WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton) == 0x000001, "Wrong size on WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton, bShow) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_ShowViewIllustImagineButton::bShow' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.ShowRotateIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_ShowRotateIcon final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_ShowRotateIcon) == 0x000001, "Wrong alignment on WBP_ShopMenuDetailsTags_C_ShowRotateIcon");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_ShowRotateIcon) == 0x000001, "Wrong size on WBP_ShopMenuDetailsTags_C_ShowRotateIcon");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ShowRotateIcon, bShow) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_ShowRotateIcon::bShow' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.ShowZoomInButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_ShowZoomInButton final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_ShowZoomInButton) == 0x000001, "Wrong alignment on WBP_ShopMenuDetailsTags_C_ShowZoomInButton");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_ShowZoomInButton) == 0x000001, "Wrong size on WBP_ShopMenuDetailsTags_C_ShowZoomInButton");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_ShowZoomInButton, bShow) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_ShowZoomInButton::bShow' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetCurrencyData
// 0x0008 (0x0008 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetCurrencyData final
{
public:
	ESBRewardItemType                             RewardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B0B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_ItemIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetCurrencyData) == 0x000004, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetCurrencyData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetCurrencyData) == 0x000008, "Wrong size on WBP_ShopMenuDetailsTags_C_SetCurrencyData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetCurrencyData, RewardType) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetCurrencyData::RewardType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetCurrencyData, Param_ItemIndex) == 0x000004, "Member 'WBP_ShopMenuDetailsTags_C_SetCurrencyData::Param_ItemIndex' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetMountImagineData
// 0x0070 (0x0070 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetMountImagineData final
{
public:
	struct FSBMasterMountImagine                  MasterMountImagine;                                // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetMountImagineData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetMountImagineData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetMountImagineData) == 0x000070, "Wrong size on WBP_ShopMenuDetailsTags_C_SetMountImagineData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetMountImagineData, MasterMountImagine) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetMountImagineData::MasterMountImagine' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetImagineData
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetImagineData final
{
public:
	struct FSBMasterImagine                       MasterImagine;                                     // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetImagineData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetImagineData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetImagineData) == 0x0000B0, "Wrong size on WBP_ShopMenuDetailsTags_C_SetImagineData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetImagineData, MasterImagine) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetImagineData::MasterImagine' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ShopMenuDetailsTags_C_PreConstruct");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_PreConstruct) == 0x000001, "Wrong size on WBP_ShopMenuDetailsTags_C_PreConstruct");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetWeaponData
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetWeaponData final
{
public:
	struct FSBWeaponMasterData                    WeaponMaster;                                      // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bSell;                                             // 0x00B0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B0C[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InUniqueId;                                        // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetWeaponData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetWeaponData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetWeaponData) == 0x0000C8, "Wrong size on WBP_ShopMenuDetailsTags_C_SetWeaponData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetWeaponData, WeaponMaster) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetWeaponData::WeaponMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetWeaponData, bSell) == 0x0000B0, "Member 'WBP_ShopMenuDetailsTags_C_SetWeaponData::bSell' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetWeaponData, InUniqueId) == 0x0000B8, "Member 'WBP_ShopMenuDetailsTags_C_SetWeaponData::InUniqueId' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.SetCostumeData
// 0x0088 (0x0088 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_SetCostumeData final
{
public:
	struct FSBMasterCostume                       MasterCostume;                                     // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ShopMenuDetailsTags_C_SetCostumeData) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsTags_C_SetCostumeData");
static_assert(sizeof(WBP_ShopMenuDetailsTags_C_SetCostumeData) == 0x000088, "Wrong size on WBP_ShopMenuDetailsTags_C_SetCostumeData");
static_assert(offsetof(WBP_ShopMenuDetailsTags_C_SetCostumeData, MasterCostume) == 0x000000, "Member 'WBP_ShopMenuDetailsTags_C_SetCostumeData::MasterCostume' has a wrong offset!");

// Function WBP_ShopMenuDetailsTags.WBP_ShopMenuDetailsTags_C.GetEventTermDataForCurrency
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_ShopMenuDetailsTags_C_GetEventTermDataForCurrency final
{
public:
	ESBRewardItemType                             RewardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B0D[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_ItemIndex;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 EventTermId;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         DurationMinutes;                                   // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B0E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EventTerm;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindImagineRecipeMaster_bIsValid;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B0F[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterImagineRecepi                   CallFunc_FindImagineRecipeMaster_ImagineRecipeMaster; // 0x0038(0x0038)()
	bool                                          CallFunc_FindCraftMaster_bIsValid;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B10[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCraftMasterData                       CallFunc_FindCraftMaster_CraftMaster;              // 0x0078(0x0088)()
	bool                                          CallFunc_FindTokenMaster_bIsValid;                 // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B11[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMasterToken                           CallFunc_FindTokenMaster_TokenMaster;              // 0x0108(0x0058)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
