#pragma once

 

// Package: WBP_SkillListItem

#include "Basic.hpp"

#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkillListItem.WBP_SkillListItem_C.OnClick__DelegateSignature
// 0x0058 (0x0058 - 0x0000)
struct WBP_SkillListItem_C_OnClick__DelegateSignature final
{
public:
	struct FSBSkillDataMasterData                 SkillId;                                           // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SkillListItem_C_OnClick__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SkillListItem_C_OnClick__DelegateSignature");
static_assert(sizeof(WBP_SkillListItem_C_OnClick__DelegateSignature) == 0x000058, "Wrong size on WBP_SkillListItem_C_OnClick__DelegateSignature");
static_assert(offsetof(WBP_SkillListItem_C_OnClick__DelegateSignature, SkillId) == 0x000000, "Member 'WBP_SkillListItem_C_OnClick__DelegateSignature::SkillId' has a wrong offset!");

// Function WBP_SkillListItem.WBP_SkillListItem_C.ExecuteUbergraph_WBP_SkillListItem
// 0x0230 (0x0230 - 0x0000)
struct WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B28[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillDataMasterData                 K2Node_CustomEvent_SBSkillDataMasterData;          // 0x0008(0x0058)(ConstParm)
	class FString                                 CallFunc_GetMasterSkillDataText_ReturnValue;       // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentSkillLevelOthersIncluded_ReturnValue; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B29[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2A[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2B[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue;       // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2C[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2D[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSkillLevelText_ReturnValue;            // 0x0148(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2E[0x2];                                     // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillMasteryParam_IsExists;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2F[0x3];                                     // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillMasteryParam                   CallFunc_GetSkillMasteryParam_ReturnValue;         // 0x016C(0x0008)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B30[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSkillLevelText_ReturnValue_1;          // 0x0180(0x0018)()
	bool                                          CallFunc_UpdateAbility_Use;                        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B31[0x3];                                     // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_1;     // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01B0(0x0018)()
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_2;     // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B32[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01E0(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B33[0x6];                                     // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAssetByName_ReturnValue_3;     // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0210(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x022A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem) == 0x000008, "Wrong alignment on WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem");
static_assert(sizeof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem) == 0x000230, "Wrong size on WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, EntryPoint) == 0x000000, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, Temp_bool_Variable) == 0x000006, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_CustomEvent_SBSkillDataMasterData) == 0x000008, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_CustomEvent_SBSkillDataMasterData' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetMasterSkillDataText_ReturnValue) == 0x000060, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetMasterSkillDataText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetCurrentSkillLevelOthersIncluded_ReturnValue) == 0x000070, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetCurrentSkillLevelOthersIncluded_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000078, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000090, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000091, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetMasterDataManager_IsValid) == 0x000092, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetMasterDataManager_ReturnValue) == 0x000098, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000A0, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, Temp_bool_Variable_1) == 0x0000A1, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetTextFromAssetByName_ReturnValue) == 0x0000A8, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetTextFromAssetByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000B8, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_MakeArray_Array) == 0x000118, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Format_ReturnValue) == 0x000128, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetSkillLevelText_ReturnValue) == 0x000148, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetSkillLevelText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000160, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000161, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_SelectInt_ReturnValue) == 0x000164, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetSkillMasteryParam_IsExists) == 0x000168, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetSkillMasteryParam_IsExists' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetSkillMasteryParam_ReturnValue) == 0x00016C, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetSkillMasteryParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_Select_Default) == 0x000174, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000175, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_Select_Default_1) == 0x000176, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000177, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000178, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000179, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetSkillLevelText_ReturnValue_1) == 0x000180, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetSkillLevelText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_UpdateAbility_Use) == 0x000198, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_UpdateAbility_Use' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_SwitchEnum_CmpSuccess) == 0x000199, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, Temp_bool_Variable_2) == 0x00019A, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x00019B, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_Select_Default_2) == 0x00019C, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetTextFromAssetByName_ReturnValue_1) == 0x0001A0, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetTextFromAssetByName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001B0, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetTextFromAssetByName_ReturnValue_2) == 0x0001C8, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetTextFromAssetByName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x0001D8, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0001E0, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, Temp_bool_Variable_3) == 0x0001F8, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_Select_Default_3) == 0x0001F9, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_GetTextFromAssetByName_ReturnValue_3) == 0x000200, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_GetTextFromAssetByName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000210, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, Temp_bool_Variable_4) == 0x000228, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000229, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem, K2Node_Select_Default_4) == 0x00022A, "Member 'WBP_SkillListItem_C_ExecuteUbergraph_WBP_SkillListItem::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_SkillListItem.WBP_SkillListItem_C.Init
// 0x0058 (0x0058 - 0x0000)
struct WBP_SkillListItem_C_Init final
{
public:
	struct FSBSkillDataMasterData                 SBSkillDataMasterData;                             // 0x0000(0x0058)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SkillListItem_C_Init) == 0x000008, "Wrong alignment on WBP_SkillListItem_C_Init");
static_assert(sizeof(WBP_SkillListItem_C_Init) == 0x000058, "Wrong size on WBP_SkillListItem_C_Init");
static_assert(offsetof(WBP_SkillListItem_C_Init, SBSkillDataMasterData) == 0x000000, "Member 'WBP_SkillListItem_C_Init::SBSkillDataMasterData' has a wrong offset!");

// Function WBP_SkillListItem.WBP_SkillListItem_C.UpdateAbility
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_SkillListItem_C_UpdateAbility final
{
public:
	bool                                          Use;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B34[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int32>                            NewLocalVar_0;                                     // 0x0008(0x0050)(Edit, BlueprintVisible)
	class UCanvasPanel*                           Swap;                                              // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<ESkillTreeAbilityType, class UCanvasPanel*> WidgetMap;                                         // 0x0060(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TMap<ESkillTreeAbilityType, bool>             AbilityMap;                                        // 0x00B0(0x0050)(Edit, BlueprintVisible)
	TArray<struct FSBSkillTreeHorizonBranchData>  List;                                              // 0x0100(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B35[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B36[0x3];                                     // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillTreeAbilityType                         Temp_byte_Variable;                                // 0x0138(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B37[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBSkillTreeHorizonBranchData          CallFunc_Array_Get_Item;                           // 0x0140(0x0018)()
	struct FCharaSkillMasteryInfo                 CallFunc_Array_Get_Item_1;                         // 0x0158(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B38[0x1];                                     // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentSkillLevelOthersIncluded_ReturnValue; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B39[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESkillTreeAbilityType                         Temp_byte_Variable_1;                              // 0x0179(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillTreeAbilityType                         Temp_byte_Variable_2;                              // 0x017A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillTreeAbilityType                         Temp_byte_Variable_3;                              // 0x017B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3A[0x3];                                     // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESkillTreeAbilityType>                 CallFunc_Map_Keys_Keys;                            // 0x0180(0x0010)(ReferenceParm)
	ESkillTreeAbilityType                         CallFunc_Array_Get_Item_2;                         // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3B[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B3C[0x6];                                     // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           CallFunc_Map_Find_Value_1;                         // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3D[0x2];                                     // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3E[0x3];                                     // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B3F[0x3];                                     // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B40[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B41[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBSkillTreeHorizonBranchData>  CallFunc_GetBranchingSkilHorizonlListData_ReturnValue; // 0x01D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_SkillListItem_C_UpdateAbility) == 0x000008, "Wrong alignment on WBP_SkillListItem_C_UpdateAbility");
static_assert(sizeof(WBP_SkillListItem_C_UpdateAbility) == 0x0001E8, "Wrong size on WBP_SkillListItem_C_UpdateAbility");
static_assert(offsetof(WBP_SkillListItem_C_UpdateAbility, Use) == 0x000000, "Member 'WBP_SkillListItem_C_UpdateAbility::Use' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_UpdateAbility, NewLocalVar_0) == 0x000008, "Member 'WBP_SkillListItem_C_UpdateAbility::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_UpdateAbility, Swap) == 0x000058, "Member 'WBP_SkillListItem_C_UpdateAbility::Swap' has a wrong offset!");
static_assert(offsetof(WBP_SkillListItem_C_UpdateAbility, WidgetMap) == 0x000060, "Member 'WBP_SkillListItem_C_UpdateAbility::WidgetMap' has a wrong offset!");
