#pragma once

 

// Package: WBP_CharacterSelectListItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.ExecuteUbergraph_WBP_CharacterSelectListItem
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumber_MyNumber;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_7;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_8;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_9;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_10;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_11;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_12;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_13;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_14;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_15;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_16;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98CF[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98D0[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0110(0x0018)()
	int32                                         K2Node_CustomEvent_CharaIndex;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98D1[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0138(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98D2[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterSelectCaptureOne_C*        K2Node_CustomEvent_CharacterSelectCaptureOne;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_Load_Now_bLoad;                        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98D3[0x5];                                     // 0x0163(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_17;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_18;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98D4[0x1];                                     // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0184(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_19;                           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue;   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98D5[0x7];                                     // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_4;                           // 0x0218(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Vector2dToText_ReturnValue;          // 0x0260(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02A8(0x0018)()
};
static_assert(alignof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem) == 0x000008, "Wrong alignment on WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem");
static_assert(sizeof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem) == 0x0002C0, "Wrong size on WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_int_Variable) == 0x000004, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable) == 0x000008, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_1) == 0x000010, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_2) == 0x000018, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_3) == 0x000020, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_4) == 0x000028, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_5) == 0x000030, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_6) == 0x000038, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_GetNumber_MyNumber) == 0x000040, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_GetNumber_MyNumber' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_int_Variable_1) == 0x000044, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_7) == 0x000048, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_8) == 0x000050, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_9) == 0x000058, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_10) == 0x000060, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_11) == 0x000068, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_12) == 0x000070, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_13) == 0x000078, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_14) == 0x000080, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_15) == 0x000088, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_16) == 0x000090, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_bool_Variable) == 0x000098, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_byte_Variable) == 0x000099, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Select_Default) == 0x0000A0, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_byte_Variable_1) == 0x0000A8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_bool_Variable_1) == 0x0000A9, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_byte_Variable_2) == 0x0000AA, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_byte_Variable_3) == 0x0000AB, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_byte_Variable_4) == 0x0000AC, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_text_Variable) == 0x0000B0, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_text_Variable_1) == 0x0000C8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_text_Variable_2) == 0x0000E0, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_text_Variable_3) == 0x0000F8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_text_Variable_4) == 0x000110, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_CustomEvent_CharaIndex) == 0x000128, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_CustomEvent_CharaIndex' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000130, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Event_Animation) == 0x000138, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000148, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_CustomEvent_CharacterSelectCaptureOne) == 0x000150, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_CustomEvent_CharacterSelectCaptureOne' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000158, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Is_Load_Now_bLoad) == 0x000161, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Is_Load_Now_bLoad' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Not_PreBool_ReturnValue) == 0x000162, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000168, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_17) == 0x000170, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_18) == 0x000178, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Less_FloatFloat_ReturnValue) == 0x000180, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Select_Default_1) == 0x000181, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Select_Default_2) == 0x000182, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Event_MyGeometry) == 0x000184, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Event_InDeltaTime) == 0x0001BC, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, Temp_object_Variable_19) == 0x0001C0, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::Temp_object_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001C8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_FClamp_ReturnValue) == 0x0001CC, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Select_Default_3) == 0x0001D0, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Conv_IntToString_ReturnValue) == 0x0001D8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_GetBrushResourceAsMaterial_ReturnValue) == 0x0001F8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_GetBrushResourceAsMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_GetVisibility_ReturnValue) == 0x000200, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_GetObjectName_ReturnValue) == 0x000208, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, K2Node_Select_Default_4) == 0x000218, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Conv_TextToString_ReturnValue) == 0x000230, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000240, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000250, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Conv_Vector2dToText_ReturnValue) == 0x000260, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Conv_Vector2dToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000278, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000288, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000298, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0002A8, "Member 'WBP_CharacterSelectListItem_C_ExecuteUbergraph_WBP_CharacterSelectListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CharacterSelectListItem_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_Tick) == 0x000004, "Wrong alignment on WBP_CharacterSelectListItem_C_Tick");
static_assert(sizeof(WBP_CharacterSelectListItem_C_Tick) == 0x00003C, "Wrong size on WBP_CharacterSelectListItem_C_Tick");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CharacterSelectListItem_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.SetCharacterImageData
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectListItem_C_SetCharacterImageData final
{
public:
	class ABP_CharacterSelectCaptureOne_C*        Param_CharacterSelectCaptureOne;                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_SetCharacterImageData) == 0x000008, "Wrong alignment on WBP_CharacterSelectListItem_C_SetCharacterImageData");
static_assert(sizeof(WBP_CharacterSelectListItem_C_SetCharacterImageData) == 0x000008, "Wrong size on WBP_CharacterSelectListItem_C_SetCharacterImageData");
static_assert(offsetof(WBP_CharacterSelectListItem_C_SetCharacterImageData, Param_CharacterSelectCaptureOne) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_SetCharacterImageData::Param_CharacterSelectCaptureOne' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectListItem_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_CharacterSelectListItem_C_OnAnimationFinished");
static_assert(sizeof(WBP_CharacterSelectListItem_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_CharacterSelectListItem_C_OnAnimationFinished");
static_assert(offsetof(WBP_CharacterSelectListItem_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.DownLoadCharacterImage_Event
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event final
{
public:
	int32                                         CharaIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event) == 0x000004, "Wrong alignment on WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event");
static_assert(sizeof(WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event) == 0x000004, "Wrong size on WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event");
static_assert(offsetof(WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event, CharaIndex) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_DownLoadCharacterImage_Event::CharaIndex' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.SetMove
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterSelectListItem_C_SetMove final
{
public:
	int32                                         InDir;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_SetMove) == 0x000004, "Wrong alignment on WBP_CharacterSelectListItem_C_SetMove");
static_assert(sizeof(WBP_CharacterSelectListItem_C_SetMove) == 0x000004, "Wrong size on WBP_CharacterSelectListItem_C_SetMove");
static_assert(offsetof(WBP_CharacterSelectListItem_C_SetMove, InDir) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_SetMove::InDir' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.Move
// 0x0028 (0x0028 - 0x0000)
struct WBP_CharacterSelectListItem_C_Move final
{
public:
	float                                         MaxLengthX;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PosX;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98D6[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_Move) == 0x000004, "Wrong alignment on WBP_CharacterSelectListItem_C_Move");
static_assert(sizeof(WBP_CharacterSelectListItem_C_Move) == 0x000028, "Wrong size on WBP_CharacterSelectListItem_C_Move");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, MaxLengthX) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_Move::MaxLengthX' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, PosX) == 0x000004, "Member 'WBP_CharacterSelectListItem_C_Move::PosX' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00000C, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_MakeVector2D_ReturnValue) == 0x000018, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_Abs_ReturnValue) == 0x000020, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Move, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'WBP_CharacterSelectListItem_C_Move::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.Download Chara Image
// 0x0004 (0x0004 - 0x0000)
struct WBP_CharacterSelectListItem_C_Download_Chara_Image final
{
public:
	int32                                         CharaIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_Download_Chara_Image) == 0x000004, "Wrong alignment on WBP_CharacterSelectListItem_C_Download_Chara_Image");
static_assert(sizeof(WBP_CharacterSelectListItem_C_Download_Chara_Image) == 0x000004, "Wrong size on WBP_CharacterSelectListItem_C_Download_Chara_Image");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Download_Chara_Image, CharaIndex) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_Download_Chara_Image::CharaIndex' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.Set Chara Image
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectListItem_C_Set_Chara_Image final
{
public:
	class UTexture2DDynamic*                      InTex;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_Set_Chara_Image) == 0x000008, "Wrong alignment on WBP_CharacterSelectListItem_C_Set_Chara_Image");
static_assert(sizeof(WBP_CharacterSelectListItem_C_Set_Chara_Image) == 0x000008, "Wrong size on WBP_CharacterSelectListItem_C_Set_Chara_Image");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Set_Chara_Image, InTex) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_Set_Chara_Image::InTex' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.PlayDelAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectListItem_C_PlayDelAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_PlayDelAnim) == 0x000008, "Wrong alignment on WBP_CharacterSelectListItem_C_PlayDelAnim");
static_assert(sizeof(WBP_CharacterSelectListItem_C_PlayDelAnim) == 0x000008, "Wrong size on WBP_CharacterSelectListItem_C_PlayDelAnim");
static_assert(offsetof(WBP_CharacterSelectListItem_C_PlayDelAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_PlayDelAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.ResetMaskCanvas
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterSelectListItem_C_ResetMaskCanvas final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_ResetMaskCanvas) == 0x000008, "Wrong alignment on WBP_CharacterSelectListItem_C_ResetMaskCanvas");
static_assert(sizeof(WBP_CharacterSelectListItem_C_ResetMaskCanvas) == 0x000008, "Wrong size on WBP_CharacterSelectListItem_C_ResetMaskCanvas");
static_assert(offsetof(WBP_CharacterSelectListItem_C_ResetMaskCanvas, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_ResetMaskCanvas::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelectListItem.WBP_CharacterSelectListItem_C.Set Delete Mode
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterSelectListItem_C_Set_Delete_Mode final
{
public:
	bool                                          bDeleteMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CharacterSelectListItem_C_Set_Delete_Mode) == 0x000001, "Wrong alignment on WBP_CharacterSelectListItem_C_Set_Delete_Mode");
static_assert(sizeof(WBP_CharacterSelectListItem_C_Set_Delete_Mode) == 0x000001, "Wrong size on WBP_CharacterSelectListItem_C_Set_Delete_Mode");
static_assert(offsetof(WBP_CharacterSelectListItem_C_Set_Delete_Mode, bDeleteMode) == 0x000000, "Member 'WBP_CharacterSelectListItem_C_Set_Delete_Mode::bDeleteMode' has a wrong offset!");

}

