#pragma once

 

// Package: WBP_ShopMenuDetailsNameParts

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.ExecuteUbergraph_WBP_ShopMenuDetailsNameParts
// 0x0558 (0x0558 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EAA[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAB[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EAC[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EAD[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EAE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_1;           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EAF[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid_2;           // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB0[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue_2;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB1[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_1;                          // 0x0090(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB2[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB3[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x00D0(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB4[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_2;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_2;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB5[0x6];                                     // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0110(0x0018)()
	ESBRewardItemType                             K2Node_CustomEvent_RewardType_2;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB6[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_id_2;                           // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB7[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Reward_Item_Name_and_Type_OutName;    // 0x0138(0x0018)()
	class FText                                   CallFunc_Get_Reward_Item_Name_and_Type_OutType;    // 0x0150(0x0018)()
	bool                                          CallFunc_Get_Reward_Item_Name_and_Type_OutNoName;  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_3;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBRewardItemType                             K2Node_CustomEvent_RewardType_1;                   // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_id_1;                           // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Amount;                         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AmountMin;                      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EB8[0x7];                                     // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRewardItemNameAndType2_OutName;        // 0x0180(0x0018)()
	class FText                                   CallFunc_GetRewardItemNameAndType2_OutType;        // 0x0198(0x0018)()
	bool                                          CallFunc_GetRewardItemNameAndType2_OutNoName;      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EB9[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x01B8(0x0018)()
	ESBRewardItemType                             K2Node_CustomEvent_RewardType;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EBA[0x3];                                     // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_id;                             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_UniqueId;                       // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FOwnItemInfo                           CallFunc_FindItemByAllStorage_OutResult;           // 0x01E8(0x0118)()
	bool                                          CallFunc_FindItemByAllStorage_ReturnValue;         // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindMountImagineMaster_bIsValid;          // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EBB[0x5];                                     // 0x0303(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterMountImagine                  CallFunc_FindMountImagineMaster_MountImagineMaster; // 0x0308(0x0070)()
	bool                                          CallFunc_FindImagineMaster_bIsValid;               // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EBC[0x7];                                     // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterImagine                       CallFunc_FindImagineMaster_ImagineMaster;          // 0x0380(0x00B0)()
	int32                                         CallFunc_BP_GetStackBMax_ReturnValue;              // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BP_GetStackBMax_ReturnValue_1;            // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindWeaponMaster_bIsValid;                // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EBD[0x7];                                     // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBWeaponMasterData                    CallFunc_FindWeaponMaster_WeaponMaster;            // 0x0448(0x00B0)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EBE[0x3];                                     // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BP_GetStackBMax_ReturnValue_2;            // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EBF[0x2];                                     // 0x0502(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStackBIconOneItemBase_Visible;         // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStackBIconOneItemBase_Visible_1;       // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x050B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Stack_BIcon_One_Item_Visible;         // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EC0[0x3];                                     // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_3;                          // 0x0510(0x0010)(ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC1[0x7];                                     // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_3;        // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EC2[0x7];                                     // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_7;                           // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStackBIconOneItemBase_Visible_2;       // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0555(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts) == 0x000558, "Wrong size on WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, EntryPoint) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable) == 0x000005, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000007, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_IsEmpty_ReturnValue) == 0x000009, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_int_Variable) == 0x00000C, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000010, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_2) == 0x000030, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000038, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000040, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetDisplayName_ReturnValue) == 0x000048, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetMasterDataManager_IsValid) == 0x000058, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetMasterDataManager_ReturnValue) == 0x000060, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_3) == 0x000068, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000069, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetMasterDataManager_IsValid_1) == 0x00006A, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetMasterDataManager_IsValid_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetMasterDataManager_ReturnValue_1) == 0x000070, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetMasterDataManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000078, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_4) == 0x000079, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00007A, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetMasterDataManager_IsValid_2) == 0x00007B, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetMasterDataManager_IsValid_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetMasterDataManager_ReturnValue_2) == 0x000080, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetMasterDataManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_int_Variable_1) == 0x000088, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_MakeArray_Array_1) == 0x000090, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_5) == 0x0000A8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0000B0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetDisplayName_ReturnValue_1) == 0x0000B8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_IsEmpty_ReturnValue_1) == 0x0000C8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x0000C9, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_6) == 0x0000CA, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_MakeArray_Array_2) == 0x0000D0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x0000E0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Array_Get_Item_2) == 0x0000E8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_K2_GetRootComponent_ReturnValue_2) == 0x0000F0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_K2_GetRootComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetDisplayName_ReturnValue_2) == 0x0000F8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_IsEmpty_ReturnValue_2) == 0x000108, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_IsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_7) == 0x000109, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_InText) == 0x000110, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_RewardType_2) == 0x000128, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_RewardType_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_id_2) == 0x00012C, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_id_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Event_IsDesignTime) == 0x000130, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Get_Reward_Item_Name_and_Type_OutName) == 0x000138, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Get_Reward_Item_Name_and_Type_OutName' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Get_Reward_Item_Name_and_Type_OutType) == 0x000150, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Get_Reward_Item_Name_and_Type_OutType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Get_Reward_Item_Name_and_Type_OutNoName) == 0x000168, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Get_Reward_Item_Name_and_Type_OutNoName' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_IsEmpty_ReturnValue_3) == 0x000169, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_IsEmpty_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Not_PreBool_ReturnValue) == 0x00016A, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_RewardType_1) == 0x00016B, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_RewardType_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_id_1) == 0x00016C, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_id_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_Amount) == 0x000170, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_Amount' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_AmountMin) == 0x000174, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_AmountMin' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default) == 0x000178, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetRewardItemNameAndType2_OutName) == 0x000180, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetRewardItemNameAndType2_OutName' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetRewardItemNameAndType2_OutType) == 0x000198, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetRewardItemNameAndType2_OutType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetRewardItemNameAndType2_OutNoName) == 0x0001B0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetRewardItemNameAndType2_OutNoName' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_1) == 0x0001B8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_RewardType) == 0x0001D0, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_RewardType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_id) == 0x0001D4, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_id' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_CustomEvent_UniqueId) == 0x0001D8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_CustomEvent_UniqueId' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindItemByAllStorage_OutResult) == 0x0001E8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindItemByAllStorage_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindItemByAllStorage_ReturnValue) == 0x000300, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindItemByAllStorage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000301, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindMountImagineMaster_bIsValid) == 0x000302, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindMountImagineMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindMountImagineMaster_MountImagineMaster) == 0x000308, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindMountImagineMaster_MountImagineMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindImagineMaster_bIsValid) == 0x000378, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindImagineMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindImagineMaster_ImagineMaster) == 0x000380, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindImagineMaster_ImagineMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_BP_GetStackBMax_ReturnValue) == 0x000430, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_BP_GetStackBMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_BP_GetStackBMax_ReturnValue_1) == 0x000434, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_BP_GetStackBMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_2) == 0x000438, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_3) == 0x00043C, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindWeaponMaster_bIsValid) == 0x000440, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindWeaponMaster_bIsValid' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_FindWeaponMaster_WeaponMaster) == 0x000448, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_FindWeaponMaster_WeaponMaster' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004F8, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_BP_GetStackBMax_ReturnValue_2) == 0x0004FC, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_BP_GetStackBMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000500, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000501, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_int_Variable_2) == 0x000504, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_SetStackBIconOneItemBase_Visible) == 0x000508, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_SetStackBIconOneItemBase_Visible' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_SetStackBIconOneItemBase_Visible_1) == 0x000509, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_SetStackBIconOneItemBase_Visible_1' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_4) == 0x00050A, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_5) == 0x00050B, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Set_Stack_BIcon_One_Item_Visible) == 0x00050C, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Set_Stack_BIcon_One_Item_Visible' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_MakeArray_Array_3) == 0x000510, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_6) == 0x000520, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_Array_Get_Item_3) == 0x000528, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_K2_GetRootComponent_ReturnValue_3) == 0x000530, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_K2_GetRootComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, Temp_bool_Variable_8) == 0x000538, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_GetDisplayName_ReturnValue_3) == 0x000540, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_7) == 0x000550, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, CallFunc_SetStackBIconOneItemBase_Visible_2) == 0x000554, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::CallFunc_SetStackBIconOneItemBase_Visible_2' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts, K2Node_Select_Default_8) == 0x000555, "Member 'WBP_ShopMenuDetailsNameParts_C_ExecuteUbergraph_WBP_ShopMenuDetailsNameParts::K2Node_Select_Default_8' has a wrong offset!");

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.SetStackB
// 0x0018 (0x0018 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_SetStackB final
{
public:
	ESBRewardItemType                             RewardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 UniqueId;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_SetStackB) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_SetStackB");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_SetStackB) == 0x000018, "Wrong size on WBP_ShopMenuDetailsNameParts_C_SetStackB");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetStackB, RewardType) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_SetStackB::RewardType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetStackB, ID) == 0x000004, "Member 'WBP_ShopMenuDetailsNameParts_C_SetStackB::ID' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetStackB, UniqueId) == 0x000008, "Member 'WBP_ShopMenuDetailsNameParts_C_SetStackB::UniqueId' has a wrong offset!");

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.SetNameAndType2
// 0x0010 (0x0010 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_SetNameAndType2 final
{
public:
	ESBRewardItemType                             RewardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC4[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmountMin;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType2) == 0x000004, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_SetNameAndType2");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType2) == 0x000010, "Wrong size on WBP_ShopMenuDetailsNameParts_C_SetNameAndType2");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType2, RewardType) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_SetNameAndType2::RewardType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType2, ID) == 0x000004, "Member 'WBP_ShopMenuDetailsNameParts_C_SetNameAndType2::ID' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType2, Amount) == 0x000008, "Member 'WBP_ShopMenuDetailsNameParts_C_SetNameAndType2::Amount' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType2, AmountMin) == 0x00000C, "Member 'WBP_ShopMenuDetailsNameParts_C_SetNameAndType2::AmountMin' has a wrong offset!");

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_PreConstruct");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_PreConstruct) == 0x000001, "Wrong size on WBP_ShopMenuDetailsNameParts_C_PreConstruct");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.SetNameAndType
// 0x0008 (0x0008 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_SetNameAndType final
{
public:
	ESBRewardItemType                             RewardType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType) == 0x000004, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_SetNameAndType");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType) == 0x000008, "Wrong size on WBP_ShopMenuDetailsNameParts_C_SetNameAndType");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType, RewardType) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_SetNameAndType::RewardType' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetNameAndType, ID) == 0x000004, "Member 'WBP_ShopMenuDetailsNameParts_C_SetNameAndType::ID' has a wrong offset!");

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_SetText) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_SetText");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_SetText) == 0x000018, "Wrong size on WBP_ShopMenuDetailsNameParts_C_SetText");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetText, InText) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_SetText::InText' has a wrong offset!");

// Function WBP_ShopMenuDetailsNameParts.WBP_ShopMenuDetailsNameParts_C.SetBonus
// 0x0060 (0x0060 - 0x0000)
struct WBP_ShopMenuDetailsNameParts_C_SetBonus final
{
public:
	bool                                          bBonus;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7EC6[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7EC7[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(WBP_ShopMenuDetailsNameParts_C_SetBonus) == 0x000008, "Wrong alignment on WBP_ShopMenuDetailsNameParts_C_SetBonus");
static_assert(sizeof(WBP_ShopMenuDetailsNameParts_C_SetBonus) == 0x000060, "Wrong size on WBP_ShopMenuDetailsNameParts_C_SetBonus");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetBonus, bBonus) == 0x000000, "Member 'WBP_ShopMenuDetailsNameParts_C_SetBonus::bBonus' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetBonus, Temp_bool_Variable) == 0x000001, "Member 'WBP_ShopMenuDetailsNameParts_C_SetBonus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ShopMenuDetailsNameParts_C_SetBonus, Temp_struct_Variable) == 0x000004, "Member 'WBP_ShopMenuDetailsNameParts_C_SetBonus::Temp_struct_Variable' has a wrong offset!");
