#pragma once

 

// Package: WBP_ToolTipDetailsDateTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.ExecuteUbergraph_WBP_ToolTipDetailsDateTime
// 0x0088 (0x0088 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9575[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventTermId_2;                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetEventTermEndTime_OutEndTime;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEventTermEndTime_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9576[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventTermId_1;                  // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DurationMinutes_1;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     K2Node_CustomEvent_ItemType_1;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9577[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_CustomEvent_ExpiryDateTime_1;               // 0x0048(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue_1;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9578[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventTermId;                    // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DurationMinutes;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     K2Node_CustomEvent_ItemType;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9579[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              K2Node_CustomEvent_ExpiryDateTime;                 // 0x0078(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBDateTimeTextRemainTimeFlag                 CallFunc_SetDateTime_ReturnValue_2;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime) == 0x000088, "Wrong size on WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, EntryPoint) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, Temp_bool_Variable) == 0x000006, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000007, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000008, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000009, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_EventTermId_2) == 0x000010, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_EventTermId_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_GetEventTermEndTime_OutEndTime) == 0x000020, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_GetEventTermEndTime_OutEndTime' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_GetEventTermEndTime_ReturnValue) == 0x000028, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_GetEventTermEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_SetDateTime_ReturnValue) == 0x000029, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_SetDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_EventTermId_1) == 0x000030, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_EventTermId_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_DurationMinutes_1) == 0x000040, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_DurationMinutes_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_ItemType_1) == 0x000044, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_ItemType_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000045, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_ExpiryDateTime_1) == 0x000048, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_ExpiryDateTime_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_SetDateTime_ReturnValue_1) == 0x000050, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_SetDateTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_EventTermId) == 0x000058, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_EventTermId' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_DurationMinutes) == 0x000068, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_DurationMinutes' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_ItemType) == 0x00006C, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_ItemType' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_Event_IsDesignTime) == 0x00006D, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00006E, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_IsEmpty_ReturnValue) == 0x00006F, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_Not_PreBool_ReturnValue_1) == 0x000070, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_BooleanOR_ReturnValue) == 0x000071, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_CustomEvent_ExpiryDateTime) == 0x000078, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_CustomEvent_ExpiryDateTime' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_Select_Default) == 0x000080, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_SetDateTime_ReturnValue_2) == 0x000081, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_SetDateTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000082, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, Temp_bool_Variable_1) == 0x000083, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime, K2Node_Select_Default_1) == 0x000084, "Member 'WBP_ToolTipDetailsDateTime_C_ExecuteUbergraph_WBP_ToolTipDetailsDateTime::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetExpiryDateTimeEndDisplay
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay final
{
public:
	struct FDateTime                              ExpiryDateTime;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay) == 0x000008, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay, ExpiryDateTime) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetExpiryDateTimeEndDisplay::ExpiryDateTime' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_PreConstruct");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_PreConstruct) == 0x000001, "Wrong size on WBP_ToolTipDetailsDateTime_C_PreConstruct");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetDataAndVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility final
{
public:
	class FString                                 EventTermId;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         DurationMinutes;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Param_ItemType;                                    // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility) == 0x000018, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility, EventTermId) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility::EventTermId' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility, DurationMinutes) == 0x000010, "Member 'WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility::DurationMinutes' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility, Param_ItemType) == 0x000014, "Member 'WBP_ToolTipDetailsDateTime_C_SetDataAndVisibility::Param_ItemType' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetExpiryDateTime
// 0x0008 (0x0008 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime final
{
public:
	struct FDateTime                              ExpiryDateTime;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime) == 0x000008, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime, ExpiryDateTime) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetExpiryDateTime::ExpiryDateTime' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetData
// 0x0018 (0x0018 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetData final
{
public:
	class FString                                 EventTermId;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         DurationMinutes;                                   // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Param_ItemType;                                    // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetData) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetData");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetData) == 0x000018, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetData");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetData, EventTermId) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetData::EventTermId' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetData, DurationMinutes) == 0x000010, "Member 'WBP_ToolTipDetailsDateTime_C_SetData::DurationMinutes' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetData, Param_ItemType) == 0x000014, "Member 'WBP_ToolTipDetailsDateTime_C_SetData::Param_ItemType' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetEventTermId
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetEventTermId final
{
public:
	class FString                                 EventTermId;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetEventTermId) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetEventTermId");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetEventTermId) == 0x000010, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetEventTermId");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetEventTermId, EventTermId) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetEventTermId::EventTermId' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetDurationMinutes
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetDurationMinutes final
{
public:
	int32                                         DurationMinutes;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_957A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetDurationMinutes) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetDurationMinutes");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetDurationMinutes) == 0x000010, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetDurationMinutes");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetDurationMinutes, DurationMinutes) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetDurationMinutes::DurationMinutes' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetDurationMinutes, CallFunc_MakeTimespan_ReturnValue) == 0x000008, "Member 'WBP_ToolTipDetailsDateTime_C_SetDurationMinutes::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetMessage
// 0x0050 (0x0050 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetMessage final
{
public:
	EItemType                                     InItemType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBDateTimeTextTemplate                       Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBDateTimeTextTemplate                       Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_957B[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType                                     Temp_byte_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_957C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBDateTimeTextTemplate                       K2Node_Select_Default_1;                           // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue_1;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetMessage) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetMessage");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetMessage) == 0x000050, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetMessage");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, InItemType) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::InItemType' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_byte_Variable) == 0x000001, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_bool_Variable) == 0x000004, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_float_Variable) == 0x000008, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_float_Variable_1) == 0x00000C, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_byte_Variable_2) == 0x000010, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, K2Node_Select_Default) == 0x000014, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, K2Node_MakeStruct_Margin) == 0x000018, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_int_Variable) == 0x000028, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_int_Variable_1) == 0x00002C, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_int_Variable_2) == 0x000030, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, CallFunc_MakeLiteralByte_ReturnValue) == 0x000034, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_bool_Variable_1) == 0x000035, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, Temp_bool_Variable_2) == 0x000036, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, K2Node_Select_Default_1) == 0x000037, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000038, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, CallFunc_MakeLiteralInt_ReturnValue) == 0x000040, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, CallFunc_MakeLiteralInt_ReturnValue_1) == 0x000044, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::CallFunc_MakeLiteralInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, K2Node_Select_Default_2) == 0x000048, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00004C, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessage, K2Node_Select_Default_3) == 0x00004D, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessage::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetMessageTextColor
// 0x0050 (0x0050 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetMessageTextColor final
{
public:
	struct FSlateColor                            LimitTime;                                         // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateColor                            Desc;                                              // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetMessageTextColor) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetMessageTextColor");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetMessageTextColor) == 0x000050, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetMessageTextColor");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessageTextColor, LimitTime) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessageTextColor::LimitTime' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetMessageTextColor, Desc) == 0x000028, "Member 'WBP_ToolTipDetailsDateTime_C_SetMessageTextColor::Desc' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetLimitTimer
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetLimitTimer final
{
public:
	struct FDateTime                              InDateTime;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 TmpLimitTimeStr;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         TmpDays;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpHours;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpMin;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_957D[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_957E[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_957F[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9580[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9581[0x7];                                     // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_SBUtcNow_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetLimitTimer");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer) == 0x0001E0, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetLimitTimer");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, InDateTime) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::InDateTime' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, TmpLimitTimeStr) == 0x000008, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::TmpLimitTimeStr' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, TmpDays) == 0x000018, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::TmpDays' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, TmpHours) == 0x00001C, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::TmpHours' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, TmpMin) == 0x000020, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::TmpMin' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_GetTextFromAsset_ReturnValue) == 0x000028, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000E0, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_GetTextFromAsset_ReturnValue_1) == 0x0000F0, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_GetTextFromAsset_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Replace_ReturnValue) == 0x000100, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Greater_IntInt_ReturnValue) == 0x000120, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_GetTextFromAsset_ReturnValue_2) == 0x000128, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_GetTextFromAsset_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000138, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Replace_ReturnValue_1) == 0x000148, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000158, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000160, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BooleanAND_ReturnValue) == 0x000170, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_GetTextFromAsset_ReturnValue_3) == 0x000178, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_GetTextFromAsset_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Replace_ReturnValue_2) == 0x000188, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Replace_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000198, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001A8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_SBUtcNow_ReturnValue) == 0x0001B0, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_SBUtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x0001B8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BreakTimespan_Days) == 0x0001C0, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BreakTimespan_Hours) == 0x0001C4, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BreakTimespan_Minutes) == 0x0001C8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BreakTimespan_Seconds) == 0x0001CC, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BreakTimespan_Milliseconds) == 0x0001D0, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Greater_IntInt_ReturnValue_2) == 0x0001D4, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Greater_IntInt_ReturnValue_3) == 0x0001D5, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_Greater_IntInt_ReturnValue_4) == 0x0001D6, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_Greater_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BooleanOR_ReturnValue) == 0x0001D7, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SetLimitTimer, CallFunc_BooleanOR_ReturnValue_1) == 0x0001D8, "Member 'WBP_ToolTipDetailsDateTime_C_SetLimitTimer::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SwitchingRecipeHeader
// 0x0004 (0x0004 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader) == 0x000004, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader) == 0x000004, "Wrong size on WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader");
static_assert(offsetof(WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'WBP_ToolTipDetailsDateTime_C_SwitchingRecipeHeader::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function WBP_ToolTipDetailsDateTime.WBP_ToolTipDetailsDateTime_C.SetCommunicationSettingMenuAchievement
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_ToolTipDetailsDateTime_C_SetCommunicationSettingMenuAchievement final
{
public:
	struct FDateTime                              InDateTime;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 TmpLimitTimeStr;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         TmpMin;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpHours;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TmpDays;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9582[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_SBUtcNow_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9583[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_1;           // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9584[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_2;           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_3;           // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_2;                    // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_4;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9585[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue_4;           // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01E0(0x0018)()
};
static_assert(alignof(WBP_ToolTipDetailsDateTime_C_SetCommunicationSettingMenuAchievement) == 0x000008, "Wrong alignment on WBP_ToolTipDetailsDateTime_C_SetCommunicationSettingMenuAchievement");
static_assert(sizeof(WBP_ToolTipDetailsDateTime_C_SetCommunicationSettingMenuAchievement) == 0x0001F8, "Wrong size on WBP_ToolTipDetailsDateTime_C_SetCommunicationSettingMenuAchievement");
