#pragma once

 

// Package: WBP_T_ApartShop

#include "Basic.hpp"

#include "InventoryItemData_structs.hpp"
#include "ESelectItemCategoryMode_structs.hpp"
#include "SkyBlue_structs.hpp"
#include "UMG_structs.hpp"
#include "InventoryData_structs.hpp"
#include "StorageGridType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_T_ApartShop.WBP_T_ApartShop_C.ExecuteUbergraph_WBP_T_ApartShop
// 0x0748 (0x0748 - 0x0000)
struct WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_794C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_CustomEvent_InputPin;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStorageGridType                              K2Node_CustomEvent_LastClickGridType;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Icon_Select_Items_bAdd;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_794D[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Set_Icon_Select_Items_bAdd_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_794E[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSelected;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_794F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridPanel*                             K2Node_CustomEvent_InputPin_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7950[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7951[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7952[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0078(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00A0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00C8(0x0028)()
	ESBItemSortType                               CallFunc_GetSortRule_SortType;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetStorageNum_Num;                        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStorageNum_Max;                        // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCategoryModeName_ReturnValue;          // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7953[0x4];                                     // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7954[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7955[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFilterGroup>                   K2Node_ComponentBoundEvent_Filters;                // 0x0140(0x0010)(ReferenceParm)
	class UShopCmnBtn1_C*                         K2Node_ComponentBoundEvent_ClickBtn;               // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_TabID;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7956[0x4];                                     // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7957[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_CustomEvent_SelectItem_3;                   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7958[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_CustomEvent_SelectItem_2;                   // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemIconBtn_C*                         K2Node_CustomEvent_SelectItem_1;                   // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7959[0x4];                                     // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_CustomEvent_SelectItem;                     // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlaySE_ReturnValue;                       // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795A[0x3];                                     // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_CurrentOffset_1;        // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795B[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridPanel*                             K2Node_CustomEvent_Slot;                           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Offset;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795C[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_795D[0x7];                                     // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn;                // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_795E[0x7];                                     // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridPanel*                             K2Node_CustomEvent_Grid;                           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795F[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn_1;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7960[0x3];                                     // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7961[0x3];                                     // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStorageGridType                              K2Node_CustomEvent_InType;                         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ScrollReset;                    // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7962[0x3];                                     // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetItemListContainer_ReturnValue;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBOwnItemListContainer*                CallFunc_GetItemListContainer_ReturnValue_1;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapacity_ReturnValue;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7963[0x4];                                     // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOwnItemInfo                           CallFunc_BP_GetSortedItemAt_ReturnValue;           // 0x0240(0x0118)(ConstParm)
	int32                                         CallFunc_GetSotedIndexNum_ReturnValue;             // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7964[0x4];                                     // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData                         CallFunc_CreateInventoryData_InventoryData;        // 0x0360(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_CreateInventoryData_IsSuccess;            // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7965[0x3];                                     // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7966[0x2];                                     // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCapacity_ReturnValue_1;                // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7967[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0410(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0418(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FFilterGroup                           CallFunc_Array_Get_Item;                           // 0x0420(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7968[0x4];                                     // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_Get_Inventory_Brunch_ReturnValue;         // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapacity_ReturnValue_2;                // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetUseBlockNum_ReturnValue;               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0448(0x0018)()
	bool                                          K2Node_CustomEvent_KeepPage_1;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7969[0x3];                                     // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemFilterType                               CallFunc_Get_Filter_Type_FilterType;               // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796A[0x6];                                     // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilterGroup                           K2Node_MakeStruct_FilterGroup;                     // 0x0470(0x0010)()
	struct FFilterGroup                           CallFunc_EmptyFilter_ReturnValue;                  // 0x0480(0x0010)()
	struct FFilterGroup                           CallFunc_AddFilter_ReturnValue;                    // 0x0490(0x0010)()
	EStorageGridType                              Temp_byte_Variable;                                // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStorageGridType                              Temp_byte_Variable_1;                              // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStorageGridType                              Temp_byte_Variable_2;                              // 0x04A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796B[0x4];                                     // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInventoryData>                 K2Node_Select_Default;                             // 0x04A8(0x0010)(ReferenceParm)
	class UScrollBox*                             K2Node_Select_Default_1;                           // 0x04B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryData                         CallFunc_Array_Get_Item_1;                         // 0x04C0(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EStorageGridType                              Temp_byte_Variable_3;                              // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0562(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796C[0x5];                                     // 0x0563(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           K2Node_Select_Default_2;                           // 0x0568(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_3;                           // 0x0570(0x0028)()
	TDelegate<void(class UItemIconBtn_C* SelectItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0598(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UItemIconBtn_C* SelectItem)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x05A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UItemIconBtn_C* SelectItem)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x05B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UItemIconBtn_C* SelectItem)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x05C8(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x05D8(0x0018)()
	class USBOwnItemListContainer*                CallFunc_GetEquipmentBag_ReturnValue;              // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapacity_ReturnValue_3;                // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_796D[0x4];                                     // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue_3;           // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0611(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796E[0x2];                                     // 0x0612(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_796F[0x7];                                     // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBOwnItemListContainer*                CallFunc_GetInventory_ReturnValue;                 // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCapacity_ReturnValue_4;                // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x062C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7970[0x3];                                     // 0x062D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlaySE_ReturnValue_1;                     // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_4;                           // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUIManager_IsValid;                     // 0x0639(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7971[0x6];                                     // 0x063A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBUIManager*                           CallFunc_GetUIManager_ReturnValue;                 // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_5;                           // 0x0648(0x0028)()
	ESBItemSortType                               CallFunc_GetSortRule_SortType_1;                   // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7972[0x7];                                     // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0678(0x0018)()
	int32                                         Temp_int_Variable_4;                               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7973[0x4];                                     // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0698(0x0018)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn_2;              // 0x06B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7974[0x2];                                     // 0x06C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7975[0x7];                                     // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue;             // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             K2Node_Select_Default_6;                           // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBEventExecutor*                       CallFunc_GetEventExecutor_ReturnValue_1;           // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_KeepPage;                       // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x06EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7976[0x1];                                     // 0x06EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x06EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_PageCurrent;            // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalcPageIndex_Active;                     // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7977[0x3];                                     // 0x06FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CalcPageIndex_Index;                      // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7978[0x4];                                     // 0x0704(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_3;                 // 0x0708(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7979[0x4];                                     // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemIconBtn_C*                         K2Node_DynamicCast_AsItem_Icon_Btn_3;              // 0x0718(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_797A[0x3];                                     // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_8;                           // 0x0724(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0729(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x072A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_797B[0x1];                                     // 0x072B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCategoryModeName_ReturnValue_1;        // 0x072C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCategoryModeName_ReturnValue_2;        // 0x0734(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBItemSortType                               CallFunc_GetRecentSortType_ReturnValue;            // 0x073C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_797C[0x3];                                     // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue_1;           // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop) == 0x000008, "Wrong alignment on WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop");
static_assert(sizeof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop) == 0x000748, "Wrong size on WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, EntryPoint) == 0x000000, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_InputPin) == 0x000008, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_LastClickGridType) == 0x000010, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_LastClickGridType' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Set_Icon_Select_Items_bAdd) == 0x000011, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Set_Icon_Select_Items_bAdd' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, Temp_int_Variable) == 0x000014, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, Temp_int_Variable_1) == 0x00001C, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Set_Icon_Select_Items_bAdd_1) == 0x000021, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Set_Icon_Select_Items_bAdd_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_IsSelected) == 0x000028, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_InputPin_1) == 0x000030, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_InputPin_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_IsVisible) == 0x000038, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_IsVisible' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetChildrenCount_ReturnValue) == 0x00003C, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000070, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_MakeStruct_SlateColor_1) == 0x000078, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_MakeStruct_SlateColor_2) == 0x0000A0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_MakeStruct_SlateColor_3) == 0x0000C8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetSortRule_SortType) == 0x0000F0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetSortRule_SortType' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x0000F1, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000F2, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x0000F3, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetStorageNum_Num) == 0x0000F4, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetStorageNum_Num' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetStorageNum_Max) == 0x0000F8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetStorageNum_Max' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetCategoryModeName_ReturnValue) == 0x0000FC, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetCategoryModeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetSelectedIndex_ReturnValue) == 0x000104, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, Temp_int_Array_Index_Variable) == 0x000108, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_SelectedItem_1) == 0x000110, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_SelectionType_1) == 0x000120, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_SelectedItem) == 0x000128, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_SelectionType) == 0x000138, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_Filters) == 0x000140, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_Filters' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_ClickBtn) == 0x000150, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_ClickBtn' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_TabID) == 0x000158, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_TabID' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_PlayAnimation_ReturnValue) == 0x000160, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, Temp_int_Variable_2) == 0x000168, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_SelectItem_3) == 0x000170, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_SelectItem_3' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Add_IntInt_ReturnValue_2) == 0x000178, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_SelectItem_2) == 0x000180, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_SelectItem_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_SelectItem_1) == 0x000188, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_SelectItem_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, Temp_int_Loop_Counter_Variable) == 0x000190, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_SelectItem) == 0x000198, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_SelectItem' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001A0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_PlaySE_ReturnValue) == 0x0001A4, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001A8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_CurrentOffset_1) == 0x0001AC, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_CurrentOffset_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_ComponentBoundEvent_CurrentOffset) == 0x0001B0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_ComponentBoundEvent_CurrentOffset' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_Slot) == 0x0001B8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_Offset) == 0x0001C0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_Offset' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetChildrenCount_ReturnValue_1) == 0x0001C4, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001C8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetChildAt_ReturnValue) == 0x0001D0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001D8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_DynamicCast_AsItem_Icon_Btn) == 0x0001E0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_DynamicCast_AsItem_Icon_Btn' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_DynamicCast_bSuccess) == 0x0001E8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_Grid) == 0x0001F0, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_Grid' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetChildAt_ReturnValue_1) == 0x0001F8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetChildrenCount_ReturnValue_2) == 0x000200, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetChildrenCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_DynamicCast_AsItem_Icon_Btn_1) == 0x000208, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_DynamicCast_AsItem_Icon_Btn_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_DynamicCast_bSuccess_1) == 0x000210, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000214, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000218, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, Temp_int_Array_Index_Variable_1) == 0x00021C, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000220, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_InType) == 0x000221, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_InType' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_ScrollReset) == 0x000222, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_ScrollReset' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000223, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_SwitchEnum_CmpSuccess) == 0x000224, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetItemListContainer_ReturnValue) == 0x000228, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetItemListContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetItemListContainer_ReturnValue_1) == 0x000230, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetItemListContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetCapacity_ReturnValue) == 0x000238, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetCapacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_BP_GetSortedItemAt_ReturnValue) == 0x000240, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_BP_GetSortedItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetSotedIndexNum_ReturnValue) == 0x000358, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetSotedIndexNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_CreateInventoryData_InventoryData) == 0x000360, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_CreateInventoryData_InventoryData' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_CreateInventoryData_IsSuccess) == 0x0003F8, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_CreateInventoryData_IsSuccess' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0003FC, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000400, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Greater_IntInt_ReturnValue) == 0x000401, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetCapacity_ReturnValue_1) == 0x000404, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetCapacity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_SwitchEnum_CmpSuccess_1) == 0x000408, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_K2_SetTimer_ReturnValue) == 0x000410, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000418, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Array_Get_Item) == 0x000420, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Array_Length_ReturnValue) == 0x000430, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Get_Inventory_Brunch_ReturnValue) == 0x000438, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Get_Inventory_Brunch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetCapacity_ReturnValue_2) == 0x000440, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetCapacity_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_GetUseBlockNum_ReturnValue) == 0x000444, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_GetUseBlockNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, CallFunc_Conv_IntToText_ReturnValue) == 0x000448, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop, K2Node_CustomEvent_KeepPage_1) == 0x000460, "Member 'WBP_T_ApartShop_C_ExecuteUbergraph_WBP_T_ApartShop::K2Node_CustomEvent_KeepPage_1' has a wrong offset!");
