#pragma once

 

// Package: WeaponSynthePart_PerkSlotItem

#include "Basic.hpp"

#include "SlotDataChangeType_structs.hpp"
#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.OnClickedLock__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature final
{
public:
	bool                                          Param_IsLock;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature, Param_IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_OnClickedLock__DelegateSignature::Param_IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.ExecuteUbergraph_WeaponSynthePart_PerkSlotItem
// 0x0008 (0x0008 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsLock;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem) == 0x000008, "Wrong size on WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem, EntryPoint) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem, K2Node_ComponentBoundEvent_IsLock) == 0x000005, "Member 'WeaponSynthePart_PerkSlotItem_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotItem::K2Node_ComponentBoundEvent_IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	bool                                          Param_IsLock;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Param_IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_BndEvt__WeaponSynthePart_PerkSlotItem_Part_ButtonLock_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Param_IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_PreConstruct) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_PreConstruct");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_PreConstruct) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotItem_C_PreConstruct");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetupShort
// 0x0090 (0x0090 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetupShort final
{
public:
	struct FSBCharacterWeaponPerkData             Param_PerkData;                                    // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         Rarity;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemId;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkId;                                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691E[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData;                     // 0x0038(0x001C)(NoDestructor)
	bool                                          CallFunc_BP_FindMasterFusionItem_Exists;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691F[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_BP_FindMasterFusionItem_ReturnValue;      // 0x0058(0x0018)(NoDestructor)
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData_1;                   // 0x0070(0x001C)(NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetupShort) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetupShort");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetupShort) == 0x000090, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetupShort");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, Param_PerkData) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::Param_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, Rarity) == 0x00001C, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::Rarity' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, ItemId) == 0x000020, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::ItemId' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, PerkId) == 0x000024, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::PerkId' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, CallFunc_GetMasterDataManager_IsValid) == 0x000028, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, CallFunc_GetMasterDataManager_ReturnValue) == 0x000030, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, CallFunc_GetPerkData_PerkData) == 0x000038, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::CallFunc_GetPerkData_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, CallFunc_BP_FindMasterFusionItem_Exists) == 0x000054, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::CallFunc_BP_FindMasterFusionItem_Exists' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, CallFunc_BP_FindMasterFusionItem_ReturnValue) == 0x000058, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::CallFunc_BP_FindMasterFusionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupShort, CallFunc_GetPerkData_PerkData_1) == 0x000070, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupShort::CallFunc_GetPerkData_PerkData_1' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetupLong
// 0x0090 (0x0090 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetupLong final
{
public:
	struct FSBCharacterWeaponPerkData             Param_PerkData;                                    // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	int32                                         ItemId;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rarity;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkId;                                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6920[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData;                     // 0x0038(0x001C)(NoDestructor)
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData_1;                   // 0x0054(0x001C)(NoDestructor)
	bool                                          CallFunc_BP_FindMasterFusionItem_Exists;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6921[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_BP_FindMasterFusionItem_ReturnValue;      // 0x0074(0x0018)(NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetupLong) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetupLong");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetupLong) == 0x000090, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetupLong");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, Param_PerkData) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::Param_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, ItemId) == 0x00001C, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::ItemId' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, Rarity) == 0x000020, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::Rarity' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, PerkId) == 0x000024, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::PerkId' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, CallFunc_GetMasterDataManager_IsValid) == 0x000028, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, CallFunc_GetMasterDataManager_ReturnValue) == 0x000030, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, CallFunc_GetPerkData_PerkData) == 0x000038, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::CallFunc_GetPerkData_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, CallFunc_GetPerkData_PerkData_1) == 0x000054, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::CallFunc_GetPerkData_PerkData_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, CallFunc_BP_FindMasterFusionItem_Exists) == 0x000070, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::CallFunc_BP_FindMasterFusionItem_Exists' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLong, CallFunc_BP_FindMasterFusionItem_ReturnValue) == 0x000074, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLong::CallFunc_BP_FindMasterFusionItem_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetPerkData
// 0x001C (0x001C - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetPerkData final
{
public:
	struct FSBCharacterWeaponPerkData             InPerkData;                                        // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetPerkData) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetPerkData");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetPerkData) == 0x00001C, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetPerkData");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerkData, InPerkData) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerkData::InPerkData' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetVisibleSelect
// 0x0005 (0x0005 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect) == 0x000005, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect::InVisible' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect, Temp_bool_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect, Temp_byte_Variable) == 0x000002, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect, Temp_byte_Variable_1) == 0x000003, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect, K2Node_Select_Default) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleSelect::K2Node_Select_Default' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetVisibleButton
// 0x0005 (0x0005 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetVisibleButton final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetVisibleButton");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton) == 0x000005, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetVisibleButton");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleButton::InVisible' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton, Temp_bool_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton, Temp_byte_Variable) == 0x000002, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton, Temp_byte_Variable_1) == 0x000003, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetVisibleButton, K2Node_Select_Default) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetVisibleButton::K2Node_Select_Default' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetupOverlapRemove
// 0x0018 (0x0018 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove final
{
public:
	bool                                          IsRemove;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6922[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6923[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove) == 0x000018, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, IsRemove) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::IsRemove' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, Temp_bool_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, Temp_int_Variable) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, Temp_int_Variable_1) == 0x000008, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, Temp_bool_Variable_1) == 0x00000C, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, K2Node_Select_Default) == 0x000010, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, Temp_byte_Variable) == 0x000014, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, Temp_byte_Variable_1) == 0x000015, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove, K2Node_Select_Default_1) == 0x000016, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapRemove::K2Node_Select_Default_1' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetupOverlapLock
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupOverlapLock::InVisible' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetSlot
// 0x0004 (0x0004 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetSlot final
{
public:
	int32                                         SlotNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetSlot) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetSlot");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetSlot) == 0x000004, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetSlot");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetSlot, SlotNum) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetSlot::SlotNum' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetSlotIcon
// 0x0004 (0x0004 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetSlotIcon final
{
public:
	int32                                         SlotNum;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetSlotIcon) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetSlotIcon");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetSlotIcon) == 0x000004, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetSlotIcon");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetSlotIcon, SlotNum) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetSlotIcon::SlotNum' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetPerk
// 0x0160 (0x0160 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetPerk final
{
public:
	struct FSBCharacterWeaponPerkData             WeaponPerkData;                                    // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FName                                   AbilityDBRowName2;                                 // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityDBRowName1;                                 // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6924[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AbilityName2;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AbilityName1;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Param_Name;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         AbilityEffectId;                                   // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemId;                                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCharacterWeaponPerkData             TmpWeaponPerkData;                                 // 0x0068(0x001C)(Edit, BlueprintVisible, NoDestructor)
	int32                                         CallFunc_GetAbilityEffectID_AbilityEffectID;       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemName_OutName;                      // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetItemName_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6925[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	bool                                          CallFunc_GetAbilityPartsName_IsValid;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6926[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetAbilityPartsName_AbilityParts1Name;    // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAbilityPartsName_AbilityParts2Name;    // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6927[0x4];                                     // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBAbilityTextData                     CallFunc_GetAbilityTextDataCollection_ReturnValue; // 0x00D0(0x0050)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0120(0x0018)()
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6928[0x5];                                     // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0140(0x0018)()
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue_1;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetPerk) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetPerk");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetPerk) == 0x000160, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetPerk");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, WeaponPerkData) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::WeaponPerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, AbilityDBRowName2) == 0x00001C, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::AbilityDBRowName2' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, AbilityDBRowName1) == 0x000024, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::AbilityDBRowName1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, AbilityName2) == 0x000030, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::AbilityName2' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, AbilityName1) == 0x000040, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::AbilityName1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, Param_Name) == 0x000050, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::Param_Name' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, AbilityEffectId) == 0x000060, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::AbilityEffectId' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, ItemId) == 0x000064, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::ItemId' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, TmpWeaponPerkData) == 0x000068, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::TmpWeaponPerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetAbilityEffectID_AbilityEffectID) == 0x000084, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetAbilityEffectID_AbilityEffectID' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetItemName_OutName) == 0x000088, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetItemName_OutName' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetItemName_ReturnValue) == 0x000098, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetAbilityPartsName_IsValid) == 0x0000B8, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetAbilityPartsName_IsValid' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetAbilityPartsName_AbilityParts1Name) == 0x0000BC, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetAbilityPartsName_AbilityParts1Name' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetAbilityPartsName_AbilityParts2Name) == 0x0000C4, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetAbilityPartsName_AbilityParts2Name' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_GetAbilityTextDataCollection_ReturnValue) == 0x0000D0, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_GetAbilityTextDataCollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000120, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000138, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_IsEmpty_ReturnValue) == 0x000139, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_Not_PreBool_ReturnValue) == 0x00013A, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000140, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_NotEqual_StrStr_ReturnValue_1) == 0x000158, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_NotEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_IsEmpty_ReturnValue_1) == 0x000159, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerk, CallFunc_Not_PreBool_ReturnValue_1) == 0x00015A, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerk::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetPerkEmpty
// 0x0028 (0x0028 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty final
{
public:
	class FString                                 CallFunc_GetTextFromAsset_ReturnValue;             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty) == 0x000028, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty, CallFunc_GetTextFromAsset_ReturnValue) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty::CallFunc_GetTextFromAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WeaponSynthePart_PerkSlotItem_C_SetPerkEmpty::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetItemName
// 0x0018 (0x0018 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetItemName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetItemName) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetItemName");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetItemName) == 0x000018, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetItemName");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetItemName, InText) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetItemName::InText' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetAbility1Visible
// 0x0005 (0x0005 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible) == 0x000005, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible::InVisible' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible, Temp_byte_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible, Temp_byte_Variable_1) == 0x000002, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible, Temp_bool_Variable) == 0x000003, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible, K2Node_Select_Default) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Visible::K2Node_Select_Default' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetAbility1Name
// 0x0018 (0x0018 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetAbility1Name final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Name) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetAbility1Name");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Name) == 0x000018, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetAbility1Name");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Name, InText) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Name::InText' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetAbility1Value
// 0x0050 (0x0050 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetAbility1Value final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCharacterWeaponPerkData             InWeaponPerkData;                                  // 0x0008(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_6929[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConvertAbilityEffectValueText_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Value) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetAbility1Value");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Value) == 0x000050, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetAbility1Value");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Value, RowName) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Value::RowName' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Value, InWeaponPerkData) == 0x000008, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Value::InWeaponPerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Value, CallFunc_ConvertAbilityEffectValueText_ReturnValue) == 0x000028, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Value::CallFunc_ConvertAbilityEffectValueText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility1Value, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility1Value::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetAbility2Visible
// 0x0005 (0x0005 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible) == 0x000005, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible::InVisible' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible, Temp_byte_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible, Temp_byte_Variable_1) == 0x000002, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible, Temp_bool_Variable) == 0x000003, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible, K2Node_Select_Default) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Visible::K2Node_Select_Default' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetAbility2Name
// 0x0018 (0x0018 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetAbility2Name final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Name) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetAbility2Name");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Name) == 0x000018, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetAbility2Name");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Name, InText) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Name::InText' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetAbility2Value
// 0x0050 (0x0050 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetAbility2Value final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBCharacterWeaponPerkData             InWeaponPerkData;                                  // 0x0008(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_692A[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_ConvertAbilityEffectValueText_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Value) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetAbility2Value");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Value) == 0x000050, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetAbility2Value");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Value, RowName) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Value::RowName' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Value, InWeaponPerkData) == 0x000008, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Value::InWeaponPerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Value, CallFunc_ConvertAbilityEffectValueText_ReturnValue) == 0x000028, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Value::CallFunc_ConvertAbilityEffectValueText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetAbility2Value, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WeaponSynthePart_PerkSlotItem_C_SetAbility2Value::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetRarityVisible
// 0x0005 (0x0005 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetRarityVisible final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetRarityVisible");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible) == 0x000005, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetRarityVisible");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarityVisible::InVisible' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible, Temp_bool_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarityVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible, Temp_byte_Variable) == 0x000002, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarityVisible::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible, Temp_byte_Variable_1) == 0x000003, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarityVisible::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarityVisible, K2Node_Select_Default) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarityVisible::K2Node_Select_Default' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetRarity
// 0x0008 (0x0008 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetRarity final
{
public:
	int32                                         InRarity;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetRarity) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetRarity");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetRarity) == 0x000008, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetRarity");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarity, InRarity) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarity::InRarity' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetRarity, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'WeaponSynthePart_PerkSlotItem_C_SetRarity::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetupTag
// 0x003C (0x003C - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetupTag final
{
public:
	struct FSBCharacterWeaponPerkData             Before;                                            // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FSBCharacterWeaponPerkData             After;                                             // 0x001C(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	ESlotDataChangeType                           CallFunc_GetSlotDataChangeType_Type;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetupTag) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetupTag");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetupTag) == 0x00003C, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetupTag");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupTag, Before) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupTag::Before' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupTag, After) == 0x00001C, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupTag::After' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupTag, CallFunc_GetSlotDataChangeType_Type) == 0x000038, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupTag::CallFunc_GetSlotDataChangeType_Type' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetupLock
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetupLock final
{
public:
	bool                                          Param_IsLock;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetupLock) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetupLock");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetupLock) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetupLock");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetupLock, Param_IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetupLock::Param_IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotItem.WeaponSynthePart_PerkSlotItem_C.SetOptionVisible
// 0x0005 (0x0005 - 0x0000)
struct WeaponSynthePart_PerkSlotItem_C_SetOptionVisible final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotItem_C_SetOptionVisible) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotItem_C_SetOptionVisible");
static_assert(sizeof(WeaponSynthePart_PerkSlotItem_C_SetOptionVisible) == 0x000005, "Wrong size on WeaponSynthePart_PerkSlotItem_C_SetOptionVisible");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetOptionVisible, InVisible) == 0x000000, "Member 'WeaponSynthePart_PerkSlotItem_C_SetOptionVisible::InVisible' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetOptionVisible, Temp_bool_Variable) == 0x000001, "Member 'WeaponSynthePart_PerkSlotItem_C_SetOptionVisible::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotItem_C_SetOptionVisible, Temp_byte_Variable) == 0x000002, "Member 'WeaponSynthePart_PerkSlotItem_C_SetOptionVisible::Temp_byte_Variable' has a wrong offset!");
