#pragma once

 

// Package: WeaponSynthePart_PerkSlotBox

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SkyBlue_structs.hpp"


namespace SDK::Params
{

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.OnProtectNumChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature final
{
public:
	int32                                         ProtectNum;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature) == 0x000004, "Wrong size on WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature, ProtectNum) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_OnProtectNumChanged__DelegateSignature::ProtectNum' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.OnClickedPerkSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature final
{
public:
	int32                                         SlotNo;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature) == 0x000004, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature) == 0x000004, "Wrong size on WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature, SlotNo) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_OnClickedPerkSlot__DelegateSignature::SlotNo' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.ExecuteUbergraph_WeaponSynthePart_PerkSlotBox
// 0x0020 (0x0020 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6952[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWeaponSynthePart_PerkSlotItem_C*> K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          K2Node_ComponentBoundEvent_IsLock_3;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsLock_2;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsLock_1;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_IsLock;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox) == 0x000020, "Wrong size on WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, EntryPoint) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, K2Node_MakeArray_Array) == 0x000008, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, K2Node_ComponentBoundEvent_IsLock_3) == 0x000018, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::K2Node_ComponentBoundEvent_IsLock_3' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, K2Node_ComponentBoundEvent_IsLock_2) == 0x000019, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::K2Node_ComponentBoundEvent_IsLock_2' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, K2Node_ComponentBoundEvent_IsLock_1) == 0x00001A, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::K2Node_ComponentBoundEvent_IsLock_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox, K2Node_ComponentBoundEvent_IsLock) == 0x00001B, "Member 'WeaponSynthePart_PerkSlotBox_C_ExecuteUbergraph_WeaponSynthePart_PerkSlotBox::K2Node_ComponentBoundEvent_IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature final
{
public:
	bool                                          IsLock;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature, IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot4_K2Node_ComponentBoundEvent_3_OnClickedLock__DelegateSignature::IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature final
{
public:
	bool                                          IsLock;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature, IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot3_K2Node_ComponentBoundEvent_2_OnClickedLock__DelegateSignature::IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature final
{
public:
	bool                                          IsLock;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature, IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot2_K2Node_ComponentBoundEvent_1_OnClickedLock__DelegateSignature::IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature final
{
public:
	bool                                          IsLock;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature, IsLock) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_BndEvt__WeaponSynthePart_PerkSlotBox_PerkSlot1_K2Node_ComponentBoundEvent_0_OnClickedLock__DelegateSignature::IsLock' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_PreConstruct) == 0x000001, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_PreConstruct");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_PreConstruct) == 0x000001, "Wrong size on WeaponSynthePart_PerkSlotBox_C_PreConstruct");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.OnPreConstruct
// 0x0020 (0x0020 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_OnPreConstruct final
{
public:
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_OnPreConstruct) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_OnPreConstruct");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_OnPreConstruct) == 0x000020, "Wrong size on WeaponSynthePart_PerkSlotBox_C_OnPreConstruct");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_OnPreConstruct, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_OnPreConstruct::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_OnPreConstruct, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000008, "Member 'WeaponSynthePart_PerkSlotBox_C_OnPreConstruct::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_OnPreConstruct, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000010, "Member 'WeaponSynthePart_PerkSlotBox_C_OnPreConstruct::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_OnPreConstruct, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000018, "Member 'WeaponSynthePart_PerkSlotBox_C_OnPreConstruct::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.Reset
// 0x0038 (0x0038 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_Reset final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6953[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWeaponSynthePart_PerkSlotItem_C*> CallFunc_GetPerkSlotList_PerkSlotList;             // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6954[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthePart_PerkSlotItem_C*       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_Reset) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_Reset");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_Reset) == 0x000038, "Wrong size on WeaponSynthePart_PerkSlotBox_C_Reset");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, CallFunc_GetPerkSlotList_PerkSlotList) == 0x000010, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::CallFunc_GetPerkSlotList_PerkSlotList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, CallFunc_Array_Get_Item) == 0x000028, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_Reset, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WeaponSynthePart_PerkSlotBox_C_Reset::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.SetupSynthe
// 0x01D0 (0x01D0 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_SetupSynthe final
{
public:
	struct FOwnItemInfo                           InWeapon;                                          // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         PerkIndex;                                         // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6955[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthePart_PerkSlotItem_C*       SlotItem;                                          // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBCharacterWeaponPerkData>     PerkList;                                          // 0x0128(0x0010)(Edit, BlueprintVisible)
	int32                                         PerkUnlockNum;                                     // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6956[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPerkData_Result;                       // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6957[0x2];                                     // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData;                     // 0x0168(0x001C)(NoDestructor)
	bool                                          CallFunc_BP_FindMasterFusionItem_Exists;           // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6958[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_BP_FindMasterFusionItem_ReturnValue;      // 0x0188(0x0018)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6959[0x4];                                     // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWeaponSynthePart_PerkSlotItem_C*> CallFunc_GetPerkSlotList_PerkSlotList;             // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_695A[0x4];                                     // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthePart_PerkSlotItem_C*       CallFunc_Array_Get_Item;                           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_SetupSynthe");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe) == 0x0001D0, "Wrong size on WeaponSynthePart_PerkSlotBox_C_SetupSynthe");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, InWeapon) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::InWeapon' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, PerkIndex) == 0x000118, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::PerkIndex' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, SlotItem) == 0x000120, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::SlotItem' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, PerkList) == 0x000128, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::PerkList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, PerkUnlockNum) == 0x000138, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::PerkUnlockNum' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, Temp_int_Array_Index_Variable) == 0x00013C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, Temp_int_Loop_Counter_Variable) == 0x000140, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Add_IntInt_ReturnValue) == 0x000144, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Subtract_IntInt_ReturnValue) == 0x000148, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, Temp_int_Variable) == 0x00014C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, Temp_int_Variable_1) == 0x000150, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_GetMasterDataManager_IsValid) == 0x000154, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_GetMasterDataManager_ReturnValue) == 0x000158, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Add_IntInt_ReturnValue_1) == 0x000160, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_GetPerkData_Result) == 0x000165, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_GetPerkData_Result' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_GetPerkData_PerkData) == 0x000168, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_GetPerkData_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_BP_FindMasterFusionItem_Exists) == 0x000184, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_BP_FindMasterFusionItem_Exists' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_BP_FindMasterFusionItem_ReturnValue) == 0x000188, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_BP_FindMasterFusionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001A0, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_GetPerkSlotList_PerkSlotList) == 0x0001A8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_GetPerkSlotList_PerkSlotList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Array_Get_Item) == 0x0001C0, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSynthe, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSynthe::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.SetupSyntheResult
// 0x01E0 (0x01E0 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult final
{
public:
	struct FOwnItemInfo                           InWeaponAfter;                                     // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InSlotNo;                                          // 0x0118(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelect;                                          // 0x011C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695B[0x3];                                     // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthePart_PerkSlotItem_C*       SlotItem;                                          // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkIndex;                                         // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_695C[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBCharacterWeaponPerkData>     PerkList;                                          // 0x0130(0x0010)(Edit, BlueprintVisible)
	int32                                         PerkUnlockNum;                                     // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695D[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPerkData_Result;                       // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695E[0x2];                                     // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData;                     // 0x0170(0x001C)(NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_FindMasterFusionItem_Exists;           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695F[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_BP_FindMasterFusionItem_ReturnValue;      // 0x0194(0x0018)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6960[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWeaponSynthePart_PerkSlotItem_C*> CallFunc_GetPerkSlotList_PerkSlotList;             // 0x01B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6961[0x4];                                     // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthePart_PerkSlotItem_C*       CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult) == 0x0001E0, "Wrong size on WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, InWeaponAfter) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::InWeaponAfter' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, InSlotNo) == 0x000118, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::InSlotNo' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, IsSelect) == 0x00011C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::IsSelect' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, SlotItem) == 0x000120, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::SlotItem' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, PerkIndex) == 0x000128, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::PerkIndex' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, PerkList) == 0x000130, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::PerkList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, PerkUnlockNum) == 0x000140, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::PerkUnlockNum' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, Temp_int_Array_Index_Variable) == 0x000144, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Subtract_IntInt_ReturnValue) == 0x000148, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, Temp_int_Loop_Counter_Variable) == 0x00014C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, Temp_int_Variable) == 0x000150, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Add_IntInt_ReturnValue) == 0x000154, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_GetMasterDataManager_IsValid) == 0x000158, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_GetMasterDataManager_ReturnValue) == 0x000160, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Add_IntInt_ReturnValue_1) == 0x000168, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Less_IntInt_ReturnValue) == 0x00016C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_GetPerkData_Result) == 0x00016D, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_GetPerkData_Result' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_GetPerkData_PerkData) == 0x000170, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_GetPerkData_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, Temp_int_Variable_1) == 0x00018C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_BP_FindMasterFusionItem_Exists) == 0x000190, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_BP_FindMasterFusionItem_Exists' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_BP_FindMasterFusionItem_ReturnValue) == 0x000194, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_BP_FindMasterFusionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001AC, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001B0, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_GetPerkSlotList_PerkSlotList) == 0x0001B8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_GetPerkSlotList_PerkSlotList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Array_Length_ReturnValue) == 0x0001C8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001D8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupSyntheResult::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.SetupAddSlot
// 0x01C8 (0x01C8 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_SetupAddSlot final
{
public:
	struct FOwnItemInfo                           InWeapon;                                          // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWeaponSynthePart_PerkSlotItem_C*       SlotItem;                                          // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkIndex;                                         // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6962[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBCharacterWeaponPerkData>     PerkList;                                          // 0x0128(0x0010)(Edit, BlueprintVisible)
	int32                                         PerkUnlockNum;                                     // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6963[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6964[0x3];                                     // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPerkData_Result;                       // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6965[0x2];                                     // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData;                     // 0x016C(0x001C)(NoDestructor)
	bool                                          CallFunc_BP_FindMasterFusionItem_Exists;           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6966[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_BP_FindMasterFusionItem_ReturnValue;      // 0x018C(0x0018)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWeaponSynthePart_PerkSlotItem_C*> CallFunc_GetPerkSlotList_PerkSlotList;             // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWeaponSynthePart_PerkSlotItem_C*       CallFunc_Array_Get_Item;                           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot) == 0x000008, "Wrong alignment on WeaponSynthePart_PerkSlotBox_C_SetupAddSlot");
static_assert(sizeof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot) == 0x0001C8, "Wrong size on WeaponSynthePart_PerkSlotBox_C_SetupAddSlot");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, InWeapon) == 0x000000, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::InWeapon' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, SlotItem) == 0x000118, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::SlotItem' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, PerkIndex) == 0x000120, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::PerkIndex' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, PerkList) == 0x000128, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::PerkList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, PerkUnlockNum) == 0x000138, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::PerkUnlockNum' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, Temp_bool_True_if_break_was_hit_Variable) == 0x00013C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Not_PreBool_ReturnValue) == 0x00013D, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, Temp_int_Array_Index_Variable) == 0x000140, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, Temp_int_Variable) == 0x000144, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Subtract_IntInt_ReturnValue) == 0x000148, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_GetMasterDataManager_IsValid) == 0x00014C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_GetMasterDataManager_IsValid' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_GetMasterDataManager_ReturnValue) == 0x000150, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_GetMasterDataManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x000160, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, Temp_int_Variable_1) == 0x000164, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000168, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_GetPerkData_Result) == 0x000169, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_GetPerkData_Result' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_GetPerkData_PerkData) == 0x00016C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_GetPerkData_PerkData' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_BP_FindMasterFusionItem_Exists) == 0x000188, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_BP_FindMasterFusionItem_Exists' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_BP_FindMasterFusionItem_ReturnValue) == 0x00018C, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_BP_FindMasterFusionItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0001A4, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_GetPerkSlotList_PerkSlotList) == 0x0001A8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_GetPerkSlotList_PerkSlotList' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Array_Length_ReturnValue) == 0x0001C0, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001C4, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSynthePart_PerkSlotBox_C_SetupAddSlot, CallFunc_BooleanAND_ReturnValue) == 0x0001C5, "Member 'WeaponSynthePart_PerkSlotBox_C_SetupAddSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WeaponSynthePart_PerkSlotBox.WeaponSynthePart_PerkSlotBox_C.SetupAddSlotResult
// 0x01E0 (0x01E0 - 0x0000)
struct WeaponSynthePart_PerkSlotBox_C_SetupAddSlotResult final
{
public:
	struct FOwnItemInfo                           InWeaponAfter;                                     // 0x0000(0x0118)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsLast;                                            // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6967[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponSynthePart_PerkSlotItem_C*       SlotItem;                                          // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkIndex;                                         // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6968[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBCharacterWeaponPerkData>     PerkList;                                          // 0x0130(0x0010)(Edit, BlueprintVisible)
	int32                                         PerkUnlockNum;                                     // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6969[0x3];                                     // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMasterDataManager_IsValid;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_696A[0x7];                                     // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBMasterDataManager*                   CallFunc_GetMasterDataManager_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPerkData_Result;                       // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_696B[0x2];                                     // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBCharacterWeaponPerkData             CallFunc_GetPerkData_PerkData;                     // 0x0178(0x001C)(NoDestructor)
	bool                                          CallFunc_BP_FindMasterFusionItem_Exists;           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_696C[0x3];                                     // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBMasterFusionItem                    CallFunc_BP_FindMasterFusionItem_ReturnValue;      // 0x0198(0x0018)(NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_696D[0x4];                                     // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWeaponSynthePart_PerkSlotItem_C*> CallFunc_GetPerkSlotList_PerkSlotList;             // 0x01B8(0x0010)(ReferenceParm, ContainsInstancedReference)
